
//////////////////////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭлементОтбора = СписокТекущиеЗадачи.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Исполнитель");
	ЭлементОтбора.ПравоеЗначение = ПараметрыСеанса.ТекущийПользователь;
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	
	ЭлементОтбора = СписокТекущиеЗадачи.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Выполнена");
	ЭлементОтбора.ПравоеЗначение = Ложь;
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТекущиеЗадачиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыполнитьДействие();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТекущиеЗадачиПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	ВыполнитьДействие();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействие()
	
	ТД = Элементы.СписокТекущиеЗадачи.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры
