
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если ЭтотОбъект.Параметры.Свойство("СобиратьДанныеПроизводительности") Тогда
        
        НовСтрока = ЭтотОбъект.РеквизитыИзменить.Добавить();
        
        НовСтрока.ФлагИзменить = Истина;
        НовСтрока.ИмяРеквизита = "СобиратьДанныеПроизводительности";
        НовСтрока.ПредставлениеРеквизита = "Включить сбор счетчиков";
        НовСтрока.ЗначениеРеквизита = ЭтотОбъект.Параметры.СобиратьДанныеПроизводительности;
                
    КонецЕсли;
    
    Если ЭтотОбъект.Параметры.Свойство("ПериодЗаписи") Тогда
        
        НовСтрока = ЭтотОбъект.РеквизитыИзменить.Добавить();
        
        НовСтрока.ФлагИзменить = Истина;
        НовСтрока.ИмяРеквизита = "ПериодЗаписи";
        НовСтрока.ПредставлениеРеквизита = "Период записи";
        НовСтрока.ЗначениеРеквизита = ЭтотОбъект.Параметры.ПериодЗаписи;
                
    КонецЕсли;
    
    Если ЭтотОбъект.Параметры.Свойство("ПроверятьДоступность") Тогда
        
        НовСтрока = ЭтотОбъект.РеквизитыИзменить.Добавить();
        
        НовСтрока.ФлагИзменить = Истина;
        НовСтрока.ИмяРеквизита = "ПроверятьДоступность";
        НовСтрока.ПредставлениеРеквизита = "Проверять доступность";
        НовСтрока.ЗначениеРеквизита = ЭтотОбъект.Параметры.ПроверятьДоступность;
                
    КонецЕсли;
    
    Если ЭтотОбъект.Параметры.Свойство("Таймаут") Тогда
        
        НовСтрока = ЭтотОбъект.РеквизитыИзменить.Добавить();
        
        НовСтрока.ФлагИзменить = Истина;
        НовСтрока.ИмяРеквизита = "Таймаут";
        НовСтрока.ПредставлениеРеквизита = "Таймаут";
        НовСтрока.ЗначениеРеквизита = ЭтотОбъект.Параметры.Таймаут;
        
    КонецЕсли;
    
    Если ЭтотОбъект.Параметры.Свойство("ПериодКонтроля") Тогда
        
        НовСтрока = ЭтотОбъект.РеквизитыИзменить.Добавить();
        
        НовСтрока.ФлагИзменить = Истина;
        НовСтрока.ИмяРеквизита = "ПериодКонтроля";
        НовСтрока.ПредставлениеРеквизита = "Период контроля";
        НовСтрока.ЗначениеРеквизита = ЭтотОбъект.Параметры.ПериодКонтроля;
        
    КонецЕсли;
    
    Если ЭтотОбъект.Параметры.Свойство("МинимальныйПроцентДоступности") Тогда
        
        НовСтрока = ЭтотОбъект.РеквизитыИзменить.Добавить();
        
        НовСтрока.ФлагИзменить = Истина;
        НовСтрока.ИмяРеквизита = "МинимальныйПроцентДоступности";
        НовСтрока.ПредставлениеРеквизита = "Минимальный процент доступности";
        НовСтрока.ЗначениеРеквизита = ЭтотОбъект.Параметры.МинимальныйПроцентДоступности;
        
    КонецЕсли;
    
    Если ЭтотОбъект.Параметры.Свойство("ДопустимоНетДанных") Тогда
        
        НовСтрока = ЭтотОбъект.РеквизитыИзменить.Добавить();
        
        НовСтрока.ФлагИзменить = Истина;
        НовСтрока.ИмяРеквизита = "ДопустимоНетДанных";
        НовСтрока.ПредставлениеРеквизита = "Допустимо нет данных";
        НовСтрока.ЗначениеРеквизита = ЭтотОбъект.Параметры.ДопустимоНетДанных;
        
    КонецЕсли;
    
    Если ЭтотОбъект.Параметры.Свойство("ИспользоватьВнешнегоАгента") Тогда
        
        НовСтрока = ЭтотОбъект.РеквизитыИзменить.Добавить();
        
        НовСтрока.ФлагИзменить = Истина;
        НовСтрока.ИмяРеквизита = "ИспользоватьВнешнегоАгента";
        НовСтрока.ПредставлениеРеквизита = "Использовать внешнего агента";
        НовСтрока.ЗначениеРеквизита = ЭтотОбъект.Параметры.ИспользоватьВнешнегоАгента;
        
    КонецЕсли;
    
    Если ЭтотОбъект.Параметры.Свойство("РегистрироватьДампы") Тогда
        
        НовСтрока = ЭтотОбъект.РеквизитыИзменить.Добавить();
        
        НовСтрока.ФлагИзменить = Истина;
        НовСтрока.ИмяРеквизита = "РегистрироватьДампы";
        НовСтрока.ПредставлениеРеквизита = "Регистрировать дампы";
        НовСтрока.ЗначениеРеквизита = ЭтотОбъект.Параметры.РегистрироватьДампы;
        
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Установить(Команда)
    
    РезультатЗакрытия = Новый Структура;
    
    Для Каждого ТекСтрока Из ЭтотОбъект.РеквизитыИзменить Цикл
        
        Если ТекСтрока.ФлагИзменить Тогда
            РезультатЗакрытия.Вставить(ТекСтрока.ИмяРеквизита, ТекСтрока.ЗначениеРеквизита);
        КонецЕсли;
        
    КонецЦикла;
    
    ЭтотОбъект.Закрыть(РезультатЗакрытия);
    
КонецПроцедуры

#КонецОбласти
