
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УровниПовторногоОповещения = Новый Соответствие;
	УровниПовторногоОповещения.Вставить(Перечисления.УровниИнцидентов.Информация, 7200);
	УровниПовторногоОповещения.Вставить(Перечисления.УровниИнцидентов.Предупреждение, 3600);
	УровниПовторногоОповещения.Вставить(Перечисления.УровниИнцидентов.Ошибка, 1800);
	УровниПовторногоОповещения.Вставить(Перечисления.УровниИнцидентов.КритическаяОшибка, 600);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	УровеньИнцидента,
	|	ПериодПовторногоОповещения
	|ИЗ
	|	РегистрСведений.УровниИнцидентовПовторноеОповещение
	|";
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		УровниПовторногоОповещения[Выборка.УровеньИнцидента] = Выборка.ПериодПовторногоОповещения;
	КонецЦикла;
			
	НовСтрока = ЭтотОбъект.УровниИнцидентов.Добавить();
	НовСтрока.УровеньИнцидента = Перечисления.УровниИнцидентов.Информация;
	НовСтрока.ПериодПовторногоОповещения = УровниПовторногоОповещения[НовСтрока.УровеньИнцидента];
	
	НовСтрока = ЭтотОбъект.УровниИнцидентов.Добавить();
	НовСтрока.УровеньИнцидента = Перечисления.УровниИнцидентов.Предупреждение;
	НовСтрока.ПериодПовторногоОповещения = УровниПовторногоОповещения[НовСтрока.УровеньИнцидента];
	
	НовСтрока = ЭтотОбъект.УровниИнцидентов.Добавить();
	НовСтрока.УровеньИнцидента = Перечисления.УровниИнцидентов.Ошибка;
	НовСтрока.ПериодПовторногоОповещения = УровниПовторногоОповещения[НовСтрока.УровеньИнцидента];
	
	НовСтрока = ЭтотОбъект.УровниИнцидентов.Добавить();
	НовСтрока.УровеньИнцидента = Перечисления.УровниИнцидентов.КритическаяОшибка;
	НовСтрока.ПериодПовторногоОповещения = УровниПовторногоОповещения[НовСтрока.УровеньИнцидента];
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьПериодыПовторногоОповещения(Команда)
	
	ЗаписатьПериодыПовторногоОповещенияНаСервере();
	ЭтотОбъект.Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьПериодыПовторногоОповещенияНаСервере()
	
	НаборЗаписей = РегистрыСведений.УровниИнцидентовПовторноеОповещение.СоздатьНаборЗаписей();
	Для Каждого ТекСтрока Из ЭтотОбъект.УровниИнцидентов Цикл
		НовСтрока = НаборЗаписей.Добавить();
		НовСтрока.УровеньИнцидента = ТекСтрока.УровеньИнцидента;
		НовСтрока.ПериодПовторногоОповещения = ТекСтрока.ПериодПовторногоОповещения;	
	КонецЦикла;
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти
