#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПолучитьОсновнойШаблонПревышенПорогПотребленияПамяти() Экспорт
	Возврат "[Дата=дд.ММ.гг ЧЧ:мм];Превышение объема памяти;Процесс=[Процесс];Сервер=[Сервер];Память=[Память]Мб;Отправитель=[Отправитель]";
КонецФункции

Функция ПолучитьШаблонПервойРегистрацииПревышенПорогПотребленияПамяти() Экспорт
	Возврат "Первичная регистрация ошибки";
КонецФункции

Функция ПолучитьШаблонПовторнойРегистрацииПревышенПорогПотребленияПамяти() Экспорт
	Возврат "Период ошибки: [ДатаНачала=дд.ММ.гг ЧЧ:мм] - [ДатаЗавершения=дд.ММ.гг ЧЧ:мм]";
КонецФункции

Функция ПолучитьОсновнойШаблонНедоступенКластер() Экспорт
	Возврат "[Дата=дд.ММ.гг ЧЧ:мм];Кластер 1С [Отправитель] не доступен;[ПодробноеПредставлениеОшибки]";
КонецФункции

Функция ПолучитьШаблонПервойРегистрацииНедоступенКластер() Экспорт
	Возврат "Первичная регистрация ошибки";
КонецФункции

Функция ПолучитьШаблонПовторнойРегистрацииНедоступенКластер() Экспорт
	Возврат "Период недоступности: [ДатаНачала=дд.ММ.гг ЧЧ:мм] - [ДатаЗавершения=дд.ММ.гг ЧЧ:мм";
КонецФункции

#КонецЕсли