#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция УдалитьУстаревшиеДанные() Экспорт
	
	ЕстьУдаление = Ложь;
	
	ТекДата = ТекущаяДата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УникальныйИдентификаторФормы
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 10000
	|		УникальныйИдентификаторФормы
	|	ИЗ
	|		РегистрСведений.ГруппыСчетчиковФормаСпискаЕстьКонтрольПодчиненных
	|	ГДЕ
	|		Период < &ГраницаУдаления
	|	) КАК Выборка
	|";
	
	Запрос.УстановитьПараметр("ГраницаУдаления", НачалоДня(ТекДата) - 86400);
		
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	НаборЗаписей = РегистрыСведений.ГруппыСчетчиковФормаСпискаЕстьКонтрольПодчиненных.СоздатьНаборЗаписей();
	Пока Выборка.Следующий() Цикл
		ЕстьУдаление = Истина;
		НаборЗаписей.Отбор.УникальныйИдентификаторФормы.Установить(Выборка.УникальныйИдентификаторФормы);
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
		
	Возврат ЕстьУдаление;
	
КонецФункции

#КонецЕсли