#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция РазобратьКомментарий(Комментарий) Экспорт
	
	ДопИнформацияДляЗаписи = Новый Соответствие;
	
	КомментарийМассив = СтрРазделить(Комментарий, ";");
	Если КомментарийМассив.Количество() = 3 Тогда
		ДопИнформацияДляЗаписи.Вставить("Платформа", КомментарийМассив[0]);
		ДопИнформацияДляЗаписи.Вставить("Область данных", КомментарийМассив[2]);
		
		ПараметрыКонфигурацииМассив = СтрРазделить(КомментарийМассив[1], ",");
		Если ПараметрыКонфигурацииМассив.Количество() = 3 Тогда
			ДопИнформацияДляЗаписи.Вставить("Версия конфигурации", СтрРазделить(ПараметрыКонфигурацииМассив[2], " ")[2]);
			ПараметрыКонфигурацииМассив.Удалить(2);
			ДопИнформацияДляЗаписи.Вставить("Конфигурация", СтрСоединить(ПараметрыКонфигурацииМассив, ","));
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(Комментарий) Тогда
			ДопИнформацияДляЗаписи.Вставить("Дополнительная информация", Комментарий);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДопИнформацияДляЗаписи; 
	
КонецФункции

#КонецЕсли