#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьДокументАгрегата(Дата, Конфигурация) Экспорт
    
    Запрос = Новый Запрос;
    
    Запрос.Текст = "
    |ВЫБРАТЬ
    |    АгрегатЗамерыВремени.Ссылка КАК Ссылка
    |ИЗ
    |    Документ.АгрегатЗамерыВремени КАК АгрегатЗамерыВремени
    |ГДЕ
    |    АгрегатЗамерыВремени.Дата = &Дата
    |    И АгрегатЗамерыВремени.Конфигурация = &Конфигурация
    |";
    
    Запрос.УстановитьПараметр("Дата", Дата);
    Запрос.УстановитьПараметр("Конфигурация", Конфигурация);
    
    Результат = Запрос.Выполнить();
    Если НЕ Результат.Пустой() Тогда
        Выборка = Результат.Выбрать();
        Выборка.Следующий();
        ДокументАгрегатаСсылка = Выборка.Ссылка; 
    Иначе
        ДокументАгрегата = Документы.АгрегатЗамерыВремени.СоздатьДокумент();
        ДокументАгрегата.Дата = Дата;
        ДокументАгрегата.Конфигурация = Конфигурация;
        ДокументАгрегата.Записать();
        
        ДокументАгрегатаСсылка = ДокументАгрегата.Ссылка;
    КонецЕсли;
    
    Возврат ДокументАгрегатаСсылка;
        
КонецФункции

#КонецОбласти

#КонецЕсли