#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция УдалитьУстаревшиеДанные(КрайняяДатаЗаписи) Экспорт
	
	ЕстьУдаление = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 100
	|	Ссылка
	|ИЗ
	|	Справочник.ОтправкаСообщений
	|ГДЕ
	|	ДатаОтправки < &КрайняяДатаЗаписи
	|УПОРЯДОЧИТЬ ПО
	|	ДатаОтправки ВОЗР
	|";
	
	Запрос.УстановитьПараметр("КрайняяДатаЗаписи", КрайняяДатаЗаписи);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		ЕстьУдаление = Истина;
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Выборка.Ссылка.ПолучитьОбъект().Удалить();
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ЕстьУдаление;
	
КонецФункции

#КонецЕсли