#Область СлужебныеПроцедурыИФункции

Процедура ЗавершитьЗамерыСлужебный(ТекДата) Экспорт
    
    Для Каждого ТекЗамер Из ВнутренниеЗамерыПроизводительностиБуферКлиента Цикл
        
        Замер = ТекЗамер.Значение;
        
        Если Замер["АвтоЗавершение"] И Замер["ДатаОкончания"] = 0 Тогда
            ВнутренниеЗамерыКлиент.ЗавершитьЗамер(ТекЗамер.Ключ, ТекДата);
        КонецЕсли;
        
    КонецЦикла;
    
КонецПроцедуры

Функция ЗаписатьБуферКлиента() Экспорт
    
    ЗамерыЗаписать = Новый Соответствие;
    
    Для Каждого ТекЗамер Из ВнутренниеЗамерыПроизводительностиБуферКлиента Цикл
        Если ТекЗамер.Значение["ДатаОкончания"] > 0 Тогда
            ЗамерыЗаписать.Вставить(ТекЗамер.Ключ, ТекЗамер.Значение);
        КонецЕсли;
    КонецЦикла;
    
    ПериодЗаписи = ВнутренниеЗамерыВызовСервера.ЗаписатьБуферКлиента(ЗамерыЗаписать);
    
    Для Каждого ТекЗамер Из ЗамерыЗаписать Цикл
        ВнутренниеЗамерыПроизводительностиБуферКлиента.Удалить(ТекЗамер.Ключ);    
    КонецЦикла;
    
    Возврат ПериодЗаписи;
    
КонецФункции

#КонецОбласти