#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьОтборПоДоступным();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоДоступным()
	Если Не РаботаСоСценариямиАвтоматизацииПраваДоступа.ПроверитьНаличиеПолногоДоступаКФункционалуАвтоматизации() Тогда
		
		Ограничения = РаботаСоСценариямиАвтоматизацииПовторноеИспользование.ПолучитьСписокОграниченийДляТекущегоПользователя();
		
		Если Ограничения.Количество() > 0 Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	КомандыАвтоматизации.Ссылка КАК Ссылка
			                      |ИЗ
			                      |	Справочник.КомандыАвтоматизации КАК КомандыАвтоматизации
			                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КомандыАвтоматизации.КонтурыАдминистрирования КАК КомандыАвтоматизацииКонтурыАвтоматизации
			                      |		ПО КомандыАвтоматизации.Ссылка = КомандыАвтоматизацииКонтурыАвтоматизации.Ссылка
			                      |ГДЕ
			                      |	КомандыАвтоматизацииКонтурыАвтоматизации.Ссылка ЕСТЬ NULL
			                      |
			                      |ОБЪЕДИНИТЬ ВСЕ
			                      |
			                      |ВЫБРАТЬ
			                      |	КомандыАвтоматизации.Ссылка
			                      |ИЗ
			                      |	Справочник.КомандыАвтоматизации КАК КомандыАвтоматизации
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КомандыАвтоматизации.КонтурыАдминистрирования КАК КомандыАвтоматизацииКонтурыАвтоматизации
			                      |		ПО КомандыАвтоматизации.Ссылка = КомандыАвтоматизацииКонтурыАвтоматизации.Ссылка
			                      |			И (КомандыАвтоматизацииКонтурыАвтоматизации.Контур В (&ДоступныеКонтуры))");
			Запрос.УстановитьПараметр("ДоступныеКонтуры", Ограничения);
			
			ОтборКоманд = Запрос.Выполнить().Выгрузить();
			
			РаботаСоСценариямиАвтоматизацииПраваДоступа.УстановитьОтборПоДоступнымЭлементамНаСписокФормы(Список, ОтборКоманд.ВыгрузитьКолонку("Ссылка"));
		КонецЕсли;	
	КонецЕсли;		
КонецПроцедуры	

&НаСервере
Процедура СписокПриИзмененииНаСервере()
	УстановитьОтборПоДоступным();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	СписокПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти
