////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗапрещенныеИнформационныеБазыВМассив = Новый Массив;
	
	ЭтотОбъект.ЦентрКонтроляКачества = Справочники.ОбъектыКонтроля.НайтиПоНаименованию("Центр Контроля Качества");
	ЭтотОбъект.ЦентрМониторинга = Справочники.ОбъектыКонтроля.НайтиПоНаименованию("Центр мониторинга");
	Если НЕ Константы.ОтображатьВнутренниеЗамерыПроизводительности.Получить() Тогда
		ЗапрещенныеИнформационныеБазыВМассив.Добавить(ЭтотОбъект.ЦентрКонтроляКачества);	
		ЗапрещенныеИнформационныеБазыВМассив.Добавить(ЭтотОбъект.ЦентрМониторинга);
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("ЗапрещенныеИнформационныеБазы", ЗапрещенныеИнформационныеБазыВМассив);
	
	ЭтотОбъект.Параметры.ЗакрыватьПриВыборе = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВнутренниеИнформационныеБазы(Команда)
	
	ЗапрещенныеИнформационныеБазыВМассив = Новый Массив;
	
	Список.Параметры.УстановитьЗначениеПараметра("ЗапрещенныеИнформационныеБазы", ЗапрещенныеИнформационныеБазыВМассив);
	
	ЭтотОбъект.Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьВнутренниеИнформационныеБазы(Команда)
	
	ЗапрещенныеИнформационныеБазыВМассив = Новый Массив;
	
	ЗапрещенныеИнформационныеБазыВМассив.Добавить(ЭтотОбъект.ЦентрКонтроляКачества);	
	ЗапрещенныеИнформационныеБазыВМассив.Добавить(ЭтотОбъект.ЦентрМониторинга);
		
	Список.Параметры.УстановитьЗначениеПараметра("ЗапрещенныеИнформационныеБазы", ЗапрещенныеИнформационныеБазыВМассив);
	
	ЭтотОбъект.Элементы.Список.Обновить();
	
КонецПроцедуры
