#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьПривилегированныйРежим(Истина);
	МассивПользователейИБ = ПользователиИнформационнойБазы.ПолучитьПользователей();
	
	КС = Новый КвалификаторыСтроки(150);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("Булево"));
	ОписаниеТиповБ = Новый ОписаниеТипов(Массив);
	
	ТаблицаПользователейИБ = Новый ТаблицаЗначений;
	ТаблицаПользователейИБ.Колонки.Добавить("Имя", ОписаниеТиповС);
	ТаблицаПользователейИБ.Колонки.Добавить("ПолноеИмя", ОписаниеТиповС);
	ТаблицаПользователейИБ.Колонки.Добавить("Выбран", ОписаниеТиповБ);
	
	Для каждого Элемент Из МассивПользователейИБ Цикл
		НоваяСтрока = ТаблицаПользователейИБ.Добавить();
		НоваяСтрока.Имя = Элемент.Имя;
		НоваяСтрока.ПолноеИмя = Элемент.ПолноеИмя;
	КонецЦикла;
	ТаблицаПользователейИБ.Сортировать("Имя");
	УстановитьПривилегированныйРежим(Ложь);
	
	ЗначениеВДанныеФормы(ТаблицаПользователейИБ, ПользователиИБ);
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	ЭтотОбъект.Закрыть(ПользователиИБ);
КонецПроцедуры

&НаКлиенте
Процедура Выделить(Команда)
	УстановитьФлажки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьВыделение(Команда)
	УстановитьФлажки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Флаг)
	Для каждого Строка Из ПользователиИБ Цикл
		Строка.Выбран = Флаг;
	КонецЦикла;	
КонецПроцедуры

#КонецОбласти