
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокДопустимыхЦветовДанные = РеквизитФормыВЗначение("СписокДопустимыхЦветов");
	
	// возможные цвета
	Цвета = МониторингКлиентСервер.ВозможныеЦветаЛинии();
	НомерЦвета = 0;
	Для Каждого ВозможныйЦвет Из Цвета Цикл
		
		ДобавитьЦвет(СписокДопустимыхЦветовДанные, 
			ВозможныйЦвет.Красный,
			ВозможныйЦвет.Зеленый,
			ВозможныйЦвет.Синий,
			ВозможныйЦвет.Название,
			НомерЦвета
		);
		НомерЦвета = НомерЦвета + 1;
		
	КонецЦикла;
	ЗначениеВРеквизитФормы(СписокДопустимыхЦветовДанные, "СписокДопустимыхЦветов");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЦвет(СписокДопустимыхЦветовДанные, Красный, Зеленый, Синий, НазваниеЦвета, ИндексИконкиЦвета)
	
	СтрокаЦвета = СписокДопустимыхЦветовДанные.Строки.Добавить();
	СтрокаЦвета.НазваниеЦвета = НазваниеЦвета;
	СтрокаЦвета.ЦветЛинии = Новый Цвет(Красный, Зеленый, Синий);
	СтрокаЦвета.ИндексИконкиЦвета = ИндексИконкиЦвета;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьПараметры(Команда)
	СохранитьИЗакрыть(СписокДопустимыхЦветов.НайтиПоИдентификатору(Элементы.СписокДопустимыхЦветов.ТекущаяСтрока).ЦветЛинии);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	ЭтотОбъект.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(ВыбранныеЦвет)
	ЭтотОбъект.Закрыть(ВыбранныеЦвет);
КонецПроцедуры

&НаКлиенте
Процедура СписокДопустимыхЦветовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СохранитьИЗакрыть(СписокДопустимыхЦветов.НайтиПоИдентификатору(ВыбраннаяСтрока).ЦветЛинии);
КонецПроцедуры

