
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.КонтрольПоступленияДанных = ЭтотОбъект.Параметры.КонтрольПоступленияДанных;
	ЭтотОбъект.ДопустимоеВремяОтсутствияДанных = ЭтотОбъект.Параметры.ДопустимоеВремяОтсутствияДанных;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не ЗначениеЗаполнено(ЭтотОбъект.РежимУстановки) Тогда
		ЭтотОбъект.РежимУстановки = "Для элементов";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаДа(Команда)
	
	ПараметрЗакрытия = Новый Структура;
	ПараметрЗакрытия.Вставить("Выполнить", Истина);
	ПараметрЗакрытия.Вставить("РежимУстановки", ЭтотОбъект.РежимУстановки);
	ПараметрЗакрытия.Вставить("КонтрольПоступленияДанных", ЭтотОбъект.КонтрольПоступленияДанных);
	ПараметрЗакрытия.Вставить("ДопустимоеВремяОтсутствияДанных", ЭтотОбъект.ДопустимоеВремяОтсутствияДанных);
	ЭтотОбъект.Закрыть(ПараметрЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНет(Команда)
	
	ПараметрЗакрытия = Новый Структура;
	ПараметрЗакрытия.Вставить("Выполнить", Ложь);
	ЭтотОбъект.Закрыть(ПараметрЗакрытия);
	
КонецПроцедуры
