#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПолучитьВнешниеЦККДляОтправки(Источник) Экспорт
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТЧ_ВнешниеЦКК.ВнешнийЦКК
	|ИЗ
	|	Справочник.ВнешниеЦКК КАК СправочникВнешниеЦКК
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.ВнешниеЦКК.ВнешниеЦКК КАК ТЧ_ВнешниеЦКК
	|ПО
	|	ТЧ_ВнешниеЦКК.Ссылка = СправочникВнешниеЦКК.Ссылка
	|	И ТЧ_ВнешниеЦКК.ПередаватьДанные = ИСТИНА
	|ГДЕ
	|	СправочникВнешниеЦКК.Пользователь = &Источник
	|	И СправочникВнешниеЦКК.ТипВнешнегоЦКК = &ТипВнешнегоЦКК
	|";
	
	Запрос.УстановитьПараметр("Источник", Источник);
	Запрос.УстановитьПараметр("ТипВнешнегоЦКК", Перечисления.ТипыВнешнихЦКК.Подчиненные);
	
	Результат = Запрос.Выполнить();
	ВнешниеЦКК = Новый Массив;
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ВнешниеЦКК.Добавить(Выборка.ВнешнийЦКК);
	КонецЦикла;
	
	Возврат ВнешниеЦКК;
КонецФункции

Функция ПолучитьВнешниеЦККДляОтправкиСчетчиков() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СправочникВнешниеЦКК.Ссылка КАК ВнешнийЦКК
	|ИЗ
	|	Справочник.ВнешниеЦКК КАК СправочникВнешниеЦКК
	|ГДЕ
	|	СправочникВнешниеЦКК.ЭкспортСчетчиков = ИСТИНА
	|	И СправочникВнешниеЦКК.ТипВнешнегоЦКК = &ТипВнешнегоЦКК
	|";
	
	Запрос.УстановитьПараметр("ТипВнешнегоЦКК", Перечисления.ТипыВнешнихЦКК.Главные);
	Результат = Запрос.Выполнить();
	
	ВнешниеЦКК = Новый Массив;
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ВнешниеЦКК.Добавить(Выборка.ВнешнийЦКК);
	КонецЦикла;
	
	Возврат ВнешниеЦКК;
КонецФункции

#КонецЕсли

