#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ПередЗаписью(Отказ)
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ЭтотОбъект.УИДПользователя);
	
	Если ЭтотОбъект.ТипВнешнегоЦКК = Перечисления.ТипыВнешнихЦКК.Подчиненные Тогда
		Если ПользовательИБ = Неопределено Тогда
			ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
		КонецЕсли;
		ПользовательИБ.Имя = ЭтотОбъект.Пользователь;
		ПользовательИБ.ПолноеИмя = ЭтотОбъект.Пользователь + " (создан автоматически для подчинненого ЦКК)";
		ПользовательИБ.Пароль = ЭтотОбъект.Пароль;
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.InputStatistics);
		ПользовательИБ.Записать();
		
		ЭтотОбъект.УИДПользователя = ПользовательИБ.УникальныйИдентификатор;
		
		Пользователь1С_Ссылка = Справочники.Пользователи.НайтиПоНаименованию(ЭтотОбъект.Пользователь);
		Если Пользователь1С_Ссылка = Справочники.Пользователи.ПустаяСсылка() Тогда
			Пользователь1С = Справочники.Пользователи.СоздатьЭлемент();
			Пользователь1С.Наименование = ЭтотОбъект.Пользователь;
			Пользователь1С.УникальныйИдентификатор = ПользовательИБ.УникальныйИдентификатор;
			РольПользователя = Пользователь1С.Роли.Добавить();
			РольПользователя.Выбрана = Истина;
			РольПользователя.Роль = "InputStatistics";
			РольПользователя.СинонимРоли = "Input statistics";
		Иначе
			Пользователь1С = Пользователь1С_Ссылка.ПолучитьОбъект();
		КонецЕсли;
		Пользователь1С.Записать();
	Иначе
		Если ПользовательИБ <> Неопределено Тогда
			ПользовательИБ.Удалить();
			ЭтотОбъект.УИДПользователя = "";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецЕсли