#Область ОбработчикиСобытий

&НаКлиенте
Процедура КаталогУстановкиWINПриИзменении(Элемент)
	СкорректироватьРеквизитыWin();	
КонецПроцедуры

&НаКлиенте
Процедура КаталогУстановкиLINПриИзменении(Элемент)
	СкорректироватьРеквизитыLinux();
КонецПроцедуры

&НаКлиенте
Процедура ПоУмолчаниюWinПриИзменении(Элемент)
	Элементы.КаталогУстановкиWIN.Видимость = Не Объект.УстановкаПоУмолчаниюWin;
	СкорректироватьРеквизитыWin();	
КонецПроцедуры

&НаКлиенте
Процедура ПоУмолчаниюLinuxПриИзменении(Элемент)
	Элементы.КаталогУстановкиLIN.Видимость = Не Объект.УстановкаПоУмолчаниюLinux;
	СкорректироватьРеквизитыLinux();
КонецПроцедуры

&НаКлиенте
Процедура СкорректироватьРеквизитыWin()
	Если Не ПустаяСтрока(Объект.КаталогУстановкиWIN) Или Объект.УстановкаПоУмолчаниюWin  Тогда
		Если ПустаяСтрока(Объект.РабочийКаталогДляАвтоматизацииWIN) Тогда
			Объект.РабочийКаталогДляАвтоматизацииWIN = "src";
		КонецЕсли;	
		Если ПустаяСтрока(Объект.КаталогКонфигурацийДляАвтоматизацииWIN) Тогда
			Объект.КаталогКонфигурацийДляАвтоматизацииWIN = "win_configs";
		КонецЕсли;
	КонецЕсли;	
	
	Если ПустаяСтрока(Объект.КорневойСкриптАвтоматизацииWIN) Тогда
		Объект.КорневойСкриптАвтоматизацииWIN = "composite_runner.py";
	КонецЕсли;	
	Если ПустаяСтрока(Объект.СловарьКомандАвтоматизацииWIN) Тогда
		Объект.СловарьКомандАвтоматизацииWIN = "dictionary.yml";
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СкорректироватьРеквизитыLinux()
	Если Не ПустаяСтрока(Объект.КаталогУстановкиLIN) Или Объект.УстановкаПоУмолчаниюLinux Тогда
		Если ПустаяСтрока(Объект.РабочийКаталогДляАвтоматизацииLIN) Тогда
			Объект.РабочийКаталогДляАвтоматизацииLIN = "src";
		КонецЕсли;	
		Если ПустаяСтрока(Объект.КаталогКонфигурацийДляАвтоматизацииLIN) Тогда
			Объект.КаталогКонфигурацийДляАвтоматизацииLIN = "linux_configs";
		КонецЕсли;	
	КонецЕсли;	
		
	Если ПустаяСтрока(Объект.КорневойСкриптАвтоматизацииLIN) Тогда
		Объект.КорневойСкриптАвтоматизацииLIN = "composite_runner.py";
	КонецЕсли;	
	Если ПустаяСтрока(Объект.СловарьКомандАвтоматизацииLIN) Тогда
		Объект.СловарьКомандАвтоматизацииLIN = "dictionary.yml";
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.КаталогУстановкиWIN.Видимость = Не Объект.УстановкаПоУмолчаниюWin;
	Элементы.КаталогУстановкиLIN.Видимость = Не Объект.УстановкаПоУмолчаниюLinux;
КонецПроцедуры

#КонецОбласти
