#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьОтборПоДоступным();	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоДоступным()
	Если Не РаботаСоСценариямиАвтоматизацииПраваДоступа.ПроверитьНаличиеПолногоДоступаКФункционалуАвтоматизации() Тогда
		Ограничения = РаботаСоСценариямиАвтоматизацииПовторноеИспользование.ПолучитьСписокОграниченийДляТекущегоПользователя();
		
		Если Ограничения.Количество() > 0 Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	ХранилищеКонфиденциальнойИнформации.Ссылка КАК Ссылка
			                      |ИЗ
			                      |	Справочник.ХранилищеКонфиденциальнойИнформации КАК ХранилищеКонфиденциальнойИнформации
			                      |ГДЕ
			                      |	(ХранилищеКонфиденциальнойИнформации.КонтурАдминистрирования В (&ДоступныеКонтуры)
			                      |			ИЛИ ХранилищеКонфиденциальнойИнформации.КонтурАдминистрирования = ЗНАЧЕНИЕ(Справочник.КонтурыАдминистрирования.ПустаяСсылка))");
			Запрос.УстановитьПараметр("ДоступныеКонтуры", Ограничения);
			
			ОтборСписка = Запрос.Выполнить().Выгрузить();
			
			РаботаСоСценариямиАвтоматизацииПраваДоступа.УстановитьОтборПоДоступнымЭлементамНаСписокФормы(Список, ОтборСписка.ВыгрузитьКолонку("Ссылка"));
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры	

#КонецОбласти