////////////////////////////////////////////////////////////////////////////////
//  Методы, связанные с учетом версий платформы
//  
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Получает версию платформы по строке
//
// Параметры:
//  Версия - Строка, строка типа 8.x.xx.xxx
//
// Возвращаемое значение:
//  СправочникСсылка.ВерсииПлатформы
//
Функция ВерсияПлатформы(Версия) Экспорт
	
	ПредставлениеВерсии = ПолучитьПредставлениеВерсии(Версия);
	
	НужнаяВерсия = НайтиВерсиюПлатформы(ПредставлениеВерсии);
	Если НужнаяВерсия = Неопределено ИЛИ НужнаяВерсия.Пустая() Тогда
		НужнаяВерсия = СоздатьВерсиюПлатформы(ПредставлениеВерсии);
	КонецЕсли;
	
	Возврат НужнаяВерсия;
	
КонецФункции

// Находит версию платформы по строке
//
// Параметры:
//  Версия - Строка, строка типа 8214519
//
// Возвращаемое значение:
//  СправочникСсылка.ВерсииПлатформы
//
Функция НайтиВерсиюПлатформы(Версия)
	
	НайденнаяВерсия = Справочники.ВерсииПлатформы.НайтиПоНаименованию(Версия);
	
	Возврат НайденнаяВерсия;
	
КонецФункции

// Создает версию платформы по строке
//
// Параметры:
//  Версия - Строка, строка типа 8.x.xx.xxx
//  ПредставлениеВерсии - Строка, строка типа 8214519
//
// Возвращаемое значение:
//  СправочникСсылка.ВерсииПлатформы
//
Функция СоздатьВерсиюПлатформы(ПредставлениеВерсии)
	
	ЭлементОбъект = Справочники.ВерсииПлатформы.СоздатьЭлемент();
	ЭлементОбъект.Наименование = ПредставлениеВерсии;
	ЭлементОбъект.Записать();
	
	Возврат ЭлементОбъект.Ссылка;
	
КонецФункции

// Преобразует строку типа 8.x.xx.xxx в 8xxxxxx
//
// Параметры:
//  Версия - Строка, строка типа 8.x.xx.xxx
//
// Возвращаемое значение:
//  Строка, строка типа 8214519
//
Функция ПолучитьПредставлениеВерсии(Версия)
	
	Возврат СокрЛП(Версия);
	
КонецФункции


