
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ЭтотОбъект.ОсновнаяПлощадка = Константы.ПлощадкаЭксплуатацииПоУмолчанию.Получить();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОсновнаяПлощадкаПриИзменении(Элемент)
    Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
    
    Если Модифицированность Тогда
        Модифицированность = Ложь;
        ЗаписатьНаСервере(ЭтотОбъект.ОсновнаяПлощадка);
    КонецЕсли;
    
    ЭтотОбъект.Закрыть();
    
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
    
    Если Модифицированность Тогда
        Модифицированность = Ложь;
        ЗаписатьНаСервере(ЭтотОбъект.ОсновнаяПлощадка);
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ЗаписатьНаСервере(ПлощадкаЭксплуатации)
    Константы.ПлощадкаЭксплуатацииПоУмолчанию.Установить(ПлощадкаЭксплуатации);    
КонецПроцедуры

#КонецОбласти
