
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьНастройкиПоУмолчанию() Экспорт
	
	НаборЗаписей = РегистрыСведений.УровниИнцидентовПовторноеОповещение.СоздатьНаборЗаписей();
	
	НовЗапись = НаборЗаписей.Добавить();
	НовЗапись.УровеньИнцидента = Перечисления.УровниИнцидентов.Информация;
	НовЗапись.ПериодПовторногоОповещения = 7200;
	
	НовЗапись = НаборЗаписей.Добавить();
	НовЗапись.УровеньИнцидента = Перечисления.УровниИнцидентов.Предупреждение;
	НовЗапись.ПериодПовторногоОповещения = 3600;
	
	НовЗапись = НаборЗаписей.Добавить();
	НовЗапись.УровеньИнцидента = Перечисления.УровниИнцидентов.Ошибка;
	НовЗапись.ПериодПовторногоОповещения = 1800;
	
	НовЗапись = НаборЗаписей.Добавить();
	НовЗапись.УровеньИнцидента = Перечисления.УровниИнцидентов.КритическаяОшибка;
	НовЗапись.ПериодПовторногоОповещения = 600;
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли
