
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Информация.Параметры.УстановитьЗначениеПараметра("ИнформационнаяБаза", Объект.Ссылка);
	МетаданныеКонфигурации.Параметры.УстановитьЗначениеПараметра("ИнформационнаяБаза", Объект.Ссылка);
	ФункциональныеОпции.Параметры.УстановитьЗначениеПараметра("ИнформационнаяБаза", Объект.Ссылка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Конфигурация КАК Конфигурация,
	|	РежимРаботыКонфигурации КАК РежимРаботыКонфигурации,
	|	РазделениеПоОбластям КАК РазделениеПоОбластям
	|ИЗ
	|	РегистрСведений.КонфигурацияИнформационнойБазыСрезПоследних
	|ГДЕ
	|	ИнформационнаяБаза = &ИнформационнаяБаза
	|";
	Запрос.УстановитьПараметр("ИнформационнаяБаза", Объект.Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЭтотОбъект.Конфигурация = Выборка.Конфигурация;
		ЭтотОбъект.РежимРаботыКонфигурации = Выборка.РежимРаботыКонфигурации;
		ЭтотОбъект.РазделениеПоОбластям = Выборка.РазделениеПоОбластям;
		
	КонецЦикла;
	
КонецПроцедуры
