
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ОценкаПроизводительностиКлючевыеОперации.Имя,
	|	ОценкаПроизводительностиКлючевыеОперации.Приоритет,
	|	ОценкаПроизводительностиКлючевыеОперации.ЦелевоеВремя,
	|	ОценкаПроизводительностиКлючевыеОперации.МинимальноДопустимыйУровень,
	|	ЗамерыПроизводительности.ДатаЗаписи КАК ДатаЗаписи,
	|	ЗамерыПроизводительности.ДатаЗамераUTC КАК ДатаЗамера,
	|	ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(2015,1,1), СЕКУНДА, (ЗамерыПроизводительности.ДатаЗамераUTC/1000) - 63555667200) КАК ДатаЗамераПредставление,
	|	ЗамерыПроизводительности.НомерСеанса,
	|	ЗамерыПроизводительности.Пользователь,
	|	ЗамерыПроизводительности.Значение,
	|	ЗамерыПроизводительности.ОбъектКонтроля КАК ИнформационнаяБаза
	|ИЗ
	|	РегистрСведений.ЗамерыПроизводительности КАК ЗамерыПроизводительности
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ОценкаПроизводительностиКлючевыеОперации КАК ОценкаПроизводительностиКлючевыеОперации
	|ПО
	|	ЗамерыПроизводительности.ОбъектКонтроля = ОценкаПроизводительностиКлючевыеОперации.ИнформационнаяБаза
	|	И ЗамерыПроизводительности.ИдентификаторКлючевойОперации = ОценкаПроизводительностиКлючевыеОперации.УникальныйИдентификатор 
	|%УсловиеНаБазу%";
	
	ОбъектКонтроля = Параметры.ОбъектКонтроля;
	Если ЗначениеЗаполнено(ОбъектКонтроля) Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеНаБазу%", " ГДЕ ЗамерыПроизводительности.ОбъектКонтроля = &ОбъектКонтроля И ДатаЗамераUTC > 99999999999");
		Замеры.ТекстЗапроса = ТекстЗапроса;
		
		Замеры.Параметры.УстановитьЗначениеПараметра("ОбъектКонтроля", ОбъектКонтроля);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеНаБазу%", " ГДЕ ДатаЗамераUTC > 99999999999");
		Замеры.ТекстЗапроса = ТекстЗапроса;
		
	КонецЕсли;
	
КонецПроцедуры
