
&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ОКНаСервере()
	УстановитьПривилегированныйРежим(Истина);
	Пользователь = ПараметрыСеанса.ТекущийПользователь.ПолучитьОбъект();
	Пользователь.ДополнительныеСвойства.Вставить("СохраняемыйПарольПользователя", Пароль);
	Пользователь.Записать();
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	Если Пароль = ПодтверждениеПароля Тогда 
		ОКНаСервере();
		Закрыть();
	Иначе 
		Сообщить("Пароль и подтверждение не совпадают!");
		Пароль = "";
		ПодтверждениеПароля = "";
	КонецЕсли;
КонецПроцедуры
