////////////////////////////////////////////////////////////////////////////////
// Методы, используемые на сервере при работе контроля появления дампов
// Возвращаемые значения сохраняются на время сеанса
//  
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Создает структуру для описания имени файла дампа
//
// Возвращаемое значение:
//  Структура
//
Функция СтруктураИмениФайлаДампа() Экспорт
	
	Возврат Новый Структура("Процесс, ИмяПроцесса, ВерсияПлатформы, Смещение, ДатаВремя, PID, ИмяДампа, ПолноеИмя, ИмяФайлаБезРасширения, Расширение");
	
КонецФункции

// Получает из строки ссылку на процесс
//
// Параметры:
//  ИмяПроцесса - Строка
//
// Возвращаемое значение:
//  ПеречислениеСсылка.Процессы
//
Функция ТипУпавшегоПроцесса(ИмяПроцесса) Экспорт
	
	Процесс = Неопределено;
    ВРегИмяПроцесса = ВРег(ИмяПроцесса);
    
	Если ВРегИмяПроцесса = "1CV8C" Тогда
		Процесс = Перечисления.Процессы.ТонкийКлиент;
	ИначеЕсли ВРегИмяПроцесса = "1CV8" Тогда
		Процесс = Перечисления.Процессы.ТолстыйКлиент;
	ИначеЕсли ВРегИмяПроцесса = "RAGENT" Тогда
		Процесс = Перечисления.Процессы.Агент;
	ИначеЕсли ВРегИмяПроцесса = "RMNGR" Тогда
		Процесс = Перечисления.Процессы.Менеджер;
	ИначеЕсли ВРегИмяПроцесса = "RPHOST" Тогда
		Процесс = Перечисления.Процессы.РабочийПроцесс;
	ИначеЕсли ВРегИмяПроцесса = "W3WP" Тогда
		Процесс = Перечисления.Процессы.IIS;
	ИначеЕсли ВРегИмяПроцесса = "HTTPD" Тогда
		Процесс = Перечисления.Процессы.Apache;
	ИначеЕсли ВРегИмяПроцесса = "RAS" Тогда
		Процесс = Перечисления.Процессы.RAS;
	ИначеЕсли ВРегИмяПроцесса = "RAC" Тогда
		Процесс = Перечисления.Процессы.RAC;
	ИначеЕсли ВРегИмяПроцесса = "RPHOST_WER" Тогда
		Процесс = Перечисления.Процессы.РабочийПроцессWER;
	ИначеЕсли ВРегИмяПроцесса = "RMNGR_WER" Тогда
		Процесс = Перечисления.Процессы.МенеджерWER;
	ИначеЕсли ВРегИмяПроцесса = "RAGENT_WER" Тогда
		Процесс = Перечисления.Процессы.АгентWER;
    ИначеЕсли СтрНачинаетсяС(ВРегИмяПроцесса, "OUTAGE") Тогда
        Процесс = Перечисления.Процессы.OutageWER;
	Иначе
		Процесс = Перечисления.Процессы.WindowsErrorReporting;
	КонецЕсли;
	
	Возврат Процесс;
	
КонецФункции

