#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПолучитьКрайнююВерсиюОбновления() Экспорт
	 Запрос = Новый Запрос;
	 
	 Запрос.Текст = "
	 |ВЫБРАТЬ
	 |	Версии.Версия КАК Версия
	 |ИЗ
	 |	РегистрСведений.ВерсииИнформационнойБазы КАК Версии
	 |ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	 |	(ВЫБРАТЬ
	 |		МАКСИМУМ(ВерсияМаксимум.ВерсияЧисло) КАК ВерсияЧисло
	 |	ИЗ
	 |		РегистрСведений.ВерсииИнформационнойБазы КАК ВерсияМаксимум
	 |	) КАК ВерсияМаксимум
	 |ПО
	 |	Версии.ВерсияЧисло = ВерсияМаксимум.ВерсияЧисло
	 |";
	 
	 Результат = Запрос.Выполнить();
	 Если Результат.Пустой() Тогда
		 Возврат Неопределено;
	 Иначе
		 Возврат Результат.Выгрузить()[0].Версия;
	 КонецЕсли;
 КонецФункции
 
#КонецЕсли
 