
&НаКлиенте
Процедура ОК(Команда)
	ЭтотОбъект.Закрыть(ТекущееЗначение());
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтотОбъект.Закрыть(Неопределено);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТЗ = Параметры.ТекущееЗначение;
	
	Если ТЗ = 0 Тогда
		Флаг_00 = Истина;
		Возврат;
	КонецЕсли;
	
	Степень = 0;
	Пока Истина Цикл
		
		Если ТЗ % 2 = 1 Тогда
			ЭтотОбъект["Флаг_" + Формат(Степень, "ЧН=0; ЧГ=0")] = Истина;
			ТЗ = ТЗ - 1;
		КонецЕсли;
		
		Если ТЗ = 0 Тогда
			Прервать;
		КонецЕсли;
		
		ТЗ = ТЗ / 2;
		Степень = Степень + 1;
		
	КонецЦикла;
КонецПроцедуры

Функция ТекущееЗначение()
	
	ТЗ = 0;
	База = 1;
	Для Степень = 0 По 9 Цикл
		Если ЭтотОбъект["Флаг_" + Формат(Степень, "ЧН=0; ЧГ=0")] Тогда
			ТЗ = ТЗ + База;
		КонецЕсли;
		База = База * 2;
	КонецЦикла;
	Возврат ТЗ;
	
КонецФункции

&НаКлиенте
Процедура Флаг_00ПриИзменении(Элемент)
	Если Флаг_00 Тогда
		Для Степень = 0 По 9 Цикл
			ЭтотОбъект["Флаг_" + Формат(Степень, "ЧН=0; ЧГ=0")] = Ложь;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Флаг_0ПриИзменении(Элемент)
	Если Флаг_0 Тогда
		Флаг_00 = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Флаг_1ПриИзменении(Элемент)
	Если Флаг_1 Тогда
		Флаг_00 = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Флаг_2ПриИзменении(Элемент)
	Если Флаг_2 Тогда
		Флаг_00 = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Флаг_3ПриИзменении(Элемент)
	Если Флаг_3 Тогда
		Флаг_00 = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Флаг_4ПриИзменении(Элемент)
	Если Флаг_4 Тогда
		Флаг_00 = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Флаг_5ПриИзменении(Элемент)
	Если Флаг_5 Тогда
		лаг_00 = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Флаг_6ПриИзменении(Элемент)
	Если Флаг_6 Тогда
		Флаг_00 = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Флаг_7ПриИзменении(Элемент)
	Если Флаг_7 Тогда
		Флаг_00 = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Флаг_8ПриИзменении(Элемент)
	Если Флаг_8 Тогда
		Флаг_00 = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Флаг_9ПриИзменении(Элемент)
	Если Флаг_9 Тогда
		Флаг_00 = Ложь;
	КонецЕсли;
КонецПроцедуры
