#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДниНедели = Новый Массив;
	
	Параметры.Свойство("Начало", Начало);
	Параметры.Свойство("Окончание", Окончание);
	Параметры.Свойство("ДатаКонца", ДатаКонца);
	Параметры.Свойство("КоличествоПовторов", КоличествоПовторов);
	Параметры.Свойство("ПериодНедель", ПериодНедель);
	Параметры.Свойство("ПериодПовтораДней", ПериодПовтораДней);
	Параметры.Свойство("ДниНедели", ДниНедели);
	Параметры.Свойство("РасписаниеЗадано", РасписаниеЗадано);
	
	Если ТипЗнч(ДниНедели) = Тип("Массив") И ДниНедели.Количество() = 0 Тогда
		ДниНедели = Новый Массив;
		Для День = 1 По 7 Цикл
			ДниНедели.Добавить(День);
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого ЭлементМассива Из ДниНедели Цикл
		Если ЭлементМассива = 1 Тогда
			День_Пн = Истина;
		ИначеЕсли ЭлементМассива = 2 Тогда
			День_Вт = Истина;
		ИначеЕсли ЭлементМассива = 3 Тогда
			День_Ср = Истина;
		ИначеЕсли ЭлементМассива = 4 Тогда
			День_Чт = Истина;
		ИначеЕсли ЭлементМассива = 5 Тогда
			День_Пт = Истина;
		ИначеЕсли ЭлементМассива = 6 Тогда
			День_Сб = Истина;
		ИначеЕсли ЭлементМассива = 7 Тогда
			День_Вс = Истина;
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ЭлементРасписанияПриИзменении(Элемент)
	ПреобразоватьВРасписание();
КонецПроцедуры

&НаКлиенте
Процедура ПреобразоватьВРасписание()
	Расписание = Новый РасписаниеЭлементаПланировщика;	
	
	Расписание.ДатаКонца = ?(ЗначениеЗаполнено(ДатаКонца), ДатаКонца, Неопределено);
	Расписание.КоличествоПовторов = ?(ЗначениеЗаполнено(КоличествоПовторов), КоличествоПовторов, Неопределено);
	Расписание.ПериодНедель = ?(ЗначениеЗаполнено(ПериодНедель), ПериодНедель, Неопределено);
	Расписание.ПериодПовтораДней = ?(ЗначениеЗаполнено(ПериодПовтораДней), ПериодПовтораДней, Неопределено);
	
	Расписание.ДниНедели.Очистить();
	Если День_Пн Тогда
		Расписание.ДниНедели.Добавить(1);
	КонецЕсли;	
	Если День_Вт Тогда
		Расписание.ДниНедели.Добавить(2);
	КонецЕсли;	
	Если День_Ср Тогда
		Расписание.ДниНедели.Добавить(3);
	КонецЕсли;	
	Если День_Чт Тогда
		Расписание.ДниНедели.Добавить(4);
	КонецЕсли;	
	Если День_Пт Тогда
		Расписание.ДниНедели.Добавить(5);
	КонецЕсли;	
	Если День_Сб Тогда
		Расписание.ДниНедели.Добавить(6);
	КонецЕсли;	
	Если День_Вс Тогда
		Расписание.ДниНедели.Добавить(7);
	КонецЕсли;	
	
	Элементы.ДекорацияРасписание.Заголовок = Расписание;
	Модифицированность = Истина;
КонецПроцедуры	

&НаКлиенте
Процедура РасписаниеЗаданоПриИзменении(Элемент)
    Модифицированность = Истина;
	УстановитьВидимостьРасписания();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьРасписания()
	Если РасписаниеЗадано Тогда
		Элементы.ГруппаРасписание.Видимость = Истина;
	Иначе
		Элементы.ГруппаРасписание.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//расписание
	ПреобразоватьВРасписание();
	УстановитьВидимостьРасписания();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзменения(Команда)
	ДниНедели = Новый Массив;
	Если День_Пн Тогда
		ДниНедели.Добавить(1);
	КонецЕсли;	
	Если День_Вт Тогда
		ДниНедели.Добавить(2);
	КонецЕсли;	
	Если День_Ср Тогда
		ДниНедели.Добавить(3);
	КонецЕсли;	
	Если День_Чт Тогда
		ДниНедели.Добавить(4);
	КонецЕсли;	
	Если День_Пт Тогда
		ДниНедели.Добавить(5);
	КонецЕсли;	
	Если День_Сб Тогда
		ДниНедели.Добавить(6);
	КонецЕсли;	
	Если День_Вс Тогда
		ДниНедели.Добавить(7);
	КонецЕсли;	
	
	ПараметрыЗакрытия = Новый Структура;
	
	ПараметрыЗакрытия.Вставить("Начало", Начало);
	ПараметрыЗакрытия.Вставить("Окончание", Окончание);
	ПараметрыЗакрытия.Вставить("ДатаКонца", ДатаКонца);
	ПараметрыЗакрытия.Вставить("КоличествоПовторов", КоличествоПовторов);
	ПараметрыЗакрытия.Вставить("ПериодНедель", ПериодНедель);
	ПараметрыЗакрытия.Вставить("ПериодПовтораДней", ПериодПовтораДней);
	ПараметрыЗакрытия.Вставить("ДниНедели", ДниНедели);
	ПараметрыЗакрытия.Вставить("РасписаниеЗадано", РасписаниеЗадано);
	ПараметрыЗакрытия.Вставить("ПрименитьИзменениеК", ПрименитьИзменениеК);
	ПараметрыЗакрытия.Вставить("Изменено", Модифицированность);
	
	Закрыть(ПараметрыЗакрытия);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти