
#Область ПрограммныйИнтерфейс

// Определить настройки задачи
// 
// Параметры:
//  Задача - ЗадачаСсылка.ЗадачаОтветственному
//  
// Возвращаемое значение:
//  Структура
// 
Функция НастройкиЗадачи(Задача) Экспорт
	
	НастройкиЗадачи = Новый Структура;
	НастройкиЗадачи.Вставить("ИмяОткрываемойФормы", Задача.ИмяОткрываемойФормы);
	НастройкиЗадачи.Вставить("ИмяВызываемогоМетода", Задача.ИмяВызываемогоМетода);
	ПараметрыОткрытияФормы = Новый Структура;
	Для Каждого Параметр Из Задача.ПараметрыОткрытияФормы Цикл		
		ПараметрыОткрытияФормы.Вставить(Параметр.ИмяПараметра, Параметр.Значение);
	КонецЦикла;	
	НастройкиЗадачи.Вставить("ПараметрыОткрытияФормы", ПараметрыОткрытияФормы);
	
	ПараметрыЗадачи = Новый Структура;
	Для Каждого Параметр Из Задача.ПараметрыЗадачи Цикл
		ПараметрыЗадачи.Вставить(Параметр.ИмяПараметра, Параметр.Значение);	
	КонецЦикла;
	НастройкиЗадачи.Вставить("ПараметрыЗадачи", ПараметрыЗадачи);
	
	Возврат	НастройкиЗадачи;
	
КонецФункции

#КонецОбласти
