
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Перечисления.ВариантыSMTPАутентификации.НеЗадано);
	ДанныеВыбора.Добавить(Перечисления.ВариантыSMTPАутентификации.ЗадаетсяПараметрами);
	ДанныеВыбора.Добавить(Перечисления.ВариантыSMTPАутентификации.АналогичноPOP3);	
	ДанныеВыбора.Добавить(Перечисления.ВариантыSMTPАутентификации.POP3ПередSMTP);	
		
КонецПроцедуры
