
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запись.ИнформационнаяБаза = Параметры.ИнформационнаяБаза;
	Запись.Период = Параметры.Период;
	Запись.Пользователь = СловарьСервер.ТекущийПользователь();
	ОбновитьПояснение();
	ЗаполнитьРекомендации();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Изменение.Справочник.КонтрольныеПроцедуры");
КонецПроцедуры

&НаСервере
Процедура ОбновитьПояснение()
	Элементы.ПояснениеНаФорме.Заголовок = "
	|Дайте оценку работы системы по пятибальной системе. 
	|Если необходимо оставьте комментарий.
	|Если возникают вопросы обратитесь к содержимому вкладки Рекомендации.";
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРекомендации()
	
	ИмяМакета = "ОценкаПользователейДатьОценку";
	Справка = Общий.ТекстHTMLМакета(ИмяМакета);
	
КонецПроцедуры


