
&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
    
    СтандартнаяОбработка = Ложь;
    
    Значение = Новый Структура;
    Значение.Вставить("Ссылка", Элемент.ТекущиеДанные.Ссылка);
    Значение.Вставить("ПлощадкаЭксплуатации", Элемент.ТекущиеДанные.ПлощадкаЭксплуатации);
        
    ЭтотОбъект.Закрыть(Значение);
    
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если ЭтотОбъект.Параметры.Свойство("ПлощадкаЭксплуатации") Тогда
        
        НовЭлемент = ЭтотОбъект.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
        НовЭлемент.Использование = Истина;
        НовЭлемент.ЛевоеЗначение =  Новый ПолеКомпоновкиДанных("ПлощадкаЭксплуатации");
        НовЭлемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
        НовЭлемент.ПравоеЗначение = ЭтотОбъект.Параметры.ПлощадкаЭксплуатации;

    КонецЕсли;
    
    ЭтотОбъект.Список.Параметры.УстановитьЗначениеПараметра("Кластер1С", Справочники.ВидыОбъектовКонтроля.КластерСерверов1С);
    ЭтотОбъект.Список.Параметры.УстановитьЗначениеПараметра("Корзина", Справочники.ПлощадкиЭксплуатации.Корзина());
    
КонецПроцедуры
