
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ТекстПредупреждения.Заголовок = Параметры.ТекстПредупреждения;
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьВыполнение(Команда)
	ЭтотОбъект.Закрыть(Новый Структура(
		"БольшеНеПоказывать, ПродолжитьВыполнение",
		БольшеНеПоказывать,
		Истина
	));
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыполнение(Команда)
	ЭтотОбъект.Закрыть(Новый Структура(
		"БольшеНеПоказывать, ПродолжитьВыполнение",
		БольшеНеПоказывать,
		Ложь
	));
КонецПроцедуры
