////////////////////////////////////////////////////////////////////////////////
// Неизменяемые параметры настроек объектов контроля и контрольных процедур
//  
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Возвращает Соответствие, в котором ключи - 
// существующие в системе виды объектов контроля, а
// значения - названия регистров сведения, в которых хранятся 
// настройки
Функция ВидОбъектаКонтроляВНазваниеРегистраНастроек() Экспорт
	НазванияРегСвед = Новый Соответствие();
	НазванияРегСвед.Вставить(Справочники.ВидыОбъектовКонтроля.ИнформационнаяБаза, "ПараметрыИнформационныхБаз");
	НазванияРегСвед.Вставить(Справочники.ВидыОбъектовКонтроля.РабочийСервер, "ПараметрыРабочихСерверов");
	НазванияРегСвед.Вставить(Справочники.ВидыОбъектовКонтроля.ЦентрКонтроляКачества, "ПараметрыЦКК");
    НазванияРегСвед.Вставить(Справочники.ВидыОбъектовКонтроля.КластерСерверов1С, "ПараметрыКластеров");
	
    Возврат НазванияРегСвед;			
КонецФункции
