
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	СисИнфо = Новый СистемнаяИнформация;
	ВерсияПриложения = СисИнфо.ВерсияПриложения;
	ПостфиксСхемы = ?(Лев(ВерсияПриложения, 3) = "8.2", "82", "");
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Сформировать", Ложь);
	ПараметрыОткрытия.Вставить("СхемаКомпоновкиДанных", "СхемаКомпоновкиДанныхПоПользователям" + ПостфиксСхемы);
	
	ОткрытьФорму("Отчет.ОценкаПроизводительностиСКД.Форма.ФормаОтчетаПоПользователям",ПараметрыОткрытия,,Новый УникальныйИдентификатор());
КонецПроцедуры
