#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Создать и вернуть ссылку на соединение, параметры которого указаны в текущем объекте.
//
// Параметры:
//  Настройки  - СправочникСсылка.НастройкиЗащищенногоСоединения - готовые настройки.
//               СправочникСсылка.НастройкиЗащищенногоСоединения.ПустаяСсылка - обычное соедиение.
//               Неопределено - обычное соедиение.
//
// Возвращаемое значение:
//  ЗащищенноеСоединениеOpenSSL - соединение на основе OpenSSL.
//  ЗащищенноеСоединениеNSS - соединение на основе NSS.
//  Неопределено - не защищенное соединение.
//
Функция СоздатьЗащищенноеСоединение(Настройки = Неопределено) Экспорт
	Если ЗначениеЗаполнено(Настройки) Тогда
		НастройкиОбъект = Настройки.ПолучитьОбъект();
		Если НастройкиОбъект <> Неопределено Тогда
			Возврат НастройкиОбъект.СоздатьЗащищенноеСоединение();
		КонецЕсли;
	КонецЕсли;
	Возврат Новый ЗащищенноеСоединениеOpenSSL();
	
КонецФункции

#КонецЕсли