
#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    
    Если Элемент.ТекущийЭлемент.Имя = "Активно" Тогда
        ИзменитьАктивность(ВыбраннаяСтрока);
        СтандартнаяОбработка = Ложь;
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Настройки(Команда)
    ОткрытьФорму("ОбщаяФорма.ФормаКонстантОповещения");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИзменитьАктивность(ОповещениеСсылка)
    
    ОповещениеОбъект = ОповещениеСсылка.ПолучитьОбъект();
    ОповещениеОбъект.Активно = НЕ ОповещениеОбъект.Активно;
    ОповещениеОбъект.Записать();
    Элементы.Список.Обновить();
    
КонецПроцедуры

#КонецОбласти