
#Область ПрограммныйИнтерфейс

// Процедура - Открыть диаграмму общую
//
// Параметры:
//  ПараметрыОткрытия - Структура - структура с ключами:
//                                      ФормаВыбораДанных - Строка - Обязательный. Форма для выбора данных серий.
//                                      ФункцияПолученияДанных - Строка - Обязательный. Экспортная функция получения данных.
//                                      Ссылки - Массив - Элементы для формирования серий, передаются в ФункцияПолученияДанных.
//                                      ДатаНачала - Дата - Начальная дата формирования данных.
//                                      ДатаОкончания - Дата - Конечная дата формирования данных.
//                                      ФорматИмениТочки - Строка - Формат подписей точек в диаграмме.
//                                      ФорматЗначенийВПодписях - Строка - Формат значений в подписях.
//                                      ШкалаСерийФорматПодписей - Строка - Формат подписей в шкале серий.
//
Процедура ОткрытьДиаграммуОбщую(ПараметрыОткрытия) Экспорт
    
    Уникальность = Неопределено;
    Если ПараметрыОткрытия.Свойство("Уникальность") Тогда
        Уникальность = ПараметрыОткрытия.Уникальность;
    КонецЕсли;
    
    ОткрытьФорму("Обработка.ДиаграммаОбщая.Форма.ДиаграммаОбщая", ПараметрыОткрытия,,Уникальность);
    
КонецПроцедуры

#КонецОбласти