#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция СписокПоказателей() Экспорт
	
	СписокПоказателей = Новый Массив;
	
	//Добавлять показатели в алфавитном порядке
	ДобавитьПоказатель(СписокПоказателей, "Активных вызовов сервера", "ТекущееЧислоВызововСервера");
	ДобавитьПоказатель(СписокПоказателей, "Использование оперативной памяти процессами кластера (в мегабайтах)", "ИспользованиеОперативнойПамятиПроцессамиКластера");
	ДобавитьПоказатель(СписокПоказателей, "Оценка пользователей", "ОценкаПользователей");
	ДобавитьПоказатель(СписокПоказателей, "Оценка производительности", "ПоказателиAPDEX");
	ДобавитьПоказатель(СписокПоказателей, "Процент доступности информационных баз", "ПроцентДоступностиСервисаВсеБазы");
	ДобавитьПоказатель(СписокПоказателей, "Процент доступности сервисов", "ПроцентДоступностиСервисаВсеРесурсы");
	ДобавитьПоказатель(СписокПоказателей, "Скорость выполнения ключевых операций (в секундах)", "ПоказателиСкоростиВыполненияТипичныхОпераций");
	ДобавитьПоказатель(СписокПоказателей, "Сформировано отчетов", "СформированоОтчетов");
	ДобавитьПоказатель(СписокПоказателей, "Счетчики", "ПоказателиСчетчиков");
	ДобавитьПоказатель(СписокПоказателей, "Число excp по технологическому журналу", "ЧислоИсключенийПоТехнологическомуЖурналу");
	ДобавитьПоказатель(СписокПоказателей, "Число аварийных завершений процессов", "ЧислоПаденийРабочихПроцессов");
	ДобавитьПоказатель(СписокПоказателей, "Число новых и измененных объектов", "ЧислоНовыхОбъектов");
	ДобавитьПоказатель(СписокПоказателей, "Число новых проблем", "ЧислоНерешенныхПроблем");
	ДобавитьПоказатель(СписокПоказателей, "Число решенных проблем", "СкоростьРазбораПроблем");
	ДобавитьПоказатель(СписокПоказателей, "Число сеансов", "ЧислоСеансовПользователей");
		
	//ДобавитьПоказатель(СписокПоказателей, "Шаблон", "ПоказателиШаблон");
	
	Возврат СписокПоказателей;	
КонецФункции

//Добавляет в список для выбора показатель
//ВНИМАНИЕ!!! 	Новый справочник лучше создавать путем копирования
//				объекта метаданных "Справочники.ПоказателиШаблон"
//
//ОСОБОЕ ВНИМАНИЕ!!!!!
//После создания нового справочника путем копирования ОБЯЗАТЕЛЬНО НУЖНО!!!
//у составного реквизита "Показатель" справочника "ПоказателиМониторинга" добавить тип нового справочника
//у составного реквизита "Показатель" справочника "ПоказателиИнцидентов" добавить тип нового справочника
Процедура ДобавитьПоказатель(СписокПоказателей, ИмяПоказателя, ИмяСправочника, КромеПоказателей = Неопределено)
	
	Если КромеПоказателей <> Неопределено И КромеПоказателей.Найти(ИмяСправочника) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокПоказателей.Добавить(Новый Структура(
		"Название, НазваниеСправочника",
		ИмяПоказателя,
		ИмяСправочника
	));
	
КонецПроцедуры

#КонецЕсли