#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция СоздатьДокументРегистратор(ИнформационнаяБаза, ДатаПакета) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ПакетЦентраМониторинга.Ссылка
	|ИЗ
	|	Документ.ПакетЦентраМониторинга КАК ПакетЦентраМониторинга
	|ГДЕ
	|	ПакетЦентраМониторинга.ИнформационнаяБаза = &ИнформационнаяБаза
	|	И ПакетЦентраМониторинга.Дата = &ДатаПакета
	|";
	Запрос.УстановитьПараметр("ИнформационнаяБаза", ИнформационнаяБаза);
	Запрос.УстановитьПараметр("ДатаПакета", ДатаПакета);
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		РегистраторПакета = Документы.ПакетЦентраМониторинга.СоздатьДокумент();
		РегистраторПакета.ИнформационнаяБаза = ИнформационнаяБаза;
		РегистраторПакета.Дата = ДатаПакета;
		РегистраторПакета.Записать();
		
		РезультатСоздания = Новый Структура("Регистратор, ЭтоНовый", РегистраторПакета.Ссылка, Истина);
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		РезультатСоздания = Новый Структура("Регистратор, ЭтоНовый", Выборка.Ссылка, Ложь);
	КонецЕсли;
	
	Возврат РезультатСоздания;
КонецФункции

#КонецЕсли