#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция УдалитьУстаревшиеДанные(КрайняяДатаЗаписи) Экспорт
	
	ЕстьУдаление = Ложь;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Период КАК Период
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 1000
	|		ДатаЗаписи КАК Период
	|	ИЗ
	|		РегистрСведений.ЖурналКонтроля
	|	ГДЕ
	|		ДатаЗаписи <= &КрайняяДатаЗаписи
	|	УПОРЯДОЧИТЬ ПО
	|		ДатаЗаписи ВОЗР
	|	) КАК Выборка
	|";
	
	Запрос.УстановитьПараметр("КрайняяДатаЗаписи", КрайняяДатаЗаписи);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		ЕстьУдаление = Истина;
		
		НаборЗаписей = РегистрыСведений.ЖурналКонтроля.СоздатьНаборЗаписей();
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			НаборЗаписей.Отбор.ДатаЗаписи.Установить(Выборка.Период);
			НаборЗаписей.Записать(Истина);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ЕстьУдаление;
	
КонецФункции

#КонецЕсли