
#Область ПрограммныйИнтерфейс

// Выполняет действия перед обработкой данных результат обработки.
//
// Параметры:
//  Данные - Соответствие - данные, полученные от агента.
//  ПараметрыАгента - Структура.
//		Ссылка - СправочникСсылка.АгентыКИП.
//		ПериодОтправкиДанных - Число - Периодичность отправки данных агентом.
//	Ответ - HTTPСервисОтвет - http-ответ, возвращаемые агенту после обработки данных.
//
Процедура ПередОбработкойДанных(Данные, ПараметрыАгента, Ответ) Экспорт
	// ЦА: установим определим Имя ОС
	ИмяОС = Данные["ServicesData"]["COMPUTER_INFO"]["systemInfoBrief"]["osType"];
	Если ИмяОС <> Неопределено Тогда
		ПараметрыАгента.Вставить("ИмяОС", ИмяОС);
	Иначе
		ПараметрыАгента.Вставить("ИмяОС", "");
	КонецЕсли;	
КонецПроцедуры

// Выполняет действия при обработке данных результат обработки.
// Параметры:
//  Данные - Соответствие - данные, полученные от агента.
//  ПараметрыАгента - Структура.
//		Ссылка - СправочникСсылка.АгентыКИП.
//		ПериодОтправкиДанных - Число - Периодичность отправки данных агентом.
//
Процедура ПриОбработкеДанныхАгентаКИП(Данные, ПараметрыАгента) Экспорт
	// ЦА: Команды администрирования
	// обработка данных от Агента
	РаботаСоСценариямиАвтоматизацииВзаимодействиеСАгентом.КомандаАвтоматизации(Данные, ПараметрыАгента);
	
	// Формировнаие новой команды
	РаботаСоСценариямиАвтоматизацииВзаимодействиеСАгентом.КомандаАвтоматизацииОтвет(ПараметрыАгента);
КонецПроцедуры

// Выполняет действия перед отправкой http-ответа агенту.
// Параметры:
//  Данные - Соответствие - данные, полученные от агента.
//  ПараметрыАгента - Структура.
//		Ссылка - СправочникСсылка.АгентыКИП.
//		ПериодОтправкиДанных - Число - Периодичность отправки данных агентом.
//	ТелоОтвета - Соответствие - используется для формирования http-ответа.
//
Процедура ПередОтправкойОтветаАгенту(ТелоОтвета, Данные, ПараметрыАгента) Экспорт
	РаботаСоСценариямиАвтоматизацииВзаимодействиеСАгентом.ИнициализироватьСкрытыеДанные(ТелоОтвета);	
КонецПроцедуры

#Область СправочникАгентыКИПМодульМенеджера

// Изменяет текст запроса, выполняемого при поиске элемента справочника Агенты КИП.
//
Функция ТекстЗапросаНайтиАгентаПоУникальномуИдентификатору() Экспорт
	
КонецФункции

// Создает связанные объекты с элементом справочника Агенты КИП.
//
// Параметры:
//	ДанныеАгента - структра - содержит данные элемента справочника.
// 
Процедура СоздатьСвязанныеОбъектыАгентаКИП(ДанныеАгента) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область HTTPСервисыAgentETP 

// Выполняет действия при проверке версии агента.
//
// Параметры:
//	ВерсияПакета - Строка - версия пакета в формате "x.x.x.x".
//	ВерсияКорректна - Булево - по умолчанию Истина. Если проверка версии прошла не успешно - необходимо заменить на Ложь.
//
Процедура ПриПроверкеВерсииАгента(ВерсияПакета, ВерсияКорректна) Экспорт 
	
КонецПроцедуры

// Выполняет действия при возникновении ошибки в процессе знакомства с агентом.
//
// Параметры:
//	ТипОшибки - Перечисление.ТипыОшибокАгента - тип возникшей ошибки.
//	Данные - Соответствие - данные, полученные от агента.
//
Процедура ОбработатьОшибкуПриЗнакомстве(ТипОшибки, Данные) Экспорт
	
КонецПроцедуры

// Выполняет действия при знакомстве с агентом.
//
// Параметры:
//  Данные - Соответствие - данные, полученные от агента.
//	Ответ - HTTPСервисОтвет - http-ответ, возвращаемые агенту при знакомстве.
//
Процедура ОбработатьЗапросНаЗнакомство(Данные, Ответ) Экспорт
	
КонецПроцедуры

// Дополняет коллекцию форм, в которой хранится соотвествие вида формы и 
Процедура ДополнитьСоответствиеФорм(СоответствиеФорм) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

