
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого ТекЗначение Из ЭтотОбъект.Параметры.СтрокиДляЗамены Цикл
		НовСтрока = ЭтотОбъект.ДанныеЗамены.Добавить();
		НовСтрока.КлючЗамены = ТекЗначение.Ключ;
		НовСтрока.СтрокаДляЗамены = ТекЗначение.Значение;
		
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.НайтиЧто) Тогда
			ЭтотОбъект.НайтиЧто = ТекЗначение.Значение;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заменить(Команда)
	
	ПараметрыВыполнения = Новый Соответствие;
    Для Каждого ТекСтрока Из ЭтотОбъект.ДанныеЗамены Цикл
        
        Если ЭтотОбъект.РегулярныеВыражения Тогда
            ПараметрыВыполнения.Вставить(ТекСтрока.КлючЗамены, РегулярныеВыраженияКлиентСервер.ЗаменитьПоШаблонуПоиска(ТекСтрока.СтрокаДляЗамены, ЭтотОбъект.НайтиЧто, ЭтотОбъект.ЗаменитьНа));
        Иначе
            ПараметрыВыполнения.Вставить(ТекСтрока.КлючЗамены, СтрЗаменить(ТекСтрока.СтрокаДляЗамены, ЭтотОбъект.НайтиЧто, ЭтотОбъект.ЗаменитьНа));
        КонецЕсли;
		
	КонецЦикла;
	ЭтотОбъект.Закрыть(ПараметрыВыполнения);
	
КонецПроцедуры

#КонецОбласти
