
#Область ПрограммныйИнтерфейс

#Область СправочникАгентыКИПМодульМенеджера

// Изменяет текст запроса, выполняемого при поиске элемента справочника Агенты КИП.
//
Функция ТекстЗапросаНайтиАгентаПоУникальномуИдентификатору() Экспорт
    Возврат АгентКИПвЦККПереопределяемый.ТекстЗапросаНайтиАгентаПоУникальномуИдентификатору();	
КонецФункции

// Создает связанные объекты с элементом справочника Агенты КИП.
//
// Параметры:
//	ДанныеАгента - структра - содержит данные элемента справочника.
// 
Процедура СоздатьСвязанныеОбъектыАгентаКИП(ДанныеАгента) Экспорт
    АгентКИПвЦККПереопределяемый.СоздатьСвязанныеОбъектыАгентаКИП(ДанныеАгента);	
КонецПроцедуры

#КонецОбласти

#Область HTTPСервисыAgentETP 

// Выполняет действия при проверке версии агента.
//
// Параметры:
//	ВерсияПакета - Строка - версия пакета в формате "x.x.x.x".
//	ВерсияКорректна - Булево - по умолчанию Истина. Если проверка версии прошла не успешно - необходимо заменить на Ложь.
//
Процедура ПриПроверкеВерсииАгента(ВерсияПакета, ВерсияКорректна) Экспорт 
	
КонецПроцедуры

// Выполняет действия при возникновении ошибки в процессе знакомства с агентом.
//
// Параметры:
//	Данные - Соответствие - данные, полученные от агента.
//
Процедура ПередЗнакомством(Данные, Ответ) Экспорт
    АгентКИПвЦККПереопределяемый.ПередЗнакомством(Данные, Ответ);    
КонецПроцедуры

// Выполняет действия при возникновении ошибки в процессе знакомства с агентом.
//
// Параметры:
//	ТипОшибки - Перечисление.ТипыОшибокАгента - тип возникшей ошибки.
//	Данные - Соответствие - данные, полученные от агента.
//
Процедура ОбработатьОшибкуПриЗнакомстве(ТипОшибки, Данные) Экспорт
    АгентКИПвЦККПереопределяемый.ОбработатьОшибкуПриЗнакомстве(ТипОшибки, Данные);    	
КонецПроцедуры

// Выполняет действия при знакомстве с агентом.
//
// Параметры:
//  Данные - Соответствие - данные, полученные от агента.
//	Ответ - HTTPСервисОтвет - http-ответ, возвращаемые агенту при знакомстве.
//
Процедура ОбработатьЗапросНаЗнакомство(Данные, Ответ) Экспорт
    АгентКИПвЦККПереопределяемый.ОбработатьЗапросНаЗнакомство(Данные, Ответ);    	
КонецПроцедуры

// Выполняет действия перед обработкой данных результат обработки.
//
// Параметры:
//  Данные - Соответствие - данные, полученные от агента.
//  ПараметрыАгента - Структура.
//		Ссылка - СправочникСсылка.АгентыКИП.
//		ПериодОтправкиДанных - Число - Периодичность отправки данных агентом.
//	Ответ - HTTPСервисОтвет - http-ответ, возвращаемые агенту после обработки данных.
//
Процедура ПередОбработкойДанных(Данные, ПараметрыАгента, Ответ) Экспорт
    АгентКИПвЦККПереопределяемый.ПередОбработкойДанных(Данные, ПараметрыАгента, Ответ);
    АгентКИПСерверПереопределяемыйЦА.ПередОбработкойДанных(Данные, ПараметрыАгента, Ответ);	
КонецПроцедуры

// Выполняет действия при обработке данных результат обработки.
// Параметры:
//  Данные - Соответствие - данные, полученные от агента.
//  ПараметрыАгента - Структура.
//		Ссылка - СправочникСсылка.АгентыКИП.
//		ПериодОтправкиДанных - Число - Периодичность отправки данных агентом.
//
Процедура ПриОбработкеДанныхАгентаКИП(Данные, ПараметрыАгента) Экспорт
    АгентКИПвЦККПереопределяемый.ПриОбработкеДанных(Данные, ПараметрыАгента);
    АгентКИПСерверПереопределяемыйЦА.ПриОбработкеДанныхАгентаКИП(Данные, ПараметрыАгента);	
КонецПроцедуры

// Выполняет действия перед отправкой http-ответа агенту.
// Параметры:
//  Данные - Соответствие - данные, полученные от агента.
//  ПараметрыАгента - Структура.
//		Ссылка - СправочникСсылка.АгентыКИП.
//		ПериодОтправкиДанных - Число - Периодичность отправки данных агентом.
//	ТелоОтвета - Соответствие - используется для формирования http-ответа.
//
Процедура ПередОтправкойОтветаАгенту(ТелоОтвета, Данные, ПараметрыАгента) Экспорт
    АгентКИПвЦККПереопределяемый.ПередОтправкойОтветаАгенту(ТелоОтвета, Данные, ПараметрыАгента);		
	АгентКИПСерверПереопределяемыйЦА.ПередОтправкойОтветаАгенту(ТелоОтвета, Данные, ПараметрыАгента);
КонецПроцедуры

// Дополняет коллекцию форм, в которой хранится соотвествие вида формы и 
Процедура ДополнитьСоответствиеФорм(СоответствиеФорм) Экспорт
    АгентКИПвЦККПереопределяемый.ДополнитьСоответствиеФорм(СоответствиеФорм);	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

