
#Область ОбработчикиСобытиФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    ЭтотОбъект.ПериодГруппировкиОповещений = ЭтотОбъект.Параметры.ПериодГруппировкиОповещений;
    ЭтотОбъект.ПериодПовторногоОповещения = ЭтотОбъект.Параметры.ПериодПовторногоОповещения;
    ЭтотОбъект.ИнтервалОЗакрытии = ЭтотОбъект.Параметры.ИнтервалОЗакрытии;
        
    Для Каждого ТекОповещение Из ЭтотОбъект.Параметры.Оповещения Цикл
        
        НовСтрока = ЭтотОбъект.Оповещения.Добавить();
        НовСтрока.Оповещение = ТекОповещение;
        
    КонецЦикла;
    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Записать(Команда)
    
    ЗаписатьНаСервере();
    ЭтотОбъект.Закрыть("Обновить");
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьНаСервере()
    
    Для Каждого ТекОповещение Из ЭтотОбъект.Оповещения Цикл
        
        СпрОбъект = ТекОповещение.Оповещение.ПолучитьОбъект();
        СпрОбъект.ПериодГруппировкиОповещений = ЭтотОбъект.ПериодГруппировкиОповещений;
        СпрОбъект.ПериодПовторногоОповещения = ЭтотОбъект.ПериодПовторногоОповещения;
        СпрОбъект.ИнтервалОЗакрытии = ЭтотОбъект.ИнтервалОЗакрытии;
        СпрОбъект.ДополнительныеСвойства.Вставить("НеПроверять", Истина);
        СпрОбъект.Записать();
        
    КонецЦикла;
        
КонецПроцедуры

#КонецОбласти
