#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ПередЗаписью(Отказ)
	Буфер = ЭтотОбъект.Наименование;
	Если Лев(Буфер, 1) = "\" Тогда
		Буфер = Прав(Буфер, СтрДлина(Буфер) - 1);
	КонецЕсли;
	
	ГруппаСчетчикаБуфер = "";
	Для Индекс = 1 По СтрДлина(Буфер) Цикл
		Симв = Сред(Буфер, Индекс, 1);
		Если Симв = "\" ИЛИ Симв = "(" Тогда
			Прервать;
		КонецЕсли;
		
		ГруппаСчетчикаБуфер = ГруппаСчетчикаБуфер + Симв;
	КонецЦикла;
	
	ЭтотОбъект.ГруппаСчетчика = ГруппаСчетчикаБуфер;
КонецПроцедуры

Процедура ЗагрузитьШаблон(ШаблонЭлемента) Экспорт
	Если ШаблонЭлемента <> Неопределено Тогда
		ЭтотОбъект.Наименование = ШаблонЭлемента["Наименование"];
		ЭтотОбъект.Описание = ШаблонЭлемента["Описание"];
        ЭтотОбъект.Применимо = ШаблонЭлемента["Применимо"];
		
		ЭтотОбъект.НациональноеПредставление.Очистить();
		Для Каждого ТекЯзык Из ШаблонЭлемента["Языки"] Цикл
			НовСтрока = ЭтотОбъект.НациональноеПредставление.Добавить();
			НовСтрока.Язык = ТекЯзык.Ключ;
			НовСтрока.НаименованиеНациональное = ТекЯзык.Значение;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецЕсли