#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
    
    ВерсияМассив = СтрРазделить(Наименование, ".", Ложь);
    
    КоличествоЭлементов = ВерсияМассив.Количество();
    Если КоличествоЭлементов < 4 Тогда
        Для ТекИндекс = 1 По 4 - КоличествоЭлементов Цикл
            ВерсияМассив.Добавить("0");
        КонецЦикла;
    КонецЕсли;
	
	Попытка
		ВерсияЧисло = Число(Прав("0000" + ВерсияМассив[0], 4) + Прав("0000" + ВерсияМассив[1], 4) + Прав("0000" + ВерсияМассив[2], 4) + Прав("0000" + ВерсияМассив[3], 4));
	Исключение
		ВызватьИсключение("Ошибка преобразования наименования " + Наименование + " в число!");
    КонецПопытки;
    
КонецПроцедуры

#КонецЕсли