#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьОтборПоДоступным();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоДоступным()
	Если Не РаботаСоСценариямиАвтоматизацииПраваДоступа.ПроверитьНаличиеПолногоДоступаКФункционалуАвтоматизации() Тогда
		
		Ограничения = РаботаСоСценариямиАвтоматизацииПовторноеИспользование.ПолучитьСписокОграниченийДляТекущегоПользователя();
		
		Если Ограничения.Количество() > 0 Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	СценарииАвтоматизации.Ссылка КАК Ссылка
			                      |ИЗ
			                      |	Справочник.СценарииАвтоматизации КАК СценарииАвтоматизации
			                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СценарииАвтоматизации.КонтурыАдминистрирования КАК СценарииАвтоматизацииКонтурыАвтоматизации
			                      |		ПО СценарииАвтоматизации.Ссылка = СценарииАвтоматизацииКонтурыАвтоматизации.Ссылка
			                      |ГДЕ
			                      |	СценарииАвтоматизацииКонтурыАвтоматизации.Ссылка ЕСТЬ NULL
			                      |
			                      |ОБЪЕДИНИТЬ ВСЕ
			                      |
			                      |ВЫБРАТЬ
			                      |	СценарииАвтоматизации.Ссылка
			                      |ИЗ
			                      |	Справочник.СценарииАвтоматизации КАК СценарииАвтоматизации
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СценарииАвтоматизации.КонтурыАдминистрирования КАК СценарииАвтоматизацииКонтурыАвтоматизации
			                      |		ПО СценарииАвтоматизации.Ссылка = СценарииАвтоматизацииКонтурыАвтоматизации.Ссылка
			                      |			И (СценарииАвтоматизацииКонтурыАвтоматизации.Контур В (&ДоступныеКонтуры))");
			Запрос.УстановитьПараметр("ДоступныеКонтуры", Ограничения);
			
			ОтборСписка = Запрос.Выполнить().Выгрузить();
			
			РаботаСоСценариямиАвтоматизацииПраваДоступа.УстановитьОтборПоДоступнымЭлементамНаСписокФормы(Список, ОтборСписка.ВыгрузитьКолонку("Ссылка"));
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура СписокПриИзмененииНаСервере()
	УстановитьОтборПоДоступным();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	СписокПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти