
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
        ЭтотОбъект.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Нет;
        ЭтотОбъект.Элементы.Наименование.Видимость = Ложь;
        ЭтотОбъект.Элементы.ГруппаКоманднаяПанельНастройкиПоУмолчанию.Видимость = Истина;
        ЭтотОбъект.Элементы.ЗаписатьИЗАкрытьМоя.КнопкаПоУмолчанию = Истина;
    КонецЕсли;
    
    ЗаполнитьНастройкиПоУмолчанию();
    
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    
    ЗаписатьНастройкиПоУмолчанию();
    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрытьМоя(Команда)
    
    ЗаписатьНастройкиПоУмолчанию();
    ЭтотОбъект.Закрыть();
    
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьМоя(Команда)
    ЗаписатьНастройкиПоУмолчанию();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПараметрыПоУмолчаниюПриАктивизацииСтроки(Элемент)
    ПодключитьОбработчикОжидания("ПараметрыЗаписиПриАктивизацииСтрокиПодключаемый", 0.1, Истина);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНастройкиПоУмолчанию()
    
    Настройки = Справочники.Оборудование.ПрочитатьНастройкиПоУмолчанию();
    
    ДобавитьПараметр("СобиратьДанныеПроизводительности", "Вкл. сбор счетчиков", Настройки.СобиратьДанныеПроизводительности);
    ДобавитьПараметр("ЯзыкОС", "Язык ОС", Настройки.ЯзыкОС);
    ДобавитьПараметр("ПериодЗаписи", "Период записи тек. значений, сек.", Настройки.ПериодЗаписи);
    ДобавитьПараметр("ПроверятьДоступность", "Проверять доступность", Настройки.ПроверятьДоступность);
    ДобавитьПараметр("Таймаут", "Таймаут, сек.", Настройки.Таймаут);
    ДобавитьПараметр("ПериодКонтроля", "Период контроля, сек.", Настройки.ПериодКонтроля);
    ДобавитьПараметр("МинимальныйПроцентДоступности", "Минимальная доступность, %", Настройки.МинимальныйПроцентДоступности);
    ДобавитьПараметр("ДопустимоНетДанных", "Допустимо нет данных, сек.", Настройки.ДопустимоНетДанных);
    ДобавитьПараметр("ИспользоватьВнешнегоАгента", "Использовать внешнего агента", Настройки.ИспользоватьВнешнегоАгента);
    ДобавитьПараметр("РегистрироватьДампы", "Регистрировать дампы", Настройки.РегистрироватьДампы);
        
КонецПроцедуры

&НаСервере
Процедура ДобавитьПараметр(Параметр, ПараметрПредставление, ПараметрЗначение)
    
    НовСтрока = ЭтотОбъект.ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = Параметр;
    НовСтрока.ПараметрПредставление = ПараметрПредставление;
    НовСтрока.ПараметрЗначение = ПараметрЗначение;
        
КонецПроцедуры

Процедура ЗаписатьНастройкиПоУмолчанию()
    
    Настройки = Новый Структура;
    
    Для Каждого ТекПараметр Из ПараметрыПоУмолчанию Цикл
        
        Настройки.Вставить(ТекПараметр.Параметр, ТекПараметр.ПараметрЗначение);
            
    КонецЦикла;
    
    Справочники.Оборудование.ЗаписатьНастройкиПоУмолчанию(Настройки);
        
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЗаписиПриАктивизацииСтрокиПодключаемый() Экспорт
    
    ТекДанные = Элементы.ПараметрыПоУмолчанию.ТекущиеДанные;
    Если ТекДанные.Параметр = "СобиратьДанныеПроизводительности" Тогда
        
        Элементы.ПараметрыПоУмолчаниюПараметрЗначение.РежимВыбораИзСписка = Истина;
        Элементы.ПараметрыПоУмолчаниюПараметрЗначение.СписокВыбора.Добавить("Отключить", "Отключить");
        Элементы.ПараметрыПоУмолчаниюПараметрЗначение.СписокВыбора.Добавить("PDH", "PDH");
        Элементы.ПараметрыПоУмолчаниюПараметрЗначение.СписокВыбора.Добавить("Агент КИП", "Агент КИП");
        
    Иначе
        
        Элементы.ПараметрыПоУмолчаниюПараметрЗначение.РежимВыбораИзСписка = Ложь;
        Элементы.ПараметрыПоУмолчаниюПараметрЗначение.СписокВыбора.Очистить();
        
    КонецЕсли;
        
КонецПроцедуры

#КонецОбласти
