
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    ЭтотОбъект.Список.Параметры.УстановитьЗначениеПараметра("ИнформационныеБазы", ЭтотОбъект.Параметры.ИнформационныеБазы);
    
    Если ЭтотОбъект.Параметры.Свойство("РежимВыделения") Тогда
        Элементы.Список.РежимВыделения = РежимВыделенияТаблицы[ЭтотОбъект.Параметры.РежимВыделения];
    КонецЕсли;
        
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
    ВыборОбщая();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    ВыборОбщая();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыборОбщая()
    
     КлючевыеОперации = Новый Массив;
    
    Для Каждого ТекСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
        ДанныеСтроки = Элементы.Список.ДанныеСтроки(ТекСтрока);
        КлючевыеОперации.Добавить(ДанныеСтроки.Имя);
    КонецЦикла;
    
    ЭтотОбъект.Закрыть(КлючевыеОперации);
    
КонецПроцедуры

#КонецОбласти