
#Область ПрограммныйИнтерфейс

Функция НайтиОборудование(ИмяКомпьютера, ПлощадкаЭксплуатации) Экспорт
    
    Запрос = Новый Запрос;
    
    Запрос.Текст = "
    |ВЫБРАТЬ
    |   СпрОборудование.Ссылка
    |ИЗ
    |   РегистрСведений.ОборудованиеСетевыеАдаптеры КАК СетевыеАдаптеры
    |ВНУТРЕННЕЕ СОЕДИНЕНИЕ
    |   Справочник.Оборудование КАК СпрОборудование
    |ПО
    |   СпрОборудование.Ссылка = СетевыеАдаптеры.Оборудование
    |   И СпрОборудование.ПлощадкаЭксплуатации = &ПлощадкаЭксплуатации
    |ГДЕ
    |   СетевыеАдаптеры.ИмяКомпьютера = &ИмяКомпьютера
    |";
    
    Запрос.УстановитьПараметр("ПлощадкаЭксплуатации", ПлощадкаЭксплуатации);
    Запрос.УстановитьПараметр("ИмяКомпьютера", ИмяКомпьютера);
    
    Результат = Запрос.Выполнить();
    
    Если НЕ Результат.Пустой() Тогда
        Возврат Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
    Иначе
        Возврат НайтиОборудованиеПоПолномуИмениКомпьютера(ИмяКомпьютера, ПлощадкаЭксплуатации);
    КонецЕсли;
        
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НайтиОборудованиеПоПолномуИмениКомпьютера(ИмяКомпьютераПолное, ПлощадкаЭксплуатации)
    
    Запрос = Новый Запрос;
    
    Запрос.Текст = "
    |ВЫБРАТЬ
    |   СпрОборудование.Ссылка
    |ИЗ
    |   РегистрСведений.ОборудованиеСетевыеАдаптеры КАК СетевыеАдаптеры
    |ВНУТРЕННЕЕ СОЕДИНЕНИЕ
    |   Справочник.Оборудование КАК СпрОборудование
    |ПО
    |   СпрОборудование.Ссылка = СетевыеАдаптеры.Оборудование
    |   И СпрОборудование.ПлощадкаЭксплуатации = &ПлощадкаЭксплуатации
    |ГДЕ
    |   СетевыеАдаптеры.ИмяКомпьютераПолное = &ИмяКомпьютераПолное
    |";
    
    Запрос.УстановитьПараметр("ПлощадкаЭксплуатации", ПлощадкаЭксплуатации);
    Запрос.УстановитьПараметр("ИмяКомпьютераПолное", ИмяКомпьютераПолное);
    
    Результат = Запрос.Выполнить();
    
    Если НЕ Результат.Пустой() Тогда
        Возврат Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
    Иначе
        Возврат НайтиОборудованиеПоIpАдресу(ИмяКомпьютераПолное, ПлощадкаЭксплуатации)
    КонецЕсли;
        
КонецФункции

Функция НайтиОборудованиеПоIpАдресу(IPAddress, ПлощадкаЭксплуатации)
    
    Запрос = Новый Запрос;
    
    Запрос.Текст = "
    |ВЫБРАТЬ
    |   СпрОборудование.Ссылка
    |ИЗ
    |   РегистрСведений.ОборудованиеСетевыеАдаптеры КАК СетевыеАдаптеры
    |ВНУТРЕННЕЕ СОЕДИНЕНИЕ
    |   Справочник.Оборудование КАК СпрОборудование
    |ПО
    |   СпрОборудование.Ссылка = СетевыеАдаптеры.Оборудование
    |   И СпрОборудование.ПлощадкаЭксплуатации = &ПлощадкаЭксплуатации
    |ГДЕ
    |   СетевыеАдаптеры.IPAddress = &IPAddress
    |";
    
    Запрос.УстановитьПараметр("ПлощадкаЭксплуатации", ПлощадкаЭксплуатации);
    Запрос.УстановитьПараметр("IPAddress", IPAddress);
    
    Результат = Запрос.Выполнить();
    
    Возврат Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
            
КонецФункции

#КонецОбласти