////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы.
//
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиОбновления
Процедура ПереносЗначенийИзСсылокНаОбъектыМетаданныхСценариев() Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	СценарииАвтоматизацииШаблоныЗаполненияПараметров.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.СценарииАвтоматизации.ШаблоныЗаполненияПараметров КАК СценарииАвтоматизацииШаблоныЗаполненияПараметров
	                      |ГДЕ
	                      |	СценарииАвтоматизацииШаблоныЗаполненияПараметров.СпособЗаполнения = ЗНАЧЕНИЕ(Перечисление.СпособыЗаполненияПараметровКоманды.РучнойВвод)
	                      |		И СценарииАвтоматизацииШаблоныЗаполненияПараметров.ОтносительнаяСсылкаНаМетаданные <> ""Строка""");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Для каждого Строка Из СпрОбъект.ШаблоныЗаполненияПараметров Цикл
			Если Строка.СпособЗаполнения = Перечисления.СпособыЗаполненияПараметровКоманды.РучнойВвод И Строка.ОтносительнаяСсылкаНаМетаданные <> "Строка" Тогда
				Строка.Объект = Строка.ОтносительнаяСсылкаНаМетаданные;
				Строка.ОтносительнаяСсылкаНаМетаданные = "Строка";
			КонецЕсли;
		КонецЦикла;
		СпрОбъект.Записать();
	КонецЦикла;	
КонецПроцедуры	
#КонецОбласти
