
Процедура ВыполнитьАнализ(КонтрольнаяПроцедура) Экспорт
	НетПроблем = Истина;
	
	// Найти всех пользователей роли и сгенерировать им задачу
	
	// Вначале получаем роль, на которую возложена обязанность,
	// заполнять формы с оценкой пользователей
	Роль = РегистрыСведений.СхемаАдресацииЗадач.Получить(Новый Структура(
		"ТипИсполнителя, КонтрольнаяПроцедура",
		Справочники.ТипыИсполнителейОценкаПользователей.ОтветственныйЗаЗаполнениеФормыОценкиРаботыСистемы,
		КонтрольнаяПроцедура
	))["РольПользователя"];
	
	// Далее перебираем пользователей роли и вешаем на них задачу
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СвязьПользовательРоль.Пользователь
	|ИЗ
	|	РегистрСведений.СвязьПользовательРоль КАК СвязьПользовательРоль
	|ГДЕ
	|	СвязьПользовательРоль.Роль = &Роль";
	Запрос.УстановитьПараметр("Роль", Роль);
	
	ВыборкаПользователей = Запрос.Выполнить().Выбрать();
	
	ИмяСтраницыСправки = "ОценкаПользователейДатьОценку";
	Сообщение = НСтр("ru = 'Дайте свою оценку работе системы.'");
	
	Пока ВыборкаПользователей.Следующий() Цикл
		Пользователь = ВыборкаПользователей.Пользователь;
	КонецЦикла;
	
КонецПроцедуры

