
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Отчет.Период = ЭтотОбъект.Параметры.Период;
    Отчет.ПрофильКлючевыхОпераций = ЭтотОбъект.Параметры.ПрофильКлючевыхОпераций;
    Отчет.ТолькоКлючевыеОперацииПрофиля = ЭтотОбъект.Параметры.ТолькоКлючевыеОперацииПрофиля;
    Отчет.ИспользоватьБазовоеЗначение = ЭтотОбъект.Параметры.ИспользоватьБазовоеЗначение;
    Отчет.МинимальноеКоличествоБазДляРаспределения = ЭтотОбъект.Параметры.МинимальноеКоличествоБазДляРаспределения;
    Отчет.ТипАнализа = ЭтотОбъект.Параметры.ТипАнализа;
	Отчет.ТолькоРелизныеПлатформы = ЭтотОбъект.Параметры.ТолькоРелизныеПлатформы;
	Отчет.ТолькоРелизныеВерсииКонфигураций = ЭтотОбъект.Параметры.ТолькоРелизныеВерсииКонфигураций;
	СтатусыИнформационнойБазы.ЗагрузитьЗначения(ЭтотОбъект.Параметры.СтатусыИнформационнойБазы);
    
    Если Отчет.ТипАнализа = "APDEX" Тогда
        ЭтотОбъект.Элементы.ИспользоватьБазовоеЗначение.Доступность = Истина;
    Иначе
        ЭтотОбъект.Элементы.ИспользоватьБазовоеЗначение.Доступность = Ложь;
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТипАнализаПриИзменении(Элемент)
    
    Если Отчет.ТипАнализа = "APDEX" Тогда
        ЭтотОбъект.Элементы.ИспользоватьБазовоеЗначение.Доступность = Истина;
    Иначе
        ЭтотОбъект.Элементы.ИспользоватьБазовоеЗначение.Доступность = Ложь;
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
    
    ПараметрыЗакрытия = Новый Структура;
    ПараметрыЗакрытия.Вставить("Период", Отчет.Период);
    ПараметрыЗакрытия.Вставить("ПрофильКлючевыхОпераций", Отчет.ПрофильКлючевыхОпераций);
    ПараметрыЗакрытия.Вставить("ТолькоКлючевыеОперацииПрофиля", Отчет.ТолькоКлючевыеОперацииПрофиля);
    ПараметрыЗакрытия.Вставить("ИспользоватьБазовоеЗначение", Отчет.ИспользоватьБазовоеЗначение);
    ПараметрыЗакрытия.Вставить("МинимальноеКоличествоБазДляРаспределения", Отчет.МинимальноеКоличествоБазДляРаспределения);
    ПараметрыЗакрытия.Вставить("ТипАнализа", Отчет.ТипАнализа);
	ПараметрыЗакрытия.Вставить("ТолькоРелизныеПлатформы", Отчет.ТолькоРелизныеПлатформы);
	ПараметрыЗакрытия.Вставить("ТолькоРелизныеВерсииКонфигураций", Отчет.ТолькоРелизныеВерсииКонфигураций);
	ПараметрыЗакрытия.Вставить("СтатусыИнформационнойБазы", СтатусыИнформационнойБазы.ВыгрузитьЗначения());
    
    ЭтотОбъект.Закрыть(ПараметрыЗакрытия);
    
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
    ЭтотОбъект.Закрыть();
КонецПроцедуры

#КонецОбласти