
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Список.Параметры.УстановитьЗначениеПараметра("ТипЛицензииПрограммная", "Программная");
    Список.Параметры.УстановитьЗначениеПараметра("ТипЛицензииАппаратная", "Аппаратная");
    Список.Параметры.УстановитьЗначениеПараметра("ТипЛицензииНеИзвестно", "Не известно");
    
    Список.Параметры.УстановитьЗначениеПараметра("Активная", "Активная");
    Список.Параметры.УстановитьЗначениеПараметра("НеАктивная", "Не активная");
    Список.Параметры.УстановитьЗначениеПараметра("НеИзвестноАктивная", "Не известно");
    
    Список.Параметры.УстановитьЗначениеПараметра("Клиентская", "Клиентская");
    Список.Параметры.УстановитьЗначениеПараметра("Серверная", "Серверная");
    Список.Параметры.УстановитьЗначениеПараметра("НеИзвестноВидЛицензии", "Не известно");

КонецПроцедуры

#КонецОбласти
