
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
    
#Область ПрограммныйИнтерфейс

// Процедура - Записать данные
//
// Параметры:
//  Тип    - Строка - Тип данных (ПРП - параметры рабочих процессов, ПСНС - параметры сеансов, ПЛИЦ - параметры лицензий).
//  Данные - Строка - Строка данных в формате JSON.
//
Процедура ЗаписатьДанные(Тип, Данные, УникальныйИдентификаторКластера = Неопределено) Экспорт
    
    ТекДата = ТекущаяУниверсальнаяДата();
    ТекДатаМинута = НачалоМинуты(ТекДата);
    
    НаборЗаписей = СоздатьНаборЗаписей();
    
    НовСтрока = НаборЗаписей.Добавить();
    НовСтрока.Тип = Тип;
    НовСтрока.ДатаЗаписиМинутаUTC = ТекДатаМинута;
    НовСтрока.УникальныйИдентификаторЗаписи = Новый УникальныйИдентификатор;
    НовСтрока.Данные = Данные;
    НовСтрока.УникальныйИдентификаторКластера = УникальныйИдентификаторКластера;
    
    НаборЗаписей.Записать(Ложь);
    
КонецПроцедуры

#КонецОбласти

#КонецЕсли
