
Процедура НастроитьПодписьПериодаВЧасах(Подпись, ЗначениеВЧасах) Экспорт
		
	Если ЗначениеВЧасах >= 5 И ЗначениеВЧасах <= 20 Тогда
		Результат = " часов";
	Иначе
		Остаток = ЗначениеВЧасах % 10;
		Если Остаток = 1 Тогда
			Результат = " час";
		ИначеЕсли Остаток >= 2 И Остаток <= 4 Тогда
			Результат = " часа";
		Иначе
			Результат = " часов";
		КонецЕсли;
	КонецЕсли;
		
	Если ТипЗнч(Подпись) = Тип("Строка") Тогда
		Подпись = Результат;
	Иначе
		Подпись.Заголовок = Результат;
	КонецЕсли;
	
КонецПроцедуры
