
#Область ПрограммныйИнтерфейс

Функция НачатьЗамер(ИмяКлючевойОперации, АвтоЗавершение = Истина) Экспорт
    
    ТекДата = ТекущаяУниверсальнаяДатаВМиллисекундах();
    
    Ключ = Новый УникальныйИдентификатор;
    ВнутренниеЗамерыПроизводительностиБуферКлиента.Вставить(Ключ, ВнутренниеЗамерыКлиентСервер.НовыйЗамер(ТекДата, ИмяКлючевойОперации, АвтоЗавершение));
    
    Если АвтоЗавершение Тогда
        ПодключитьОбработчикОжидания("ЗавершитьЗамерАвто", 0.1, Истина);
    КонецЕсли;
    
    Возврат Ключ;
    
КонецФункции

Процедура ЗавершитьЗамер(Ключ, ТекДата = Неопределено) Экспорт
    
    Если ТекДата = Неопределено Тогда
        ТекДата = ТекущаяУниверсальнаяДатаВМиллисекундах();
    КонецЕсли;
        
    Замер = ВнутренниеЗамерыПроизводительностиБуферКлиента[Ключ];
    Если Замер <> Неопределено Тогда
        Замер["ДатаОкончания"] = ТекДата;
    КонецЕсли;
        
КонецПроцедуры

#КонецОбласти
