
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЭтотОбъект.ВариантВвода = 0 Тогда
		ЭтотОбъект.Элементы.ДатаНачала.Доступность = Истина;
		ЭтотОбъект.Элементы.ДатаОкончания.Доступность = Ложь;
	Иначе
		ЭтотОбъект.Элементы.ДатаНачала.Доступность = Ложь;
		ЭтотОбъект.Элементы.ДатаОкончания.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВариантВводаПриИзменении(Элемент)
	Если ЭтотОбъект.ВариантВвода = 0 Тогда
		ЭтотОбъект.Элементы.ДатаНачала.Доступность = Истина;
		ЭтотОбъект.Элементы.ДатаОкончания.Доступность = Ложь;
	Иначе
		ЭтотОбъект.Элементы.ДатаНачала.Доступность = Ложь;
		ЭтотОбъект.Элементы.ДатаОкончания.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	ЭтотОбъект.ДатаОкончания = ЭтотОбъект.ДатаНачала + ЭтотОбъект.ДлительностьПериода - 1;
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	ЭтотОбъект.ДатаНачала = КонецДня(ЭтотОбъект.ДатаОкончания) - ЭтотОбъект.ДлительностьПериода + 1;
КонецПроцедуры

&НаКлиенте
Процедура КомандаДа(Команда)
	ПараметрыВыбора = Новый Структура("ДатаНачала, ДатаОкончания");
	ПараметрыВыбора.ДатаНачала = ЭтотОбъект.ДатаНачала;
	ПараметрыВыбора.ДатаОкончания = ЭтотОбъект.ДатаОкончания;
	ЭтотОбъект.ОповеститьОВыборе(ПараметрыВыбора);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
    ЭтотОбъект.Закрыть();
КонецПроцедуры
