#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ОбновлениеИБ") И ЭтотОбъект.ДополнительныеСвойства.ОбновлениеИБ Тогда
		Возврат;
	КонецЕсли;
		
	Для Каждого ТекСтрока из ЭтотОбъект Цикл
		КонтрольнаяПроцедура = ТекСтрока.КонтрольнаяПроцедура;
		Если ТипЗнч(КонтрольнаяПроцедура) = Тип("СправочникСсылка.КонтрольныеПроцедуры") Тогда
			ОбъектКонтроля = КонтрольнаяПроцедура.ОбъектКонтроля;
			Параметры = Новый Структура;
			Параметры.Вставить("СборДампов", Новый Массив);
			Параметры.СборДампов.Добавить("УровеньДетализацииДампов");
			Параметры.СборДампов.Добавить("КаталогВыгрузкиДампов");
            Если ТекСтрока.АвтоматическаяНастройка Тогда
                ТехнологическийЖурнал.ОбновитьФайлНастроекТехнологическогоЖурнала(ОбъектКонтроля, Новый Структура("КодыКонтрольныхПроцедур",Параметры));
            КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецЕсли