
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
        ЭтотОбъект.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Нет;
        ЭтотОбъект.Элементы.Наименование.Видимость = Ложь;
        ЭтотОбъект.Элементы.ГруппаКоманднаяПанельНастройкиПоУмолчанию.Видимость = Истина;
        ЭтотОбъект.Элементы.ЗаписатьИЗАкрытьМоя.КнопкаПоУмолчанию = Истина;
    КонецЕсли;
    
    ЗаполнитьНастройкиПоУмолчанию();
    
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    ЗаписатьНастройкиПоУмолчанию();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрытьМоя(Команда)
    
    ЗаписатьНастройкиПоУмолчанию();
    ЭтотОбъект.Закрыть();
    
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьМоя(Команда)
    ЗаписатьНастройкиПоУмолчанию();
КонецПроцедуры

&НаКлиенте
Процедура РасписаниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    
    Диалог = Новый ДиалогРасписанияРегламентногоЗадания(ЭтотОбъект.Расписание);
	Диалог.Показать(Новый ОписаниеОповещения("ОткрытьРасписаниеЗавершение", ЭтотОбъект));
    
    СтандартнаяОбработка = Ложь;
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНастройкиПоУмолчанию()
    
    Настройки = РегистрыСведений.НастройкиСборДампов.ПрочитатьНастройки(Справочники.ВидыКонтрольныхПроцедур.КонтрольУстойчивостиСистемы());
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "КаталогЭкспортаДампов";
    НовСтрока.ПараметрПредставление = "Каталог экспорта дампов";
    НовСтрока.ПараметрЗначение = Настройки.КаталогЭкспортаДампов;
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "ИспользоватьАгента";
    НовСтрока.ПараметрПредставление = "Использовать агента";
    НовСтрока.ПараметрЗначение = Настройки.ИспользоватьАгента;
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "КаталогВременныхФайлов";
    НовСтрока.ПараметрПредставление = "Каталог временных файлов";
    НовСтрока.ПараметрЗначение = Настройки.КаталогВременныхФайлов;
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "КаталогВыгрузкиДампов";
    НовСтрока.ПараметрПредставление = "Каталог выгрузки дампов локальный";
    НовСтрока.ПараметрЗначение = Настройки.КаталогВыгрузкиДампов;
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "КаталогВыгрузкиДамповСетевой";
    НовСтрока.ПараметрПредставление = "Каталог выгрузки дампов сетевой";
    НовСтрока.ПараметрЗначение = Настройки.КаталогВыгрузкиДамповСетевой;
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "АвтоматическаяНастройка";
    НовСтрока.ПараметрПредставление = "Автоматическая настройка технологического журнала";
    НовСтрока.ПараметрЗначение = Настройки.АвтоматическаяНастройка;
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "КаталогТЖЛокальный";
    НовСтрока.ПараметрПредставление = "Каталог данных ТЖ локальный";
    НовСтрока.ПараметрЗначение = Настройки.КаталогТЖЛокальный;
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "КаталогТЖСетевой";
    НовСтрока.ПараметрПредставление = "Каталог данных ТЖ сетевой";
    НовСтрока.ПараметрЗначение = Настройки.КаталогТЖСетевой;
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "УровеньДетализацииДампов";
    НовСтрока.ПараметрПредставление = "Уровень детализации дампов";
    НовСтрока.ПараметрЗначение = Настройки.УровеньДетализацииДампов;
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "ДлительностьХраненияФайловТЖ";
    НовСтрока.ПараметрПредставление = "Длительность хранения ТЖ, часов";
    НовСтрока.ПараметрЗначение = Настройки.ДлительностьХраненияФайловТЖ;
    
    ЭтотОбъект.Расписание = Настройки.Расписание;
    Если ЭтотОбъект.Расписание = Неопределено Тогда
        ЭтотОбъект.Расписание = Новый РасписаниеРегламентногоЗадания;
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиПоУмолчанию()
    
    Настройки = Новый Структура;
    
    Для Каждого ТекПараметр Из ПараметрыПоУмолчанию Цикл
        Настройки.Вставить(ТекПараметр.Параметр, ТекПараметр.ПараметрЗначение);
    КонецЦикла;
    
    Настройки.Вставить("Расписание", ЭтотОбъект.Расписание);
    
    РегистрыСведений.НастройкиСборДампов.ЗаписатьНастройки(Справочники.ВидыКонтрольныхПроцедур.КонтрольУстойчивостиСистемы(), Настройки);
        
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРасписаниеЗавершение(НовоеРасписание, Неопределен) Экспорт
    
    Если НовоеРасписание <> Неопределено Тогда
		ЭтотОбъект.Расписание = НовоеРасписание;
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти