#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПредопределенныеПроцедуры

Процедура ПередЗаписью(Отказ)
    
    Если ДополнительныеСвойства.Свойство("СформированитьНаименование") И ДополнительныеСвойства.СформированитьНаименование Тогда
        СформироватьНаименование();
    КонецЕсли;
        
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьНаименование()
    
    Наименование = Строка(ТипПодключения) + " (";
    
    Если ТипПодключения = ПредопределенноеЗначение("Перечисление.ТипПодключенияКластер1С.RAS") Тогда
        Для Каждого ТекСтрока Из RASПараметры Цикл
            Наименование = Наименование + ТекСтрока.СерверАдминистрирования + ", ";
        КонецЦикла;
    ИначеЕсли ТипПодключения = ПредопределенноеЗначение("Перечисление.ТипПодключенияКластер1С.АгентКИП") Тогда
        Для Каждого ТекСтрока Из АгентКИППараметры Цикл
            Наименование = Наименование + ТекСтрока.АгентКИП + ":" + Формат(ТекСтрока.ПортRAS, "ЧН=0; ЧГ=0") + ", ";
        КонецЦикла;
    КонецЕсли;
    
    Наименование = Лев(Наименование, СтрДлина(Наименование) - 2);
    Наименование = Наименование + ")";
    
КонецПроцедуры

#КонецОбласти

#КонецЕсли
