#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
    
#Область ПрограмнныйИнтерфейс

// Записать ответсвенного контроль потребления памяти
//
// Параметры:
//  КонтрольнаяПроцедура - СправочникСсылка.КонтрольныеПроцедуры - контрольная процедура для которой записывается ответсвенный.
//  РольПользователя     - СправочникСсылка.РолиПользователей    - роль пользователя для записи.
//
Процедура ЗаписатьОтветственного(КонтрольнаяПроцедура, РольПользователя) Экспорт
    
    Если КонтрольнаяПроцедура.Владелец = Справочники.ВидыКонтрольныхПроцедур.КонтрольПотребленияПамяти() Тогда
        ТипИсполнителя = Справочники.ТипыИсполнителейКонтрольПамяти.ОтветственныйЗаРазборПроблемПотребленияПамяти;
    ИначеЕсли КонтрольнаяПроцедура.Владелец = Справочники.ВидыКонтрольныхПроцедур.АнализВызововКластера1С() Тогда
        ТипИсполнителя = Справочники.ТипыИсполнителейАнализВызововКластера1С.ОтветственныйЗаАнализВызововКластера1С;
    ИначеЕсли КонтрольнаяПроцедура.Владелец = Справочники.ВидыКонтрольныхПроцедур.КонтрольУстойчивостиСистемы() Тогда
        ТипИсполнителя = Справочники.ТипыИсполнителейСборДампов.ОтветственныйЗаРассмотрениеДампа;
    ИначеЕсли КонтрольнаяПроцедура.Владелец = Справочники.ВидыКонтрольныхПроцедур.КонтрольПодключений() Тогда
        ТипИсполнителя = Справочники.ТипыИсполнителейКонтрольПодключений.ОтветственныйЗаВозможностьПодключения;
    ИначеЕсли КонтрольнаяПроцедура.Владелец = Справочники.ВидыКонтрольныхПроцедур.КонтрольПроизводительности() Тогда
        ТипИсполнителя = Справочники.ТипыИсполнителейКонтрольПроизводительности.ОтветственныйЗаРазборПроблемПроизводительности;
    КонецЕсли;
        
    МенеджерЗаписи = СоздатьМенеджерЗаписи();
    МенеджерЗаписи.ТипИсполнителя = ТипИсполнителя;
    МенеджерЗаписи.КонтрольнаяПроцедура = КонтрольнаяПроцедура;
    МенеджерЗаписи.РольПользователя = РольПользователя;
    
    МенеджерЗаписи.Записать(Истина);    
    
КонецПроцедуры

#КонецОбласти

#КонецЕсли