#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
    
#Область ПрограммныйИнтерфейс


// Устанавливает новое состояние контрольной процедуры.
//
// Параметры:
//  Ссылка    - СправочникСсылка.КонтрольныеПроцедуры     - контрольная процедура, для которой будет установлено состояние.
//  Состояние - Перечисление.СостояниеКонтрольныхПроцедур - новое состояние контрольной процедуры.
//
Процедура УстановитьСостояние(Ссылка, Состояние) Экспорт
    
    МенеджерЗаписи = СоздатьМенеджерЗаписи();
    МенеджерЗаписи.КонтрольнаяПроцедура = Ссылка;
    МенеджерЗаписи.Состояние = Состояние;
    МенеджерЗаписи.Записать(Истина);
    
КонецПроцедуры

#КонецОбласти
    
#КонецЕсли