#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ЗаполнитьПоШаблону(Очищать) Экспорт
    
    Если Очищать Тогда
        СчетчикиПроизводительности.Очистить();
        СчетчикиПроизводительностиLinux.Очистить();
    КонецЕсли;
	
	Счетчики = ПолучитьСчетчикиПоШаблонуНаСервере(Ссылка);
    
    Для Каждого ТекСчетчик Из Счетчики.Windows Цикл
        
        Если СчетчикиПроизводительности.Найти(ТекСчетчик, "СчетчикПроизводительности") = Неопределено Тогда
            НовСтрока = СчетчикиПроизводительности.Добавить();
            НовСтрока.СчетчикПроизводительности = ТекСчетчик;
        КонецЕсли;
        
    КонецЦикла;
    
    Для Каждого ТекСчетчик Из Счетчики.Linux Цикл
        
        Если СчетчикиПроизводительностиLinux.Найти(ТекСчетчик, "СчетчикПроизводительности") = Неопределено Тогда
            НовСтрока = СчетчикиПроизводительностиLinux.Добавить();
            НовСтрока.СчетчикПроизводительности = ТекСчетчик;
        КонецЕсли;
        
    КонецЦикла;
    
КонецПроцедуры

Функция ПолучитьСчетчикиПоШаблонуНаСервере(Ссылка)
    
    Счетчики = Новый Структура("Windows, Linux", Новый Массив, Новый Массив);
    
    Если Ссылка = Справочники.РолиОборудования.СерверWindows Тогда
        Счетчики.Windows = Справочники.РолиОборудования.ПолучитьСчетчикиПроизводительностиПредопределенного(Ссылка, Перечисления.СчетчикПроизводительностиПрименимо.Windows);
    ИначеЕсли Ссылка = Справочники.РолиОборудования.СерверLinux Тогда
        Счетчики.Linux = Справочники.РолиОборудования.ПолучитьСчетчикиПроизводительностиПредопределенного(Ссылка, Перечисления.СчетчикПроизводительностиПрименимо.Linux);
    ИначеЕсли Ссылка = Справочники.РолиОборудования.СерверMSSQL Тогда
        Счетчики.Windows = Справочники.РолиОборудования.ПолучитьСчетчикиПроизводительностиПредопределенного(Ссылка, Перечисления.СчетчикПроизводительностиПрименимо.Windows);
    КонецЕсли;
            
	Возврат Счетчики;
    
КонецФункции

#КонецЕсли