#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПроверитьНаличиеФайловДампов(Знач ПараметрыЗадания, Знач АдресХранилища) Экспорт
	ФайлыДампов = ПараметрыЗадания.ПроверяемыеДампы;
	Для ТекФайл = 0 По ФайлыДампов.Количество() - 1 Цикл
		Файлы = НайтиФайлы(ФайлыДампов[ТекФайл].ИмяФайла);	
		ФайлыДампов[ТекФайл].НаличиеФайла = Файлы.Количество() <> 0;
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ФайлыДампов, АдресХранилища);
КонецПроцедуры

Процедура ПриИзмененииЗаписиДампа(ВариантДампа, СостояниеОбработки) Экспорт
	
	Если НЕ ВариантДампа.СохранятьВсеДампы Тогда
		СостоянияОшибки = Новый Соответствие;
		СостоянияОшибки.Вставить(Перечисления.СостоянияОбработкиДампа.ДампНеНайден, Истина);
		СостоянияОшибки.Вставить(Перечисления.СостоянияОбработкиДампа.ОшибкаАрхивирования, Истина);
		СостоянияОшибки.Вставить(Перечисления.СостоянияОбработкиДампа.ОшибкаСозданияДампУдален, Истина);
		СостоянияОшибки.Вставить(Перечисления.СостоянияОбработкиДампа.ОшибкаЭкспорта, Истина);
		
		Если СостоянияОшибки[СостояниеОбработки] <> Неопределено Тогда
			ВариантДампаОбъект = ВариантДампа.ПолучитьОбъект();
			ВариантДампаОбъект.КоличествоДополнительноСохраняемыхДампов = ВариантДампаОбъект.КоличествоДополнительноСохраняемыхДампов + 1;
			ВариантДампаОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

#КонецЕсли