
Функция РассчитатьСреднийApdex(ДанныеДляРасчета) Экспорт
	
	// ДанныеДляРасчета:
	//   Колонка 1: APDEX
	//   Колонка 2: Количество замеров до T
	//   Колонка 3: Количество замеров от Т до 4T
	//   Колонка 4: Количество замеров свыше 4T
	//   Колонка 5: Общее количество замеров
	
	APDEX = 0;
	
	ИтогN_T = ДанныеДляРасчета.Итог("Колонка2");
	ИтогN_T_4T = ДанныеДляРасчета.Итог("Колонка3");
	ИтогN_4T = ДанныеДляРасчета.Итог("Колонка4");
	ИтогОбщееКоличествоЗамеров = ДанныеДляРасчета.Итог("Колонка5");
	
	Если ИтогОбщееКоличествоЗамеров > 0 Тогда
		APDEX = (ИтогN_T + ИтогN_T_4T/2) / ИтогОбщееКоличествоЗамеров;
	КонецЕсли;
	
	Возврат APDEX;
	
КонецФункции

Функция РассчитатьApdexDelta(ДанныеДляРасчета) Экспорт
	
	// ДанныеДляРасчета:
	//   Колонка 1: Количество замеров до T
	//   Колонка 2: Количество замеров от Т до 4T
	//   Колонка 3: Количество замеров свыше 4T
	//   Колонка 4: Общее количество замеров
	
	ApdexDelta = 0;
	
	Если ДанныеДляРасчета = Null Тогда
		Возврат Null;
	КонецЕсли;
	
	Если ДанныеДляРасчета.ТекущийЭлемент <> Неопределено Тогда
		N_T_4T_Тек = ДанныеДляРасчета.ТекущийЭлемент.Колонка2;
		N_4T_Тек = ДанныеДляРасчета.ТекущийЭлемент.Колонка3;
		
		ИтогОбщееКоличествоЗамеров = ДанныеДляРасчета.Данные.Итог("Колонка4");
		
		ApdexDelta = (N_4T_Тек + N_T_4T_Тек/2) / ИтогОбщееКоличествоЗамеров;
	КонецЕсли;
	
	Возврат ApdexDelta;
	
КонецФункции

Функция РассчитатьКвадратныйКорень(Значение) Экспорт
	
	Если Значение <> Null Тогда
		Результат = Sqrt(Значение);
	Иначе
		Результат = 0;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции