&НаКлиенте
Процедура Отправить(Команда)
	ЗначениеДляПередачи = Объект.ЗначениеДляПередачи;
	ЗначениеДляПередачи = СтрЗаменить(ЗначениеДляПередачи, Символы.ПС, "");
	Результат = ОтправитьНаСервере
					(
						Объект.WSСсылка,
						Объект.ДатаСобытия,
						ЗначениеДляПередачи,
						Объект.Пользователь,
						Объект.Пароль
					);
	Сообщить(Строка(ТекущаяДата()) + ": " + Результат);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтправитьНаСервере(WSСсылка, ДатаСобытия, ЗначениеДляПередачи, Пользователь, Пароль)
	Определение = Новый WSОпределения(WSСсылка, Пользователь, Пароль,,180);
	Прокси = Новый WSПрокси(Определение, "http://1c.ru", "InputStatisticsDate", "InputStatisticsDateSoap",,180);
	Прокси.Пользователь = Пользователь;
	Прокси.Пароль = Пароль;
	
	Результат = Прокси.InputData(ДатаСобытия, ЗначениеДляПередачи);
		
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ПустаяСтрока(Объект.WSСсылка) Тогда
		Объект.WSСсылка = "http://localhost/BaseName/ws/InputStatisticsDate.1cws?wsdl";
	КонецЕсли;
	
	Если ПустаяСтрока(Объект.ЗначениеДляПередачи) Тогда
		Объект.ЗначениеДляПередачи = "ИмяСчетчикаРодитель.ИмяСчетчикаПотомок.1979,01.10";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаСобытия) Тогда
		Объект.ДатаСобытия = ТекущаяДата();
	КонецЕсли;
КонецПроцедуры
