
&НаСервере
Процедура ЗарегистрироватьНаСервере()
	ЗаписьОбъект = РеквизитФормыВЗначение("Запись");
	РегистрыСведений.РезультатАвтоматическогоАнализаПроизводительности.ЗарегистрироватьОшибкиВоВнешнейСистеме();
КонецПроцедуры

&НаКлиенте
Процедура Зарегистрировать(Команда)
	ЗарегистрироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВерсияИсправленияНаСервере()
	ЗаписьОбъект = РеквизитФормыВЗначение("Запись");
	РегистрыСведений.РезультатАвтоматическогоАнализаПроизводительности.АктуализироватьСтатусыОшибок();
КонецПроцедуры

&НаКлиенте
Процедура ВерсияИсправления(Команда)
	ВерсияИсправленияНаСервере();
КонецПроцедуры

&НаСервере
Функция ДанныеАнализаНаСервере()
	ЗаписьОбъект = РеквизитФормыВЗначение("Запись");
	ТабличныйДокумент = ЗаписьОбъект.ДанныеАнализа.Получить();
	Возврат ТабличныйДокумент;
КонецФункции

&НаКлиенте
Процедура ДанныеАнализа(Команда)
	ТД = ДанныеАнализаНаСервере();
	ТД.Показать();
КонецПроцедуры
