
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыПроверки = Константы.НастройкиПроверкиРелизности.Получить().Получить();
	Если ПараметрыПроверки = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ПараметрыПроверки.Свойство("АдресСервиса") Тогда
		АдресСервиса = ПараметрыПроверки.АдресСервиса;
	КонецЕсли;
	Если ПараметрыПроверки.Свойство("Логин") Тогда
		Логин = ПараметрыПроверки.Логин;
	КонецЕсли;
	Если ПараметрыПроверки.Свойство("Пароль") Тогда
		Пароль = ПараметрыПроверки.Пароль;
	КонецЕсли;
	Если ПараметрыПроверки.Свойство("ПаузаМеждуВерсиями") Тогда
		ПаузаМеждуВерсиями = ПараметрыПроверки.ПаузаМеждуВерсиями;
	КонецЕсли;
	Если ПараметрыПроверки.Свойство("ПаузаМеждуКонфигурациями") Тогда
		ПаузаМеждуКонфигурациями = ПараметрыПроверки.ПаузаМеждуКонфигурациями;
	КонецЕсли;                      	
	Если ПараметрыПроверки.Свойство("ПроверятьРелизностьВерсий") Тогда
		ПроверятьРелизностьВерсий = ПараметрыПроверки.ПроверятьРелизностьВерсий;
	КонецЕсли;
	
	Если ПараметрыПроверки.Свойство("СоответствиеСсылок") Тогда
		Для Каждого КлючИЗначение Из ПараметрыПроверки.СоответствиеСсылок Цикл
			НоваяСтрока = СписокКонфигураций.Добавить();
			НоваяСтрока.Конфигурация = КлючИЗначение.Ключ;
			НоваяСтрока.ИмяНаReleases = КлючИЗначение.Значение;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИЗакрытьНаСервере()
	
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("АдресСервиса", АдресСервиса);
	СтруктураНастроек.Вставить("Логин", Логин);
	СтруктураНастроек.Вставить("Пароль", Пароль);
	СтруктураНастроек.Вставить("ПаузаМеждуВерсиями", ПаузаМеждуВерсиями);
	СтруктураНастроек.Вставить("ПаузаМеждуКонфигурациями", ПаузаМеждуКонфигурациями);
	СтруктураНастроек.Вставить("ПроверятьРелизностьВерсий", ПроверятьРелизностьВерсий);
	МассивКонфигураций = Новый Массив;	
	СоответствиеСсылок = Новый Соответствие;
	Для Каждого Строка Из СписокКонфигураций Цикл
		Если Не ЗначениеЗаполнено(Строка.Конфигурация) ИЛИ НЕ ЗначениеЗаполнено(Строка.ИмяНаReleases) Тогда
			Продолжить;
		КонецЕсли;
		МассивКонфигураций.Добавить(Строка.Конфигурация);
		СоответствиеСсылок.Вставить(Строка.Конфигурация, Строка.ИмяНаReleases);
	КонецЦикла;
	
	СтруктураНастроек.Вставить("МассивКонфигураций", МассивКонфигураций);
	СтруктураНастроек.Вставить("СоответствиеСсылок", СоответствиеСсылок);
	
	Константы.НастройкиПроверкиРелизности.Установить(Новый ХранилищеЗначения(СтруктураНастроек));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьИЗакрытьНаСервере();
	Закрыть();
КонецПроцедуры
