
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если ЭтотОбъект.Параметры.Свойство("КонтрольПоступленияДанных") Тогда
        ЭтотОбъект.КонтрольПоступленияДанных = ЭтотОбъект.Параметры.КонтрольПоступленияДанных;
    КонецЕсли;
    
    Если ЭтотОбъект.Параметры.Свойство("ДопустимоеВремяОтсутствияДанных") Тогда
        ЭтотОбъект.ДопустимоеВремяОтсутствияДанных = ЭтотОбъект.Параметры.ДопустимоеВремяОтсутствияДанных;
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Установить(Команда)
    
    РезультатЗакрытия = Новый Структура("КонтрольПоступленияДанных, ДопустимоеВремяОтсутствияДанных");
    РезультатЗакрытия.КонтрольПоступленияДанных = ЭтотОбъект.КонтрольПоступленияДанных;
    РезультатЗакрытия.ДопустимоеВремяОтсутствияДанных = ЭтотОбъект.ДопустимоеВремяОтсутствияДанных;
    
    ЭтотОбъект.Закрыть(РезультатЗакрытия);
    
КонецПроцедуры

#КонецОбласти
