
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("Ключ", ПолучитьКлючЗаписиНаСервере());
	ОткрытьФорму("РегистрСведений.НастройкиКонтрольПамяти.Форма.ФормаЗначенияПоУмолчанию", ПараметрыФормы);
КонецПроцедуры

&НаСервере
Функция ПолучитьКлючЗаписиНаСервере()
	
	КонтрольПотребленияПамяти = Справочники.ВидыКонтрольныхПроцедур.НайтиПоНаименованию("Контроль потребления памяти");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтрольнаяПроцедура
	|ИЗ
	|	РегистрСведений.НастройкиКонтрольПамяти
	|ГДЕ
	|	КонтрольнаяПроцедура = &КонтрольПотребленияПамяти
	|";
	Запрос.УстановитьПараметр("КонтрольПотребленияПамяти", КонтрольПотребленияПамяти);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		МенеджерЗаписи = РегистрыСведений.НастройкиКонтрольПамяти.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.КонтрольнаяПроцедура = КонтрольПотребленияПамяти;
		МенеджерЗаписи.Записать(Истина);
	КонецЕсли;
	
	ЗначенияКлюча = Новый Структура;
	ЗначенияКлюча.Вставить("КонтрольнаяПроцедура", КонтрольПотребленияПамяти); 
	
	Возврат РегистрыСведений.НастройкиКонтрольПамяти.СоздатьКлючЗаписи(ЗначенияКлюча);
	
КонецФункции
