
#Область ПрограммныйИнтерфейс

// Определяет ссылку на элемент справочника Пользователи, 
// соответствующего текущему пользователю информационной базы
//
// Возвращаемое значение:
//  СправочникСсылка.Пользователи
//
Функция ТекущийПользователь() Экспорт
	
	ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка
	|ИЗ
	|	Справочник.Пользователи
	|ГДЕ
	|	УникальныйИдентификатор = &УникальныйИдентификатор
	|";
	
	Запрос.УстановитьПараметр("УникальныйИдентификатор", ПользовательИБ.УникальныйИдентификатор);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ПользовательСсылка = Общий.СоздатьПользователяНаОснованииТекущегоПользователяИБ();
	Иначе
		ВыборкаПользователей = РезультатЗапроса.Выбрать();		
		ВыборкаПользователей.Следующий();
		ПользовательСсылка = ВыборкаПользователей.Ссылка;
	КонецЕсли;
	
	Возврат ПользовательСсылка;
	
КонецФункции	

#КонецОбласти


