#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ДобавитьДанные(Данные) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.СтатистикаБуфер.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ДатаЗаписи = НачалоМинуты(ТекущаяДата());
	МенеджерЗаписи.ГУИД = Новый УникальныйИдентификатор();
    МенеджерЗаписи.Данные = Данные;
	
	МенеджерЗаписи.Записать(Ложь);
	
КонецПроцедуры

Функция СтрокаВКодировкуСервиса(Текст) Экспорт
    
    Результат = СтрЗаменить(Текст, "/", "↔");
	Результат = СтрЗаменить(Текст, ".", "♂");
    
    Возврат Результат;
    
КонецФункции

#КонецЕсли