
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("СписокШаблонов") Тогда
		СписокШаблонов = Параметры.СписокШаблонов;
	КонецЕсли;
	
	Параметры.Свойство("ТекущееЗначение", РезультирующееВыражение);
	
	Для Каждого ЗначениеПеречисления Из Перечисления.ФункцииРаботыСШаблонами Цикл
		ФункцииРаботыСШаблонами.Добавить(ЗначениеПеречисления);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ФункцииРаботыСШаблонамиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	РезультирующееВыражение = РезультирующееВыражение + Элемент.ТекущиеДанные.Значение;
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("РезультирующееВыражение", РезультирующееВыражение);
	Закрыть(ПараметрыЗакрытия);
КонецПроцедуры
