#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
    
#Область ПрограммныйИнтерфейс

// Получает ссылку на элемент "Анализ вызовов кластера 1С"
// 
// Возвращаемое значение:
//  СправочникСсылка.ВидыКонтрольныхПроцедур - ссылка на элемент с наименованием "Анализ вызовов кластера 1С". 
//
Функция АнализВызововКластера1С() Экспорт
    Возврат ПолучитьСсылкуПоНаименованию("Анализ вызовов кластера 1С"); 
КонецФункции

// Получает ссылку на элемент "Контроль устойчивости системы"
// 
// Возвращаемое значение:
//  СправочникСсылка.ВидыКонтрольныхПроцедур - ссылка на элемент с наименованием "Контроль устойчивости системы". 
//
Функция КонтрольУстойчивостиСистемы() Экспорт
    Возврат ПолучитьСсылкуПоНаименованию("Контроль устойчивости системы"); 
КонецФункции

// Получает ссылку на элемент "Мониторинг системных ошибок"
// 
// Возвращаемое значение:
//  СправочникСсылка.ВидыКонтрольныхПроцедур - ссылка на элемент с наименованием "Мониторинг системных ошибок". 
//
Функция МониторингСистемныхОшибок() Экспорт
    Возврат ПолучитьСсылкуПоНаименованию("Мониторинг системных ошибок"); 
КонецФункции

// Получает ссылку на элемент "Контроль потребления памяти"
// 
// Возвращаемое значение:
//  СправочникСсылка.ВидыКонтрольныхПроцедур - ссылка на элемент с наименованием "Контроль потребления памяти". 
//
Функция КонтрольПотребленияПамяти() Экспорт
    Возврат ПолучитьСсылкуПоНаименованию("Контроль потребления памяти"); 
КонецФункции

// Получает ссылку на элемент "Контроль выполнения регламентных заданий"
// 
// Возвращаемое значение:
//  СправочникСсылка.ВидыКонтрольныхПроцедур - ссылка на элемент с наименованием "Контроль выполнения регламентных заданий". 
//
Функция КонтрольВыполненияРегламентныхЗаданий() Экспорт
    Возврат ПолучитьСсылкуПоНаименованию("Контроль выполнения регламентных заданий"); 
КонецФункции

// Получает ссылку на элемент "Контроль нагрузочных тестов"
// 
// Возвращаемое значение:
//  СправочникСсылка.ВидыКонтрольныхПроцедур - ссылка на элемент с наименованием "Контроль нагрузочных тестов". 
//
Функция КонтрольНагрузочныхТестов() Экспорт
    Возврат ПолучитьСсылкуПоНаименованию("Контроль нагрузочных тестов"); 
КонецФункции

// Получает ссылку на элемент "Контроль подключений"
// 
// Возвращаемое значение:
//  СправочникСсылка.ВидыКонтрольныхПроцедур - ссылка на элемент с наименованием "Контроль подключений". 
//
Функция КонтрольПодключений() Экспорт
    Возврат ПолучитьСсылкуПоНаименованию("Контроль подключений"); 
КонецФункции

// Получает ссылку на элемент "Контроль производительности"
// 
// Возвращаемое значение:
//  СправочникСсылка.ВидыКонтрольныхПроцедур - ссылка на элемент с наименованием "Контроль производительности". 
//
Функция КонтрольПроизводительности() Экспорт
    Возврат ПолучитьСсылкуПоНаименованию("Контроль производительности"); 
КонецФункции

// Получает ссылку на элемент "Оценка пользователей"
// 
// Возвращаемое значение:
//  СправочникСсылка.ВидыКонтрольныхПроцедур - ссылка на элемент с наименованием "Оценка пользователей". 
//
Функция ОценкаПользователей() Экспорт
    Возврат ПолучитьСсылкуПоНаименованию("Оценка пользователей"); 
КонецФункции

// Получает ссылку на элемент "Внешний контроль ЦКК"
// 
// Возвращаемое значение:
//  СправочникСсылка.ВидыКонтрольныхПроцедур - ссылка на элемент с наименованием "Внешний контроль ЦКК". 
//
Функция ВнешнийКонтрольЦКК() Экспорт
    Возврат ПолучитьСсылкуПоНаименованию("Внешний контроль ЦКК"); 
КонецФункции

Функция ПолучитьСсылкуПоНаименованию(Наименование) Экспорт
	Ссылка = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыКонтрольныхПроцедур.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыКонтрольныхПроцедур КАК ВидыКонтрольныхПроцедур
		|ГДЕ
		|	ВидыКонтрольныхПроцедур.Наименование = &Наименование";

	Запрос.УстановитьПараметр("Наименование", Наименование);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Ссылка = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;

	Возврат Ссылка;
КонецФункции

#КонецОбласти

#КонецЕсли