#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
    
#Область ПрограммныйИнтерфейс

Процедура ИнициализироватьИнтерфейс() Экспорт
    
    Запрос = Новый Запрос;
    
    Запрос.Текст = "
    |ВЫБРАТЬ
    |   Ссылка,
    |   ОтображатьВсеОбъекты
    |ИЗ
    |   Справочник.ИнтерфейсыКлиента
    |ГДЕ
    |   Предопределенный
    |";
    
    Запрос.Выполнить();
    
    УстановитьПривилегированныйРежим(Истина);
    
    Результат = Запрос.Выполнить();
    
    Выборка = Результат.Выбрать();
    Пока Выборка.Следующий() Цикл
        
        Если Выборка.Ссылка = Справочники.ИнтерфейсыКлиента.ПолныйИнтерфейс И НЕ Выборка.ОтображатьВсеОбъекты Тогда
            СпрОбъект = Справочники.ИнтерфейсыКлиента.ПолныйИнтерфейс.ПолучитьОбъект();
            СпрОбъект.ОтображатьВсеОбъекты = Истина;
            СпрОбъект.Записать();
        ИначеЕсли Выборка.Ссылка = Справочники.ИнтерфейсыКлиента.МобильныйКлиент И Выборка.ОтображатьВсеОбъекты Тогда
            СпрОбъект = Справочники.ИнтерфейсыКлиента.МобильныйКлиент.ПолучитьОбъект();
            СпрОбъект.ОтображатьВсеОбъекты = Ложь;
            СпрОбъект.Записать();
        КонецЕсли;
        
    КонецЦикла;
        
КонецПроцедуры

#КонецОбласти
    
#КонецЕсли