#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("Имя", Имя);
	Параметры.Свойство("ПолноеИмя", ПолноеИмя);
	
	ТабРолей = РаботаСоСценариямиАвтоматизацииПраваДоступа.ПолучитьРолиПользователя(Имя);
	ЗначениеВДанныеФормы(ТабРолей, РолиАвтоматизации);
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	РаботаСоСценариямиАвтоматизацииПраваДоступа.ЗаписатьРолиПользователя(Имя, ДанныеФормыВЗначение(РолиАвтоматизации, Тип("ТаблицаЗначений")));
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	Если Модифицированность Тогда
		СохранитьНаСервере();
	КонецЕсли;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура РолиАвтоматизацииУстановленаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти