#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
    
#Область ПрограммныйИнтерфейс

Процедура Добавить(ТипИнцидента, Инцидент) Экспорт
    
    МенеджерЗаписи = СоздатьМенеджерЗаписи();
    МенеджерЗаписи.ТипИнцидента = ТипИнцидента;
    МенеджерЗаписи.Инцидент = Инцидент;
    МенеджерЗаписи.Записать(Истина);
    
КонецПроцедуры

Процедура Удалить(ТипИнцидента, Инцидент) Экспорт
    
    МенеджерЗаписи = СоздатьМенеджерЗаписи();
    МенеджерЗаписи.ТипИнцидента = ТипИнцидента;
    МенеджерЗаписи.Инцидент = Инцидент;
    МенеджерЗаписи.Удалить();
    
КонецПроцедуры

#КонецОбласти

#КонецЕсли