
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры


&НаКлиенте
Процедура ИспользоватьВесовыеКоэффициентыПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	Элементы.ОбщийКоэффициентКорреляцииПрироста.Видимость = Объект.ИспользоватьВесовыеКоэффициенты;
	Элементы.ПриростДанныхВесовойКоэффициент.Видимость = Объект.ИспользоватьВесовыеКоэффициенты;
	Элементы.ПриростДанныхКоэффициентКорреляции.Видимость = НЕ Объект.ИспользоватьВесовыеКоэффициенты;
КонецПроцедуры


