Функция ТрансляцияСоставногоПараметра(Знач СтроковыйПараметр, ТаблицаШаблонов, Итератор = 0) Экспорт
	// текущая реализация - упрощенная, не предполагает вложенных составных параметров
	// параметр второго уровня не буде расшифорован
	
	// TODO: 
	// -- проверка и трансляция вложенных составных параметров
	// -- проверка на зацикливание вложенных параметров
	
	Если ТипЗнч(СтроковыйПараметр) = Тип("ХранилищеЗначения") Тогда
		СтроковыйПараметр = СтроковыйПараметр.Получить();
	КонецЕсли;	
	
	// нормализация параметров
	Для Каждого Строка Из ТаблицаШаблонов Цикл
		Если СтрНайти(СтроковыйПараметр, Строка.ИмяШаблона) > 0 Тогда 
			СтроковыйПараметр = СтрЗаменить(СтроковыйПараметр, Строка.ИмяШаблона, Строка.Значение);
		КонецЕсли;	
	КонецЦикла;
	
	Успех = Истина;
	Пока Успех Цикл
		Успех = Ложь;
		// расшифровать ТекущаяДатаСеанса
		Успех = РасшифроватьТекущаяДатаСеанса(СтроковыйПараметр) Или Успех;
		
		// расшифровать НачалоЧаса
		Успех = РасшифроватьНачалоЧаса(СтроковыйПараметр) Или Успех;
		
		// расшифровать КонецЧаса
		Успех = РасшифроватьКонецЧаса(СтроковыйПараметр) Или Успех;
		
		// расшифровать НачалоДня 
		Успех = РасшифроватьНачалоДня(СтроковыйПараметр) Или Успех;
		
		// расшифровать КонецДня             
		Успех = РасшифроватьКонецДня(СтроковыйПараметр) Или Успех;
		
		// расшифровать ФорматированнаяДата             
		Успех = РасшифроватьФорматированнуюДату(СтроковыйПараметр) Или Успех;
	КонецЦикла;
	
	Возврат СтроковыйПараметр;
КонецФункции

Функция РасшифроватьТекущаяДатаСеанса(СтроковыйПараметр)
	НачальнаяПозиция = СтрНайти(НРег(СтроковыйПараметр), НРег("ТекущаяДатаСеанса()"));
	Если НачальнаяПозиция = 0 Тогда
		Возврат Ложь;
	КонецЕсли;	

	СтроковыйПараметр = СтрЗаменить(СтроковыйПараметр, "ТекущаяДатаСеанса()", РаботаСоСценариямиАвтоматизацииСервер.ПолучитьТекущуюДатуСеанса());
	
	Возврат Истина;
КонецФункции	

Функция РасшифроватьНачалоЧаса(СтроковыйПараметр)
	НачальнаяПозиция = СтрНайти(НРег(СтроковыйПараметр), НРег("НачалоЧаса("));
	КонечнаяПозиция = СтрНайти(НРег(СтроковыйПараметр), НРег(")"),,);
	ОшибочнаяСкобка = СтрНайти(НРег(СтроковыйПараметр), НРег("("),,НачальнаяПозиция+1,2);
	
	Если КонечнаяПозиция <= НачальнаяПозиция Или (ОшибочнаяСкобка <> 0 И ОшибочнаяСкобка < КонечнаяПозиция) Или НачальнаяПозиция = 0 Тогда
		Если (КонечнаяПозиция <= НачальнаяПозиция И Не НачальнаяПозиция = 0) Тогда
			Сообщить("Неверный синтаксис при использовании операции НачалоЧаса(<Дата>)");
		КонецЕсли;	
		Возврат Ложь;
	КонецЕсли;	
	
	// найдем Дату
	НайденнаяДатаСтрокой = Сред(СтроковыйПараметр, НачальнаяПозиция+11, КонечнаяПозиция - НачальнаяПозиция - 11);
	Попытка
		НайденнаяДата = Дата(НайденнаяДатаСтрокой);
	Исключение
		НайденнаяДата = Неопределено;
	КонецПопытки;	
	
	Если НайденнаяДата = Неопределено Тогда
		Сообщить("Неверный синтаксис при использовании операции НачалоЧаса(<Дата>)");
		Возврат Ложь;
	КонецЕсли;	
	ПреобразованнаяДата = НачалоЧаса(НайденнаяДата);
	
	СтроковыйПараметр = СтрЗаменить(СтроковыйПараметр, "НачалоЧаса(" + НайденнаяДатаСтрокой + ")", Строка(ПреобразованнаяДата));
	
	Возврат Истина;
КонецФункции	

Функция РасшифроватьКонецЧаса(СтроковыйПараметр)
	НачальнаяПозиция = СтрНайти(НРег(СтроковыйПараметр), НРег("КонецЧаса("));
	КонечнаяПозиция = СтрНайти(НРег(СтроковыйПараметр), НРег(")"),,);
	ОшибочнаяСкобка = СтрНайти(НРег(СтроковыйПараметр), НРег("("),,НачальнаяПозиция+1,2);
	
	Если КонечнаяПозиция <= НачальнаяПозиция Или (ОшибочнаяСкобка <> 0 И ОшибочнаяСкобка < КонечнаяПозиция) Или НачальнаяПозиция = 0 Тогда
		Если (КонечнаяПозиция <= НачальнаяПозиция И Не НачальнаяПозиция = 0) Тогда
			Сообщить("Неверный синтаксис при использовании операции КонецЧаса(<Дата>)");
		КонецЕсли;	
		Возврат Ложь;
	КонецЕсли;	
	
	// найдем Дату
	НайденнаяДатаСтрокой = Сред(СтроковыйПараметр, НачальнаяПозиция+10, КонечнаяПозиция - НачальнаяПозиция - 10);
	Попытка
		НайденнаяДата = Дата(НайденнаяДатаСтрокой);
	Исключение
		НайденнаяДата = Неопределено;
	КонецПопытки;	
	
	Если НайденнаяДата = Неопределено Тогда
		Сообщить("Неверный синтаксис при использовании операции КонецЧаса(<Дата>)");
		Возврат Ложь;
	КонецЕсли;	
	ПреобразованнаяДата = НачалоЧаса(НайденнаяДата);
	
	СтроковыйПараметр = СтрЗаменить(СтроковыйПараметр, "КонецЧаса(" + НайденнаяДатаСтрокой + ")", Строка(ПреобразованнаяДата));
	
	Возврат Истина;
КонецФункции	

Функция РасшифроватьНачалоДня(СтроковыйПараметр)
	НачальнаяПозиция = СтрНайти(НРег(СтроковыйПараметр), НРег("НачалоДня("));
	КонечнаяПозиция = СтрНайти(НРег(СтроковыйПараметр), НРег(")"),,);
	ОшибочнаяСкобка = СтрНайти(НРег(СтроковыйПараметр), НРег("("),,НачальнаяПозиция+1,2);
	
	Если КонечнаяПозиция <= НачальнаяПозиция Или (ОшибочнаяСкобка <> 0 И ОшибочнаяСкобка < КонечнаяПозиция) Или НачальнаяПозиция = 0 Тогда
		Если (КонечнаяПозиция <= НачальнаяПозиция И Не НачальнаяПозиция = 0) Тогда
			Сообщить("Неверный синтаксис при использовании операции НачалоДня(<Дата>)");
		КонецЕсли;	
		Возврат Ложь;
	КонецЕсли;	
	
	// найдем Дату
	НайденнаяДатаСтрокой = Сред(СтроковыйПараметр, НачальнаяПозиция+10, КонечнаяПозиция - НачальнаяПозиция - 10);
	Попытка
		НайденнаяДата = Дата(НайденнаяДатаСтрокой);
	Исключение
		НайденнаяДата = Неопределено;
	КонецПопытки;	
	
	Если НайденнаяДата = Неопределено Тогда
		Сообщить("Неверный синтаксис при использовании операции НачалоДня(<Дата>)");
		Возврат Ложь;
	КонецЕсли;	
	
	ПреобразованнаяДата = НачалоДня(НайденнаяДата);
	
	СтроковыйПараметр = СтрЗаменить(СтроковыйПараметр, "НачалоДня(" + НайденнаяДатаСтрокой + ")", Строка(ПреобразованнаяДата));
	
	Возврат Истина;
КонецФункции	

Функция РасшифроватьКонецДня(СтроковыйПараметр)
	НачальнаяПозиция = СтрНайти(НРег(СтроковыйПараметр), НРег("КонецДня("));
	КонечнаяПозиция = СтрНайти(НРег(СтроковыйПараметр), НРег(")"),,);
	ОшибочнаяСкобка = СтрНайти(НРег(СтроковыйПараметр), НРег("("),,НачальнаяПозиция+1,2);
	
	Если КонечнаяПозиция <= НачальнаяПозиция Или (ОшибочнаяСкобка <> 0 И ОшибочнаяСкобка < КонечнаяПозиция) Или НачальнаяПозиция = 0 Тогда
		Если (КонечнаяПозиция <= НачальнаяПозиция И Не НачальнаяПозиция = 0) Тогда
			Сообщить("Неверный синтаксис при использовании операции КонецДня(<Дата>)");
		КонецЕсли;	
		Возврат Ложь;
	КонецЕсли;	
	
	// найдем Дату
	НайденнаяДатаСтрокой = Сред(СтроковыйПараметр, НачальнаяПозиция+9, КонечнаяПозиция - НачальнаяПозиция - 9);
	Попытка
		НайденнаяДата = Дата(НайденнаяДатаСтрокой);
	Исключение
		НайденнаяДата = Неопределено;
	КонецПопытки;	
	
	Если НайденнаяДата = Неопределено Тогда
		Сообщить("Неверный синтаксис при использовании операции КонецДня(<Дата>)");
		Возврат Ложь;
	КонецЕсли;	
	
	ПреобразованнаяДата = КонецДня(НайденнаяДата);
	
	СтроковыйПараметр = СтрЗаменить(СтроковыйПараметр, "КонецДня(" + НайденнаяДатаСтрокой + ")", Строка(ПреобразованнаяДата));
	
	Возврат Истина;
КонецФункции	

Функция РасшифроватьФорматированнуюДату(СтроковыйПараметр)
	НачальнаяПозиция = СтрНайти(НРег(СтроковыйПараметр), НРег("Формат("));
	НачальнаяПозицияДФ = СтрНайти(НРег(СтроковыйПараметр), НРег("""ДФ="));
	КонечнаяПозиция = СтрНайти(НРег(СтроковыйПараметр), НРег(","),,);
	КонечнаяПозицияДФ = СтрНайти(НРег(СтроковыйПараметр), НРег(""")"));
	ОшибочнаяСкобка = СтрНайти(НРег(СтроковыйПараметр), НРег("("),,НачальнаяПозиция+1,2);
	
	Если КонечнаяПозиция <= НачальнаяПозиция Или КонечнаяПозицияДФ <= НачальнаяПозицияДФ 
		Или НачальнаяПозицияДФ = 0 Или НачальнаяПозиция = 0
		Или ОшибочнаяСкобка <> 0 И (ОшибочнаяСкобка < КонечнаяПозиция Или ОшибочнаяСкобка < КонечнаяПозицияДФ) Тогда
			Если (КонечнаяПозиция <= НачальнаяПозиция И Не НачальнаяПозиция = 0) Или (КонечнаяПозицияДФ <= НачальнаяПозицияДФ  И Не НачальнаяПозицияДФ = 0) Тогда
				Сообщить("Неверный синтаксис при использовании операции Формат(<Дата>, ""ДФ=<ФорматнаяСтрока>"")");
			КонецЕсли;	
			Возврат Ложь;
	КонецЕсли;	
	
	// найдем Дату
	НайденнаяДатаСтрокой = Сред(СтроковыйПараметр, НачальнаяПозиция+7, КонечнаяПозиция - НачальнаяПозиция - 7);
	Попытка
		НайденнаяДата = Дата(НайденнаяДатаСтрокой);
	Исключение
		НайденнаяДата = Неопределено;
	КонецПопытки;	
	
	Если НайденнаяДата = Неопределено Тогда
		Сообщить("Неверный синтаксис при использовании операции Формат(<Дата>, ""ДФ=<ФорматнаяСтрока>"")");
		Возврат Ложь;
	КонецЕсли;	
	
	ФорматСтрокой = Сред(СтроковыйПараметр, НачальнаяПозицияДФ+4, КонечнаяПозицияДФ - НачальнаяПозицияДФ - 4);
	
	ВсяДатаСФорматомСтрокой = Сред(СтроковыйПараметр, НачальнаяПозиция, КонечнаяПозицияДФ-НачальнаяПозиция + 2);
	
	СтроковыйПараметр = СтрЗаменить(СтроковыйПараметр, ВсяДатаСФорматомСтрокой, Формат(НайденнаяДата, "ДФ=" + ФорматСтрокой + ""));
	
	Возврат Истина;
КонецФункции	

