&НаКлиенте
Процедура ПолучитьОсновнойШаблон(Команда)
	Объект.ДополнительныйТекстПредупреждения = ПолучитьОсновнойШаблонНаСервере(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьШаблонПервойРегистрации(Команда)
	Объект.ШаблонПервойРегистрации = ПолучитьШаблонПервойРегистрацииНаСервере(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьШаблонПовторнойРегистрации(Команда)
	Объект.ШаблонПовторнойРегистрации = ПолучитьШаблонПовторнойРегистрацииНаСервере(Объект.Ссылка);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОсновнойШаблонНаСервере(Ссылка)
	Если Ссылка = Справочники.ТипыЗадачКонтрольПамяти.ПревышенПорогПотребленияПамяти Тогда
		Возврат Справочники.ТипыЗадачКонтрольПамяти.ПолучитьОсновнойШаблонПревышенПорогПотребленияПамяти();
	ИначеЕсли Ссылка = Справочники.ТипыЗадачКонтрольПамяти.НедоступенКластер Тогда
		Возврат Справочники.ТипыЗадачКонтрольПамяти.ПолучитьОсновнойШаблонНедоступенКластер();
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьШаблонПервойРегистрацииНаСервере(Ссылка)
	Если Ссылка = Справочники.ТипыЗадачКонтрольПамяти.ПревышенПорогПотребленияПамяти Тогда
		Возврат Справочники.ТипыЗадачКонтрольПамяти.ПолучитьШаблонПервойРегистрацииПревышенПорогПотребленияПамяти();
	ИначеЕсли Ссылка = Справочники.ТипыЗадачКонтрольПамяти.НедоступенКластер Тогда
		Возврат Справочники.ТипыЗадачКонтрольПамяти.ПолучитьШаблонПервойРегистрацииНедоступенКластер();
	КонецЕсли;	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьШаблонПовторнойРегистрацииНаСервере(Ссылка)
	Если Ссылка = Справочники.ТипыЗадачКонтрольПамяти.ПревышенПорогПотребленияПамяти Тогда
		Возврат Справочники.ТипыЗадачКонтрольПамяти.ПолучитьШаблонПовторнойРегистрацииПревышенПорогПотребленияПамяти();
	ИначеЕсли Ссылка = Справочники.ТипыЗадачКонтрольПамяти.НедоступенКластер Тогда
		Возврат Справочники.ТипыЗадачКонтрольПамяти.ПолучитьШаблонПовторнойРегистрацииНедоступенКластер();
	КонецЕсли;
КонецФункции


