
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Объект.Ссылка.Пустая() Тогда
		УстановитьПривилегированныйРежим(Истина);
		ПараметрыАвторизации = РегистрыСведений.БезопасноеХранилище.ПолучитьДанные(Объект.Ссылка);
		УстановитьПривилегированныйРежим(Ложь);
		Если ПараметрыАвторизации <> Неопределено Тогда
			Логин = ПараметрыАвторизации.Логин;
			Пароль = ПараметрыАвторизации.Пароль;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ПараметрыАвторизации = Новый Структура("Логин, Пароль", Логин, Пароль);
	УстановитьПривилегированныйРежим(Истина);
	РегистрыСведений.БезопасноеХранилище.ЗаписатьДанные(ТекущийОбъект.Ссылка, ПараметрыАвторизации);
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыполнитьАнализНаСервере(Настройка)
	Справочники.НастройкиАнализаПроблемПроизводительности.ВыполнитьАнализПроблемПроизводительностиПоНастройке(Настройка);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьАнализ(Команда)
	ВыполнитьАнализНаСервере(Объект.Ссылка);
КонецПроцедуры




