
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПараметрыПолучения = Константы.НастройкиПолученияПолныхДампов.Получить().Получить();
	Если ПараметрыПолучения = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ПараметрыПолучения.Свойство("АдресСервиса") Тогда
		АдресСервиса = ПараметрыПолучения.АдресСервиса;
	КонецЕсли;
	Если ПараметрыПолучения.Свойство("Логин") Тогда
		Логин = ПараметрыПолучения.Логин;
	КонецЕсли;
	Если ПараметрыПолучения.Свойство("Пароль") Тогда
		Пароль = ПараметрыПолучения.Пароль;
	КонецЕсли;
	Если ПараметрыПолучения.Свойство("ГлубинаПолученияИнформационныхБаз") Тогда
		ГлубинаПолученияИнформационныхБаз = ПараметрыПолучения.ГлубинаПолученияИнформационныхБаз;
	КонецЕсли;
	Если ПараметрыПолучения.Свойство("МаксимальноеКоличествоКлиентовДляВариантаДампа") Тогда
		МаксимальноеКоличествоКлиентовДляВариантаДампа = ПараметрыПолучения.МаксимальноеКоличествоКлиентовДляВариантаДампа;
	КонецЕсли;
	Если ПараметрыПолучения.Свойство("КоличествоВариантовДампов") Тогда
		КоличествоВариантовДампов = ПараметрыПолучения.КоличествоВариантовДампов;
	КонецЕсли;
	Если ПараметрыПолучения.Свойство("КоличествоВерсийПлатформы") Тогда
		КоличествоВерсийПлатформы = ПараметрыПолучения.КоличествоВерсийПлатформы;
	КонецЕсли;
	Если ПараметрыПолучения.Свойство("СтандартныеПодсистемы") Тогда
		СтандартныеПодсистемы = ПараметрыПолучения.СтандартныеПодсистемы;
	КонецЕсли;
	Если ПараметрыПолучения.Свойство("ВерсияПодсистемы") Тогда
		ВерсияПодсистемы = ПараметрыПолучения.ВерсияПодсистемы;
	КонецЕсли;
	Если ПараметрыПолучения.Свойство("МинимальноеКоличествоКлиентов") Тогда
		МинимальноеКоличествоКлиентов = ПараметрыПолучения.МинимальноеКоличествоКлиентов;
	КонецЕсли;
	Если ПараметрыПолучения.Свойство("Статусы") Тогда
		Статусы.ЗагрузитьЗначения(ПараметрыПолучения.Статусы);
	КонецЕсли;
	ПараметрыПолучения.Свойство("ПериодСбораДампа", ПериодСбораДампа);
	ПараметрыПолучения.Свойство("РезервМестаВключен", РезервМестаВключен);
	ПараметрыПолучения.Свойство("РезервМестаВыключен", РезервМестаВыключен);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьИЗакрытьНаСервере();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИЗакрытьНаСервере()
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("АдресСервиса", АдресСервиса);
	СтруктураНастроек.Вставить("Логин", Логин);
	СтруктураНастроек.Вставить("Пароль", Пароль);
	СтруктураНастроек.Вставить("ГлубинаПолученияИнформационныхБаз", ГлубинаПолученияИнформационныхБаз);
	СтруктураНастроек.Вставить("МаксимальноеКоличествоКлиентовДляВариантаДампа", МаксимальноеКоличествоКлиентовДляВариантаДампа);
	СтруктураНастроек.Вставить("КоличествоВариантовДампов", КоличествоВариантовДампов);
	СтруктураНастроек.Вставить("КоличествоВерсийПлатформы", КоличествоВерсийПлатформы);
	СтруктураНастроек.Вставить("СтандартныеПодсистемы", СтандартныеПодсистемы);
	СтруктураНастроек.Вставить("ВерсияПодсистемы", ВерсияПодсистемы);
	СтруктураНастроек.Вставить("МинимальноеКоличествоКлиентов", МинимальноеКоличествоКлиентов);
	СтруктураНастроек.Вставить("Статусы", Статусы.ВыгрузитьЗначения());
	СтруктураНастроек.Вставить("ПериодСбораДампа", ПериодСбораДампа);
	СтруктураНастроек.Вставить("РезервМестаВключен", РезервМестаВключен);
	СтруктураНастроек.Вставить("РезервМестаВыключен", РезервМестаВыключен);
	
	Константы.НастройкиПолученияПолныхДампов.Установить(Новый ХранилищеЗначения(СтруктураНастроек));
КонецПроцедуры
