&НаСервере
Функция ПолучитьСписокОповещений()
	
	Результат = Новый Массив();
	
	Отбор = Новый Структура("ОтноситсяКТипуИнцидента", Объект.Ссылка);
	Выборка = Справочники.Оповещения.Выбрать(,,Отбор);
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьОповещения(Команда)
	
	СписокПодходящихОповещений = ПолучитьСписокОповещений();
	
	Если СписокПодходящихОповещений.Количество()=0 Тогда
		ПоказатьПредупреждение(,"Нет подходящих оповещений для типа инцидента");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Ссылка", СписокПодходящихОповещений));
	ОткрытьФорму("Справочник.Оповещения.ФормаСписка", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОповещение(Команда)
	
	ПараметрыФормы = Новый Структура("ТипИнцидентаДляЗаполненияФильтра", Объект.Ссылка);
	ОткрытьФорму("Справочник.Оповещения.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры
