
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПараметрОповещения = МониторингСервер.ПараметрОповещенияПоказательЗаписан(ТекущийОбъект);
	ПараметрОповещения.Изменился = ОбъектИзменился();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПараметрОповещения.Ссылка = Объект.Ссылка;
	ПараметрОповещения.Описание = Объект.Описание;
	Оповестить("ПоказательЗаписан", ПараметрОповещения, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Функция ОбъектИзменился()
	
	Если Объект.ВсеКластеры <> Объект.Ссылка.ВсеКластеры Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если НЕ Объект.ВсеКластеры И Объект.Кластер <> Объект.Ссылка.Кластер Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если Объект.ИнтервалУсреднения <> Объект.Ссылка.ИнтервалУсреднения Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция ВыборкаСерверовКластера(КластерСсылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ 
	|	Параметры.ОбъектКонтроля КАК Сервер
	|ИЗ 
	|	РегистрСведений.ПараметрыРабочихСерверов КАК Параметры
	|ГДЕ
	|   Параметры.Кластер = &Кластер ";
	Запрос.УстановитьПараметр("Кластер", КластерСсылка);
	ВыборкаНастроек = Запрос.Выполнить().Выбрать();
	Возврат ВыборкаНастроек;
КонецФункции
