
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем Условия;	
	Параметры.Свойство("Условия", Условия);
	Если НЕ ПустаяСтрока(Условия) Тогда
		
		Попытка
			
			ЧтениеXML = Новый ЧтениеXML;
			ЧтениеXML.УстановитьСтроку(Условия);
			Если ЧтениеXML.Прочитать() Тогда
				Пока ЧтениеXML.Прочитать() Цикл
					Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
						Продолжить;
					КонецЕсли;
					НовСтр = ТаблицаУсловий.Добавить();
					НовСтр.ТипСравнения = ЧтениеXML.ПолучитьАтрибут("condition");
					НовСтр.ИмяСвойства = ЧтениеXML.ПолучитьАтрибут("property");
					НовСтр.ТипСвойства = ЧтениеXML.ПолучитьАтрибут("type");
					НовСтр.Значение = ЧтениеXML.ПолучитьАтрибут("value");
					ЧтениеXML.Прочитать();
				КонецЦикла;
			КонецЕсли;
			
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
	КонецЕсли;
	
	Элементы.ТаблицаУсловийТипСравнения.СписокВыбора.Добавить("eq", "=");
	Элементы.ТаблицаУсловийТипСравнения.СписокВыбора.Добавить("gt", ">");
	Элементы.ТаблицаУсловийТипСравнения.СписокВыбора.Добавить("lt", "<");
	Элементы.ТаблицаУсловийТипСравнения.СписокВыбора.Добавить("ne", "<>");
	Элементы.ТаблицаУсловийТипСравнения.СписокВыбора.Добавить("ge", ">=");
	Элементы.ТаблицаУсловийТипСравнения.СписокВыбора.Добавить("le", "<=");
КонецПроцедуры


&НаКлиенте
Процедура ОК(Команда)
	Настройки = Новый Массив;
	
	Для Каждого Строка Из ТаблицаУсловий Цикл
		Структура = Новый Структура("ТипСравнения,ИмяСвойства,ТипСвойства,Значение");
		ЗаполнитьЗначенияСвойств(Структура, Строка);
		Настройки.Добавить(Структура);
	КонецЦикла;
	
	Закрыть(Настройки);
КонецПроцедуры

