
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
        ЭтотОбъект.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Нет;
        ЭтотОбъект.Элементы.Наименование.Видимость = Ложь;
        ЭтотОбъект.Элементы.ГруппаКоманднаяПанельНастройкиПоУмолчанию.Видимость = Истина;
        ЭтотОбъект.Элементы.ЗаписатьИЗАкрытьМоя.КнопкаПоУмолчанию = Истина;
    КонецЕсли;
    
    ЗаполнитьНастройкиПоУмолчанию();
    
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    
    ЗаписатьНастройкиПоУмолчанию();
    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрытьМоя(Команда)
    
    ЗаписатьНастройкиПоУмолчанию();
    ЭтотОбъект.Закрыть();
    
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьМоя(Команда)
    ЗаписатьНастройкиПоУмолчанию();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНастройкиПоУмолчанию()
    
    Настройки = РегистрыСведений.ПараметрыРабочихСерверов.ПрочитатьНастройки(Справочники.ВидыОбъектовКонтроля.РабочийСервер);
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "ДиапазоныIpПортов";
    НовСтрока.ПараметрПредставление = "Диапазоны IP портов";
    НовСтрока.ПараметрЗначение = Формат(Настройки.ДиапазонПортовОт, "ЧН=0; ЧГ=0") + ":" + Формат(Настройки.ДиапазонПортовДо, "ЧН=0; ЧГ=0");
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "КаталогВременный";
    НовСтрока.ПараметрПредставление = "Каталог временных файлов";
    НовСтрока.ПараметрЗначение = Настройки.КаталогВременный;
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "КаталогНастроекТЖ";
    НовСтрока.ПараметрПредставление = "Каталог настроек ТЖ локальный";
    НовСтрока.ПараметрЗначение = Настройки.КаталогНастроекТЖ;
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "КаталогНастроекТЖСетевой";
    НовСтрока.ПараметрПредставление = "Каталог настроек ТЖ сетевой";
    НовСтрока.ПараметрЗначение = Настройки.КаталогНастроекТЖСетевой;
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "КаталогОбменаДанными";
    НовСтрока.ПараметрПредставление = "Каталог сбора данных ТЖ локальный";
    НовСтрока.ПараметрЗначение = Настройки.КаталогОбменаДанными;
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "КаталогОбменаДаннымиСетевой";
    НовСтрока.ПараметрПредставление = "Каталог сбора данных ТЖ сетевой";
    НовСтрока.ПараметрЗначение = Настройки.КаталогОбменаДаннымиСетевой;
    
КонецПроцедуры

Процедура ЗаписатьНастройкиПоУмолчанию()
    
    Настройки = Новый Структура;
    
    Для Каждого ТекПараметр Из ПараметрыПоУмолчанию Цикл
        
        Если ТекПараметр.Параметр = "ДиапазоныIpПортов" Тогда
            
            ДиапазонПортовМассив = СтрРазделить(ТекПараметр.ПараметрЗначение, ":", Ложь);
            Если ДиапазонПортовМассив.Количество() = 2 Тогда
                Настройки.Вставить("ДиапазонПортовОт", ДиапазонПортовМассив[0]);
                Настройки.Вставить("ДиапазонПортовДо", ДиапазонПортовМассив[1]);
            Иначе
                Настройки.Вставить("ДиапазонПортовОт", 0);
                Настройки.Вставить("ДиапазонПортовДо", 0);
            КонецЕсли;
                        
        Иначе
            
            Настройки.Вставить(ТекПараметр.Параметр, ТекПараметр.ПараметрЗначение);
            
        КонецЕсли;
        
    КонецЦикла;
    
    РегистрыСведений.ПараметрыРабочихСерверов.ЗаписатьНастройки(Справочники.ВидыОбъектовКонтроля.РабочийСервер, Настройки);
        
КонецПроцедуры

#КонецОбласти
