&НаКлиенте
Процедура ПолучитьОсновнойШаблон(Команда)
	Объект.ДополнительныйТекстПредупреждения = ПолучитьОсновнойШаблонНаСервере(Объект.Ссылка);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОсновнойШаблонНаСервере(Ссылка)
	Если Ссылка = Справочники.ТипыЗадачСборДампов.СборДамповНовыйДампРассмотреть Тогда
		Возврат Справочники.ТипыЗадачСборДампов.ПолучитьОсновнойШаблонНовыйДампРассмотреть();
	ИначеЕсли Ссылка = Справочники.ТипыЗадачСборДампов.КаталогЛоговЗавершившегосяПроцессаПуст Тогда
		Возврат Справочники.ТипыЗадачСборДампов.ПолучитьОсновнойШаблонКаталогЛоговЗавершившегосяПроцессаПуст();
	КонецЕсли;
КонецФункции


