
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
        ЭтотОбъект.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Нет;
        ЭтотОбъект.Элементы.Наименование.Видимость = Ложь;
        ЭтотОбъект.Элементы.ГруппаКоманднаяПанельНастройкиПоУмолчанию.Видимость = Истина;
        ЭтотОбъект.Элементы.ЗаписатьИЗАкрытьМоя.КнопкаПоУмолчанию = Истина;
    КонецЕсли;
    
    ЗаполнитьНастройки();
    
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    
    ЗаполнитьДанныеЭлементовФормы();
    
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    
    Если ТипПодключения = "RAS" Тогда
        ЗаписатьНастройкиПоУмолчаниюRAS();
    ИначеЕсли ТипПодключения = "COM" Тогда
        ЗаписатьНастройкиПоУмолчаниюCOM();
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрытьМоя(Команда)
    
    ЗаписатьМоя(Команда);    
    ЭтотОбъект.Закрыть();    
    
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьМоя(Команда)
    
    Если ТипПодключения = "RAS" Тогда
        ЗаписатьНастройкиПоУмолчаниюRAS();
    ИначеЕсли ТипПодключения = "COM" Тогда
        ЗаписатьНастройкиПоУмолчаниюCOM();
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТипПодключенияПриИзменении(Элемент)
    
    Если ТипПодключения = "RAS" Тогда
        ЗаполнитьДанныеЭлементовФормыRAS();
    ИначеЕсли ТипПодключения = "COM" Тогда
        ЗаполнитьДанныеЭлементовФормыCOM();
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНастройки()
    
    Настройки.Очистить();
    
    НастройкиПоУмолчанию = РегистрыСведений.ПараметрыКластеров.ПрочитатьНастройки(Справочники.ВидыОбъектовКонтроля.КластерСерверов1С);
    
    Для Каждого ТекНастройка Из НастройкиПоУмолчанию Цикл
        
        НовНастройка = Настройки.Добавить();
        НовНастройка.Параметр = ТекНастройка.Ключ;
        НовНастройка.ПараметрЗначение = ТекНастройка.Значение;
        
    КонецЦикла;
        
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеЭлементовФормы()
    
    Для Каждого ТекНастройка Из Настройки Цикл
        
        Если ТекНастройка.Параметр = "ТипПодключения" Тогда
            
            ТипПодключения = ТекНастройка.ПараметрЗначение;
            
            Если ТипПодключения = "RAS" Тогда
                ЗаполнитьДанныеЭлементовФормыRAS();
            ИначеЕсли ТипПодключения = "COM" Тогда
                ЗаполнитьДанныеЭлементовФормыCOM();
            КонецЕсли;
            
            Прервать;
            
        КонецЕсли;
        
    КонецЦикла;
    
    Если НЕ ЗначениеЗаполнено(ТипПодключения) Тогда
        ТипПодключения = "RAS";
        ЗаполнитьДанныеЭлементовФормыRAS();
    КонецЕсли;
        
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеЭлементовФормыCOM()
    
    НастройкиБуфер = Новый Соответствие;
    
    Для Каждого ТекНастройка Из Настройки Цикл
        
        Если ТекНастройка.Параметр = "ТипПодключения" Тогда
            // Ничего делать не надо, уже сделали...
        ИначеЕсли ТекНастройка.Параметр = "АдминистраторКластера" Тогда    
            АдминистраторКластера = ТекНастройка.ПараметрЗначение;
        ИначеЕсли ТекНастройка.Параметр = "ПарольАдминистратораКластера" Тогда
            ПарольАдминистратораКластера = "SDF";
        Иначе
            НастройкиБуфер.Вставить(ТекНастройка.Параметр, ТекНастройка.ПараметрЗначение);    
        КонецЕсли;
        
    КонецЦикла;
    
    ПараметрыПоУмолчанию.Очистить();
    
    Если ЗначениеЗаполнено(НастройкиБуфер["ПортАгентаКластера"]) Тогда
        НовСтрока = ПараметрыПоУмолчанию.Добавить();
        НовСтрока.Параметр = "АгентСервера";
        НовСтрока.ПараметрПредставление = "Агент сервера";
        НовСтрока.ПараметрЗначение = НастройкиБуфер["АдресКластера"] + ":" + Формат(НастройкиБуфер["ПортАгентаКластера"], "ЧГ=0");
    Иначе
        НовСтрока = ПараметрыПоУмолчанию.Добавить();
        НовСтрока.Параметр = "АгентСервера";
        НовСтрока.ПараметрПредставление = "Сервер администрирования";
        НовСтрока.ПараметрЗначение = НастройкиБуфер["АдресКластера"] + ":1540";
    КонецЕсли;
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "ВерсияПлатформы";
    НовСтрока.ПараметрПредставление = "Версия платформы";
    НовСтрока.ПараметрЗначение = НастройкиБуфер["ВерсияПлатформы"];
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "ПортКластера";
    НовСтрока.ПараметрПредставление = "Основной порт менеджера кластера";
    НовСтрока.ПараметрЗначение = НастройкиБуфер["ПортКластера"];
    
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеЭлементовФормыRAS()
    
    НастройкиБуфер = Новый Соответствие;
    
    Для Каждого ТекНастройка Из Настройки Цикл
        
        Если ТекНастройка.Параметр = "ТипПодключения" Тогда
            // Ничего делать не надо, уже сделали...
        ИначеЕсли ТекНастройка.Параметр = "АдминистраторКластера" Тогда    
            АдминистраторКластера = ТекНастройка.ПараметрЗначение;
        ИначеЕсли ТекНастройка.Параметр = "ПарольАдминистратораКластера" Тогда
            ПарольАдминистратораКластера = "SDF";
        Иначе
            НастройкиБуфер.Вставить(ТекНастройка.Параметр, ТекНастройка.ПараметрЗначение);    
        КонецЕсли;
        
    КонецЦикла;
    
    ПараметрыПоУмолчанию.Очистить();
    
    Если ЗначениеЗаполнено(НастройкиБуфер["ПортСервераАдминистрирования"]) Тогда
        НовСтрока = ПараметрыПоУмолчанию.Добавить();
        НовСтрока.Параметр = "СерверАдминистрирования";
        НовСтрока.ПараметрПредставление = "Сервер администрирования";
        НовСтрока.ПараметрЗначение = НастройкиБуфер["АдресСервераАдминистрирования"] + ":" + Формат(НастройкиБуфер["ПортСервераАдминистрирования"], "ЧГ=0");
    Иначе
        НовСтрока = ПараметрыПоУмолчанию.Добавить();
        НовСтрока.Параметр = "СерверАдминистрирования";
        НовСтрока.ПараметрПредставление = "Сервер администрирования";
        НовСтрока.ПараметрЗначение = НастройкиБуфер["АдресСервераАдминистрирования"] + ":1545";
    КонецЕсли;
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "КаталогЗапускаСервераАдминистрирования";
    НовСтрока.ПараметрПредставление = "Каталог клиента администирования";
    НовСтрока.ПараметрЗначение = НастройкиБуфер["КаталогЗапускаСервераАдминистрирования"];
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "ВерсияПлатформы";
    НовСтрока.ПараметрПредставление = "Версия платформы";
    НовСтрока.ПараметрЗначение = НастройкиБуфер["ВерсияПлатформы"];
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "ПортКластера";
    НовСтрока.ПараметрПредставление = "Основной порт менеджера кластера";
    НовСтрока.ПараметрЗначение = НастройкиБуфер["ПортКластера"];
    
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиПоУмолчаниюRAS()
    
    НастройкиДляЗаписи = Новый Структура;
    НастройкиДляЗаписи.Вставить("ТипПодключения", ТипПодключения);
    НастройкиДляЗаписи.Вставить("АдминистраторКластера", АдминистраторКластера);
    НастройкиДляЗаписи.Вставить("ПарольАдминистратораКластера", ПарольАдминистратораКластера);
    
    Для Каждого ТекНастройка Из ПараметрыПоУмолчанию Цикл
        
        Если ТекНастройка.Параметр = "СерверАдминистрирования" Тогда
            
            СерверМассив = СтрРазделить(ТекНастройка.ПараметрЗначение, ":", Истина);
            Если СерверМассив.Количество() = 1 Тогда
                НастройкиДляЗаписи.Вставить("АдресСервераАдминистрирования", СерверМассив[0]);
                НастройкиДляЗаписи.Вставить("ПортСервераАдминистрирования", 1545);
            ИначеЕсли СерверМассив.Количество() = 2 Тогда
                НастройкиДляЗаписи.Вставить("АдресСервераАдминистрирования", СерверМассив[0]);
                НастройкиДляЗаписи.Вставить("ПортСервераАдминистрирования", СерверМассив[1]);
            КонецЕсли;
            
        ИначеЕсли ТекНастройка.Параметр = "КаталогЗапускаСервераАдминистрирования" Тогда
             НастройкиДляЗаписи.Вставить("КаталогЗапускаСервераАдминистрирования", ТекНастройка.ПараметрЗначение);    
        ИначеЕсли ТекНастройка.Параметр = "ВерсияПлатформы" Тогда
             НастройкиДляЗаписи.Вставить("ВерсияПлатформы", ТекНастройка.ПараметрЗначение);    
        ИначеЕсли ТекНастройка.Параметр = "ПортКластера" Тогда
             НастройкиДляЗаписи.Вставить("ПортКластера", ТекНастройка.ПараметрЗначение);
        КонецЕсли;
                
    КонецЦикла;
    
    РегистрыСведений.ПараметрыКластеров.ЗаписатьНастройки(Справочники.ВидыОбъектовКонтроля.КластерСерверов1С, НастройкиДляЗаписи);
        
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиПоУмолчаниюCOM()
    
    НастройкиДляЗаписи = Новый Структура;
    НастройкиДляЗаписи.Вставить("ТипПодключения", ТипПодключения);
    НастройкиДляЗаписи.Вставить("АдминистраторКластера", АдминистраторКластера);
    НастройкиДляЗаписи.Вставить("ПарольАдминистратораКластера", ПарольАдминистратораКластера);
    
    Для Каждого ТекНастройка Из ПараметрыПоУмолчанию Цикл
        
        Если ТекНастройка.Параметр = "АгентСервера" Тогда
            
            СерверМассив = СтрРазделить(ТекНастройка.ПараметрЗначение, ":", Истина);
            Если СерверМассив.Количество() = 1 Тогда
                НастройкиДляЗаписи.Вставить("АдресКластера", СерверМассив[0]);
                НастройкиДляЗаписи.Вставить("ПортАгентаКластера", 1540);
            ИначеЕсли СерверМассив.Количество() = 2 Тогда
                НастройкиДляЗаписи.Вставить("АдресКластера", СерверМассив[0]);
                НастройкиДляЗаписи.Вставить("ПортАгентаКластера", СерверМассив[1]);
            КонецЕсли;
            
        ИначеЕсли ТекНастройка.Параметр = "ВерсияПлатформы" Тогда
             НастройкиДляЗаписи.Вставить("ВерсияПлатформы", ТекНастройка.ПараметрЗначение);    
        ИначеЕсли ТекНастройка.Параметр = "ПортКластера" Тогда
             НастройкиДляЗаписи.Вставить("ПортКластера", ТекНастройка.ПараметрЗначение);
        КонецЕсли;
                
    КонецЦикла;
    
    РегистрыСведений.ПараметрыКластеров.ЗаписатьНастройки(Справочники.ВидыОбъектовКонтроля.КластерСерверов1С, НастройкиДляЗаписи);
    
КонецПроцедуры

#КонецОбласти
