#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

//Процедура СоздатьОповещение(ОповещениеИнцидента) Экспорт
//    
//    ТекДата = ТекущаяУниверсальнаяДата();
//    
//	МенеджерЗаписи = РегистрыСведений.ТекущееСостояниеПовторногоОповещения.СоздатьМенеджерЗаписи();
//	МенеджерЗаписи.Оповещение = ОповещениеИнцидента;
//    МенеджерЗаписи.ВремяГрупповогоОповещения = ТекДата;
//    МенеджерЗаписи.ВремяПовторногоОповещения = ТекДата;
//            		
//	МенеджерЗаписи.Записать(Истина);
//	
//КонецПроцедуры

//Процедура УстановитьВремяГрупповогоОповещения(ОповещениеИнцидента, ЗначениеДаты = Неопределено) Экспорт
//	
//	Если ЗначениеДаты = Неопределено Тогда
//		ТекДата = ТекущаяУниверсальнаяДата();
//	Иначе
//		ТекДата = ЗначениеДаты;
//	КонецЕсли;
//		
//	МенеджерЗаписи = РегистрыСведений.ТекущееСостояниеПовторногоОповещения.СоздатьМенеджерЗаписи();
//	МенеджерЗаписи.Оповещение = ОповещениеИнцидента;
//	МенеджерЗаписи.Прочитать();
//	МенеджерЗаписи.Оповещение = ОповещениеИнцидента;
//	МенеджерЗаписи.ВремяГрупповогоОповещения = ТекДата;
//	МенеджерЗаписи.Записать(Истина);
//		
//КонецПроцедуры

//Процедура УстановитьВремяПовторногоОповещения(ОповещениеИнцидента, ЗначениеДаты = Неопределено) Экспорт
//	
//	Если ЗначениеДаты = Неопределено Тогда
//		ТекДата = ТекущаяУниверсальнаяДата();
//	Иначе
//		ТекДата = ЗначениеДаты;
//	КонецЕсли;
//		
//	МенеджерЗаписи = РегистрыСведений.ТекущееСостояниеПовторногоОповещения.СоздатьМенеджерЗаписи();
//	МенеджерЗаписи.Оповещение = ОповещениеИнцидента;
//	МенеджерЗаписи.Прочитать();
//	МенеджерЗаписи.Оповещение = ОповещениеИнцидента;
//	МенеджерЗаписи.ВремяПовторногоОповещения = ТекДата;
//	МенеджерЗаписи.Записать(Истина);
//		
//КонецПроцедуры

//Процедура ЗакрытьОповещение(Оповещение) Экспорт
//	
//	НаборЗаписей = РегистрыСведений.ТекущееСостояниеПовторногоОповещения.СоздатьНаборЗаписей();
//	НаборЗаписей.Отбор.Оповещение.Установить(Оповещение);
//	НаборЗаписей.Записать(Истина);
//	
//КонецПроцедуры

Функция ОповещениеЗакрыто(Оповещение) Экспорт
	
	ОповещениеЗакрыто = Истина;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ISNULL(КОЛИЧЕСТВО(*), 0) КАК Количество
	|ИЗ
	|	РегистрСведений.ТекущееСостояниеПовторногоОповещенияОперативного
	|ГДЕ
	|	Оповещение = &Оповещение
	|";
	Запрос.УстановитьПараметр("Оповещение", Оповещение);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		Если Выборка.Количество <> 0 Тогда
			ОповещениеЗакрыто = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ОповещениеЗакрыто;
	
КонецФункции

#КонецОбласти

#КонецЕсли