#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
    
#Область ПрограммныйИнтерфейс

Процедура ДобавитьСсылку(Ссылка, ДополнительнаяИнформация = Неопределено) Экспорт
    
    МенеджерЗаписи = СоздатьМенеджерЗаписи();
    МенеджерЗаписи.ПериодУдаления = ТекущаяУниверсальнаяДата();
    МенеджерЗаписи.Ссылка = Ссылка;
    МенеджерЗаписи.ДополнительнаяИнформация = ДополнительнаяИнформация;
    МенеджерЗаписи.Записать(Ложь);
    
КонецПроцедуры

#КонецОбласти

#КонецЕсли
