
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если Константы.КоличествоДамповНовогоВарианта.Получить() = 0 Тогда
        Константы.КоличествоДамповНовогоВарианта.Установить(1);
    КонецЕсли;
    
    ЭтотОбъект.КоличествоДамповНовогоВарианта = Константы.КоличествоДамповНовогоВарианта.Получить();
            
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КоличествоДамповНовогоВариантаПриИзменении(Элемент)
    Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
    
    Записать(Команда);
    ЭтотОбъект.Закрыть();
    
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
    
    ЗаписатьНаСервере(ЭтотОбъект.КоличествоДамповНовогоВарианта);
    Модифицированность = Ложь;
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ЗаписатьНаСервере(КоличествоДамповНовогоВарианта)
    Константы.КоличествоДамповНовогоВарианта.Установить(КоличествоДамповНовогоВарианта);
КонецПроцедуры

#КонецОбласти
