
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("Ключ", ПолучитьКлючЗаписиНаСервере());
	ОткрытьФорму("РегистрСведений.ПараметрыРабочихСерверов.Форма.ФормаЗначенияПоУмолчанию", ПараметрыФормы);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКлючЗаписиНаСервере()
	
	РабочийСервер = Справочники.ВидыОбъектовКонтроля.РабочийСервер.Ссылка;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОбъектКонтроля
	|ИЗ
	|	РегистрСведений.ПараметрыРабочихСерверов
	|ГДЕ
	|	ОбъектКонтроля = &РабочийСервер
	|";
	Запрос.УстановитьПараметр("РабочийСервер", РабочийСервер);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		МенеджерЗаписи = РегистрыСведений.ПараметрыРабочихСерверов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ОбъектКонтроля = РабочийСервер;
		МенеджерЗаписи.Записать(Истина);
	КонецЕсли;
	
	ЗначенияКлюча = Новый Структура;
	ЗначенияКлюча.Вставить("ОбъектКонтроля", РабочийСервер); 
	
	Возврат РегистрыСведений.ПараметрыРабочихСерверов.СоздатьКлючЗаписи(ЗначенияКлюча);
	
КонецФункции