
&НаКлиенте
Процедура ВариантыДамповВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуВариантаДампа();
		
КонецПроцедуры


&НаКлиенте
Процедура ВариантыДамповПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ВариантыДамповПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВариантыДамповПриАктивизацииСтрокиОбработчикОжидания()
	
	ТекущаяСтрокаВариантовДампа = Элементы.ВариантыДампов.ТекущиеДанные;
	СсылкаНаВариантДампа = ?(ТекущаяСтрокаВариантовДампа = Неопределено, Неопределено, Элементы.ВариантыДампов.ТекущиеДанные.Ссылка);
	СписокДампы.Параметры.УстановитьЗначениеПараметра("ВариантДампа", СсылкаНаВариантДампа);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВариантаДампа()
	
	ТД = Элементы.ВариантыДампов.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура("Ключ, ТолькоПросмотр", ТД.Ссылка, Истина);
	ОткрытьФорму("Справочник.ВариантыДампов.Форма.ФормаЭлемента", ПараметрыОткрытия);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВариантыДампов.Параметры.УстановитьЗначениеПараметра("СлужебныйВариантДампов", Справочники.ВариантыДампов.ДляЗавершенияБезОбразованияДампа);
	СписокДампы.Параметры.УстановитьЗначениеПараметра("ВариантДампа", Справочники.ВариантыДампов.ПустаяСсылка());
КонецПроцедуры


