
&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Группа = Параметры.Группа;
КонецПроцедуры

&НаСервере
Процедура ОКНаСервере()
	УстановитьПривилегированныйРежим(Истина);
	Пользователь = Справочники.Пользователи.СоздатьЭлемент();
	Пользователь.Наименование = Логин;
	Пользователь.ПоказыватьВСпискеВыбора = Истина;
	
	СтрокаРоли = Пользователь.Роли.Добавить();
	СтрокаРоли.Выбрана = Истина;
	СтрокаРоли.Роль = "ЦентрМониторингаПользователь";
	СтрокаРоли.СинонимРоли = Метаданные.Роли.ЦентрМониторингаПользователь.Синоним;
	
	Пользователь.ДополнительныеСвойства.Вставить("СохраняемыйПарольПользователя", Пароль);
	
	Пользователь.Записать();
	
	ГруппаОбъект = Группа.ПолучитьОбъект();
	СтрокаУчастника = ГруппаОбъект.УчастникиГруппы.Добавить();
	СтрокаУчастника.Пользователь = Пользователь.Ссылка;
	ГруппаОбъект.Записать();
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	Если Пароль = ПодтверждениеПароля Тогда 
		ОКНаСервере();
		Закрыть();
	Иначе 
		Сообщить("Пароль и подтверждение не совпадают!");
		Пароль = "";
		ПодтверждениеПароля = "";
	КонецЕсли;
КонецПроцедуры
