
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Список.Параметры.УстановитьЗначениеПараметра("ИнформационнаяБаза", Справочники.ОбъектыКонтроля.ПолучитьСсылкуПоНаименованию("Центр контроля качества"));
    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    
    Если Поле.Имя = "ПомеченаНаУдаление" Тогда
        
        ИзменитьОтключить(ВыбраннаяСтрока);
        СтандартнаяОбработка = Ложь;
        
    Иначе
        
        ПараметрыОткрытия = Новый Структура("Ключ", ВыбраннаяСтрока);
        ОткрытьФорму("РегистрСведений.ОценкаПроизводительностиКлючевыеОперации.Форма.ФормаЗаписиВнутренниеЗамеры", ПараметрыОткрытия);
        СтандартнаяОбработка = Ложь;
        
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИзменитьОтключить(КлючЗаписи)
    
    МенеджерЗаписи = РегистрыСведений.ОценкаПроизводительностиКлючевыеОперации.СоздатьМенеджерЗаписи();
    МенеджерЗаписи.УникальныйИдентификатор = КлючЗаписи.УникальныйИдентификатор;
    МенеджерЗаписи.ИнформационнаяБаза = КлючЗаписи.ИнформационнаяБаза;
    МенеджерЗаписи.Прочитать();
    
    МенеджерЗаписи.УникальныйИдентификатор = КлючЗаписи.УникальныйИдентификатор;
    МенеджерЗаписи.ИнформационнаяБаза = КлючЗаписи.ИнформационнаяБаза;
    МенеджерЗаписи.ПомеченаНаУдаление = НЕ МенеджерЗаписи.ПомеченаНаУдаление;
    
    МенеджерЗаписи.Записать(Истина);
    
    Элементы.Список.Обновить();
        
КонецПроцедуры

#КонецОбласти
