#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПолучитьОсновнойШаблонНовыйДампРассмотреть() Экспорт
	Возврат "[ДатаДампа=дд.ММ.гг ЧЧ:мм];[Отправитель];Рассмотреть дамп;[ИмяПроцесса]_[Платформа]_[Смещение];pid=[Процесс];Зарегистрирован [Дата=дд.ММ.гг ЧЧ:мм]"; 
КонецФункции

Функция ПолучитьОсновнойШаблонКаталогЛоговЗавершившегосяПроцессаПуст() Экспорт
	Возврат "[Дата=дд.ММ.гг ЧЧ:мм];[Отправитель];Файлы с логами процесса rphost [Процесс] не найдены;";
КонецФункции

#КонецЕсли
