#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Подбор(Команда)
	Оповещение = Новый ОписаниеОповещения("ОбработатьДанныеПодбора", ЭтотОбъект);
	ОткрытьФорму("Справочник.ОграниченияДоступаККонтурамАдминистрирования.Форма.ФормаПодбора", , ЭтотОбъект,,,,Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьДанныеПодбора(Параметры, ДополнительныеПараметры) Экспорт
	Если Параметры <> Неопределено Тогда
		Для каждого Строка Из Параметры Цикл
			Если Строка.Выбран И Объект.ПользователиИБ.НайтиСтроки(Новый Структура("Имя",Строка.Имя)).Количество() = 0 Тогда
				НоваяСтрока = Объект.ПользователиИБ.Добавить();
				НоваяСтрока.Имя = Строка.Имя;
				НоваяСтрока.ПолноеИмя = Строка.ПолноеИмя;
				Модифицированность = Истина;
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти