
&НаКлиенте
Процедура НайтиИсключение(Команда)
	
	ОчиститьСообщения();
	Результат = НайтиНаСервере();
	
	Если Результат = Неопределено Тогда
		Сообщить(НСтр("ru = 'Указан несуществующий код'"));
	Иначе
		ПараметрыФормы = Новый Структура("Ключ", Результат);
		ОткрытьФорму("Справочник.ИсключительныеСитуации.ФормаОбъекта", ПараметрыФормы, , ,);
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НайтиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсключительныеСитуации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИсключительныеСитуации КАК ИсключительныеСитуации
		|ГДЕ
		|	ИсключительныеСитуации.КодОшибки = &КодОшибки";
	Запрос.УстановитьПараметр("КодОшибки", КодВБазеЗадач);
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Если Выгрузка.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Выгрузка[0].Ссылка;
	КонецЕсли;
	
КонецФункции
