#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для каждого ОбъектМетаданных Из Метаданные.Справочники Цикл
		Элементы.МетаданныеСвязанныхОбъектовИмяОбъекта.СписокВыбора.Добавить(ОбъектМетаданных.ПолноеИмя());
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыОтносительнаяСсылкаНаЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Элемент.СписокВыбора.Очистить();
	Если Элемент.Родитель.Родитель.ТекущиеДанные.СпособЗаполненияПараметра = ПредопределенноеЗначение("Перечисление.СпособыЗаполненияПараметровКоманды.ИзОбъектаМетаданных") Тогда
		Данные = РаботаСоСценариямиАвтоматизацииСервер.ОбновитьСписокВыбораОтносительныхСсылок(Объект.МетаданныеСвязанныхОбъектов);
		Элемент.СписокВыбора.ЗагрузитьЗначения(Данные.ВыгрузитьЗначения());
	КонецЕсли;	
	Элемент.СписокВыбора.Вставить(0, "Строка");
	
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура Перенести(Команда)
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаПараметрыОбязательные Тогда
		ТекДанные = Элементы.ПараметрыОбязательные.ТекущиеДанные;
		Если ТекДанные <> Неопределено Тогда
			НоваяСтрока = Объект.ПараметрыДополнительные.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекДанные);
			Объект.ПараметрыОбязательные.Удалить(ТекДанные);
		КонецЕсли;	
	Иначе
		ТекДанные = Элементы.ПараметрыДополнительные.ТекущиеДанные;
		Если ТекДанные <> Неопределено Тогда
			НоваяСтрока = Объект.ПараметрыОбязательные.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекДанные);
			Объект.ПараметрыДополнительные.Удалить(ТекДанные);
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти