
#Область ОбработчикиСобыитийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    ИнициализироватьКомпоновщик();
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьКомпоновщик()
    
    Поля = Новый Массив;
    Поля.Добавить("Ссылка");
    Поля.Добавить("Родитель");
    Поля.Добавить("Код");
    Поля.Добавить("ПолныйКодДляПоиска");
    Поля.Добавить("РазрешитьУстановитьПометкуУдаления");
    Поля.Добавить("КодДляПоиска");
    Поля.Добавить("КонтрольПоступленияДанных");
    Поля.Добавить("ДопустимоеВремяОтсутствияДанных");
    Поля.Добавить("Предопределенный");
    Поля.Добавить("ИмяПредопределенныхДанных");
    Список.УстановитьОграниченияИспользованияВОтборе(Поля);
     
КонецПроцедуры

#КонецОбласти
