#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПолучитьТекущиеНомераПакетовДляОтправки(ВнешнийЦКК, МаксимальныйНомерПакета) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СтатистикаБуферДатаВнешниеЦКК.ПорядковыйНомерПакета КАК ПорядковыйНомерПакета
	|ИЗ
	|	РегистрСведений.СтатистикаБуферДатаВнешниеЦКК КАК СтатистикаБуферДатаВнешниеЦКК
	|ГДЕ
	|	СтатистикаБуферДатаВнешниеЦКК.ВнешнийЦКК = &ВнешнийЦКК
	|	И СтатистикаБуферДатаВнешниеЦКК.ПорядковыйНомерПакета <= &МаксимальныйНомерПакета
	|";
	
	Запрос.УстановитьПараметр("ВнешнийЦКК", ВнешнийЦКК);
	Запрос.УстановитьПараметр("МаксимальныйНомерПакета", МаксимальныйНомерПакета);
	
	Результат = Запрос.Выполнить();
	
	НомераПакетов = Новый Массив;
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		НомераПакетов.Добавить(Выборка.ПорядковыйНомерПакета);
	КонецЦикла;
	
	Возврат НомераПакетов;
КонецФункции

Процедура УдалитьДанныеПакета(ВнешнийЦКК, ПорядковыйНомерПакета) Экспорт
	НаборЗаписей = РегистрыСведений.СтатистикаБуферДатаВнешниеЦКК.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВнешнийЦКК.Установить(ВнешнийЦКК);
	НаборЗаписей.Отбор.ПорядковыйНомерПакета.Установить(ПорядковыйНомерПакета);
	НаборЗаписей.Записать();
КонецПроцедуры

#КонецЕсли