#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыполнитьОбновлениеОтображаемыхДанных()
	СтруктураДат = РаботаСоСценариямиАвтоматизацииСервер.ПолучитьСтруктуруДатСеанса();
	
	ТекДата = СтруктураДат.ТекущаяДатаСеанса;
	ТекУниверсальнаяДата = СтруктураДат.ТекущаяУниверсальнаяДатаСеанса;
	
	// дерево сценариев
	ПараметрДанных = ЭтотОбъект.МониторВыполнения.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ПлановаяДатаЗапуска");
    ПараметрДанных.Значение = НачалоЧаса(ТекДата) + 8*3600;
	ПараметрДанных.Использование = Истина;
	
	ПараметрДанных = ЭтотОбъект.МониторВыполнения.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ПлановаяДатаОкончания");
    ПараметрДанных.Значение = НачалоЧаса(ТекДата) - 8*3600;
	ПараметрДанных.Использование = Истина;
	
	// список проблемных фоновых
	ПараметрДанных = ЭтотОбъект.ПроблемыСЗадачамиПланировщика.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("РазницаСУниверсальнойДатой");
    ПараметрДанных.Значение =  ТекДата - ТекУниверсальнаяДата;
	ПараметрДанных.Использование = Истина;
	
	ПараметрДанных = ЭтотОбъект.ПроблемыСЗадачамиПланировщика.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ТекущаяДатаUTC");
    ПараметрДанных.Значение = ТекУниверсальнаяДата;
	ПараметрДанных.Использование = Истина;
	
	// активность агентов
	ПараметрДанных = ЭтотОбъект.АктивностьАгентов.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("РазницаСУниверсальнойДатой");
    ПараметрДанных.Значение =  ТекДата - ТекУниверсальнаяДата;
	ПараметрДанных.Использование = Истина;
	
	ПараметрДанных = ЭтотОбъект.АктивностьАгентов.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ТекущаяДатаUTC");
    ПараметрДанных.Значение = ТекУниверсальнаяДата;
	ПараметрДанных.Использование = Истина;
КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВыполнитьОбновлениеОтображаемыхДанных();
	ПодключитьОбработчикОжидания("ВыполнитьОбновлениеОтображаемыхДанных", 20);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОтключитьОбработчикОжидания("ВыполнитьОбновлениеОтображаемыхДанных");
КонецПроцедуры

#КонецОбласти