
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Запись.GUID = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000") Тогда
		Запись.GUID = Новый УникальныйИдентификатор;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УсловияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)                                                                      
	ОписаниеОповещения = Новый ОписаниеОповещения("УсловияПослеВыбора", ЭтотОбъект);
	ОткрытьФорму("РегистрСведений.ПравилаСвойствСообщений.Форма.ФормаНастройкиУсловий", Новый Структура("Условия", Запись.Условия), ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


&НаКлиенте
Процедура УсловияПослеВыбора(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ЗаписьXML.ЗаписатьНачалоЭлемента("condition");
	Для Каждого Элемент Из Результат Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("case");
		ЗаписьXML.ЗаписатьАтрибут("condition", Элемент.ТипСравнения);
		ЗаписьXML.ЗаписатьАтрибут("property", Элемент.ИмяСвойства);
		ЗаписьXML.ЗаписатьАтрибут("type", Элемент.ТипСвойства);
		ЗаписьXML.ЗаписатьАтрибут("value", Элемент.Значение);		
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Запись.Условия = ЗаписьXML.Закрыть();
КонецПроцедуры