
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
        ЭтотОбъект.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Нет;
        ЭтотОбъект.Элементы.Наименование.Видимость = Ложь;
        ЭтотОбъект.Элементы.ГруппаКоманднаяПанельНастройкиПоУмолчанию.Видимость = Истина;
        ЭтотОбъект.Элементы.ЗаписатьИЗАкрытьМоя.КнопкаПоУмолчанию = Истина;
    КонецЕсли;
    
    ЗаполнитьНастройкиПоУмолчанию();    
    
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    ЗаписатьНастройкиПоУмолчанию();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрытьМоя(Команда)
    
    ЗаписатьНастройкиПоУмолчанию();
    ЭтотОбъект.Закрыть();
    
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьМоя(Команда)
    ЗаписатьНастройкиПоУмолчанию();
КонецПроцедуры

&НаКлиенте
Процедура РасписаниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    
    Диалог = Новый ДиалогРасписанияРегламентногоЗадания(ЭтотОбъект.Расписание);
	Диалог.Показать(Новый ОписаниеОповещения("ОткрытьРасписаниеЗавершение", ЭтотОбъект));
    
    СтандартнаяОбработка = Ложь;
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНастройкиПоУмолчанию()
    
    Настройки = РегистрыСведений.НастройкиКонтрольПроизводительности.ПрочитатьНастройки(Справочники.ВидыКонтрольныхПроцедур.КонтрольПроизводительности());
        
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "КаталогФайловОценкиПроизводительности";
    НовСтрока.ПараметрПредставление = "Каталог файлов оценки производительности";
    НовСтрока.ПараметрЗначение = Настройки.КаталогФайловОценкиПроизводительности;
    
    ЭтотОбъект.Расписание = Настройки.Расписание;
    Если ЭтотОбъект.Расписание = Неопределено Тогда
        ЭтотОбъект.Расписание = Новый РасписаниеРегламентногоЗадания;
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиПоУмолчанию()
    
    Настройки = Новый Структура;
    
    Для Каждого ТекПараметр Из ПараметрыПоУмолчанию Цикл
        Настройки.Вставить(ТекПараметр.Параметр, ТекПараметр.ПараметрЗначение);
    КонецЦикла;
    
    Настройки.Вставить("Расписание", ЭтотОбъект.Расписание);
    
    РегистрыСведений.НастройкиКонтрольПроизводительности.ЗаписатьНастройки(Справочники.ВидыКонтрольныхПроцедур.КонтрольПроизводительности(), Настройки);
    
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРасписаниеЗавершение(НовоеРасписание, Неопределен) Экспорт
    
    Если НовоеРасписание <> Неопределено Тогда
		ЭтотОбъект.Расписание = НовоеРасписание;
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти
