#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ПередЗаписью(Отказ)
	
	ДобавитьРуководителяВГруппу();
	ЗаполнитьПраваНаГруппу();
		
КонецПроцедуры

Процедура ДобавитьРуководителяВГруппу()
	
	ВГруппе = УчастникиГруппы.Найти(РуководительГруппы, "Пользователь");
	
	Если ВГруппе = Неопределено Тогда 
		СтрокаТЧ = УчастникиГруппы.Добавить();
		СтрокаТЧ.Пользователь = РуководительГруппы;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПраваНаГруппу()
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписей = РегистрыСведений.ДоступныеГруппыЦентрМониторинг.СоздатьНаборЗаписей();
	Если ЭтоНовый() Тогда 
		ЭтотОбъект.УстановитьСсылкуНового(Справочники.ГруппыПользователейЦентрМониторинга.ПолучитьСсылку());	
		НаборЗаписей.Отбор.ГруппаПользователей.Установить(ЭтотОбъект.ПолучитьСсылкуНового());	
	Иначе
		НаборЗаписей.Отбор.ГруппаПользователей.Установить(Ссылка);
	КонецЕсли;
	
	ТЗ = СформироватьТаблицуЗначенийПользователейПоГруппе();
	
	НаборЗаписей.Загрузить(ТЗ);
	НаборЗаписей.Записать(Истина);
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Функция СформироватьТаблицуЗначенийПользователейПоГруппе()
	
	ТЗ = УчастникиГруппы.Выгрузить();
	ТЗ.Колонки.Добавить("ГруппаПользователей", Новый ОписаниеТипов("СправочникСсылка.ГруппыПользователейЦентрМониторинга"));
	Если ЭтоНовый() Тогда  
		ТЗ.ЗаполнитьЗначения(ЭтотОбъект.ПолучитьСсылкуНового(), "ГруппаПользователей");	
	Иначе
		ТЗ.ЗаполнитьЗначения(Ссылка, "ГруппаПользователей");
	КонецЕсли;
	Возврат ТЗ;
	
КонецФункции

#КонецЕсли