
Процедура ВыполнитьАнализ(КонтрольнаяПроцедура) Экспорт
    
    ИмяЦентраКонтроля = КонтрольнаяПроцедура.ОбъектКонтроля.Наименование;
		
	НастройкиПриватныеСловарь = РегистрыСведений.НастройкиВнешнийКонтрольЦКК.Получить(Новый Структура("КонтрольнаяПроцедура", КонтрольнаяПроцедура));		
	МаксимальнаяДатаПрочитанныхПисем = НастройкиПриватныеСловарь.МаксимальнаяДатаПрочитанныхПисемСкрыто;
    
    НетПроблем = Истина;

	Профиль = Новый ИнтернетПочтовыйПрофиль;
	
	Профиль = ИнтернетПочта.СформироватьИнтернетПрофиль(
		ИнтернетПочта.ПолучитьСистемнуюУчетнуюЗапись()	
	);
	
	Почта = Новый ИнтернетПочта;
	Попытка
		Почта.Подключиться(Профиль);
		ЗаголовкиОтчетов = Новый Массив;
		ВсеЗаголовки = Почта.ПолучитьЗаголовки();
	Исключение
		НетПроблем = Неопределено;
		ИмяСтраницыСправки = "ВнешнийКонтрольЦККНеизвестнаяОшибка";
		Сообщение = НСтр("ru = 'Ошибка при получении отчетов: %1'");
		Сообщение = СтрЗаменить(Сообщение, "%1", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	Для Каждого Заголовок Из ВсеЗаголовки Цикл
		Если Заголовок.Тема = Оповещение.ПрефиксЗаголовкаОтчетаЦКК() + ИмяЦентраКонтроля Тогда
			ЗаголовкиОтчетов.Добавить(Заголовок);	
		КонецЕсли;
	КонецЦикла;
	
	Если ЗаголовкиОтчетов.Количество() = 0 Тогда
		ТекстПредупреждения = НСтр("ru = 'Восстановить работоспособность ЦКК'");

		НетПроблем = Ложь;
		
	Иначе
		Почта.Выбрать(Истина, ЗаголовкиОтчетов);	
	КонецЕсли;
	
	Почта.Отключиться();	
	
КонецПроцедуры