#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Выполняет запись информации об активности агента.
//
// Параметры:
//	Агент - Справочник.АгентыКИП - Агент, активность которого необходимо отметить.
//	ДатаАктивности - Дата - дата последней активности агента.
//
Процедура ЗаписатьИнформациюОбАктивностиАгента(Агент, ДатаАктивности) Экспорт

	Запись = СоздатьМенеджерЗаписи();
	Запись.АгентКИП = Агент;
	Запись.ДатаКрайнейАктивности = ДатаАктивности;
	Запись.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли