
#Область ПрограммныйИнтерфейм

Процедура ОткрытьФормуПослеОбновления() Экспорт
    ПодключитьОбработчикОжидания("ОткрытьФормуПослеОбновленияПодключаемая", 0.1, Истина);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОткрытьФормуПослеОбновленияПодключаемая() Экспорт
    
    ФормаПослеОбновления = ОбщийВызовСервера.ФормаПослеОбновления();
    Если ЗначениеЗаполнено(ФормаПослеОбновления) Тогда
        ОткрытьФорму(ФормаПослеОбновления,,,,,,,РежимОткрытияОкнаФормы.Независимый);
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти

