
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если ЭтотОбъект.Параметры.Свойство("СобиратьДанные") Тогда
        
        НовСтрока = ЭтотОбъект.РеквизитыИзменить.Добавить();
        
        НовСтрока.ФлагИзменить = Истина;
        НовСтрока.ИмяРеквизита = "СобиратьДанные";
        НовСтрока.ПредставлениеРеквизита = "Собирать данные";
        НовСтрока.ЗначениеРеквизита = ЭтотОбъект.Параметры.СобиратьДанные;
                
    КонецЕсли;
    
    Если ЭтотОбъект.Параметры.Свойство("Зафиксировать") Тогда
        
        НовСтрока = ЭтотОбъект.РеквизитыИзменить.Добавить();
        
        НовСтрока.ФлагИзменить = Истина;
        НовСтрока.ИмяРеквизита = "Зафиксировать";
        НовСтрока.ПредставлениеРеквизита = "Зафиксировать";
        НовСтрока.ЗначениеРеквизита = ?(ЭтотОбъект.Параметры.Зафиксировать = 0, Ложь, Истина);
        
    КонецЕсли;
    
    Если ЭтотОбъект.Параметры.Свойство("КонтрольПоступленияДанных") Тогда
        
        НовСтрока = ЭтотОбъект.РеквизитыИзменить.Добавить();
        
        НовСтрока.ФлагИзменить = Истина;
        НовСтрока.ИмяРеквизита = "КонтрольПоступленияДанных";
        НовСтрока.ПредставлениеРеквизита = "Контроль поступления данных";
        НовСтрока.ЗначениеРеквизита = ЭтотОбъект.Параметры.КонтрольПоступленияДанных;
        
    КонецЕсли;
    
    Если ЭтотОбъект.Параметры.Свойство("ДопустимоеВремяОтсутствияДанных") Тогда
        
        НовСтрока = ЭтотОбъект.РеквизитыИзменить.Добавить();
        
        НовСтрока.ФлагИзменить = Истина;
        НовСтрока.ИмяРеквизита = "ДопустимоеВремяОтсутствияДанных";
        НовСтрока.ПредставлениеРеквизита = "Допустимое время отсутствия данных, мин";
        НовСтрока.ЗначениеРеквизита = ЭтотОбъект.Параметры.ДопустимоеВремяОтсутствияДанных;
        
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Установить(Команда)
    
    РезультатЗакрытия = Новый Структура;
    
    Для Каждого ТекСтрока Из ЭтотОбъект.РеквизитыИзменить Цикл
        
        Если ТекСтрока.ИмяРеквизита = "СобиратьДанные" И ТекСтрока.ФлагИзменить Тогда
            РезультатЗакрытия.Вставить("СобиратьДанные", ТекСтрока.ЗначениеРеквизита);
        ИначеЕсли ТекСтрока.ИмяРеквизита = "Зафиксировать" И ТекСтрока.ФлагИзменить Тогда
            РезультатЗакрытия.Вставить("Зафиксировать", ?(ТекСтрока.ЗначениеРеквизита, 1, 0));
        ИначеЕсли ТекСтрока.ИмяРеквизита = "КонтрольПоступленияДанных" И ТекСтрока.ФлагИзменить Тогда
            РезультатЗакрытия.Вставить("КонтрольПоступленияДанных", ТекСтрока.ЗначениеРеквизита);
        ИначеЕсли ТекСтрока.ИмяРеквизита = "ДопустимоеВремяОтсутствияДанных" И ТекСтрока.ФлагИзменить Тогда
            РезультатЗакрытия.Вставить("ДопустимоеВремяОтсутствияДанных", ТекСтрока.ЗначениеРеквизита);    
        КонецЕсли;
        
    КонецЦикла;
    
    ЭтотОбъект.Закрыть(РезультатЗакрытия);
    
КонецПроцедуры

#КонецОбласти
